{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmaZi--G15cCBMvoaf8iZk36JYSr5s7cYqpVZvLsharlE7u1e7TA\" alt=\"cell\" style=\"width: 700px\">\n<p>We don’t choose our birth parents. Most people haven’t reflected on the fact that being born to this world is not of our own choosing. Gary Vaynerchuck’s quote for the odds of being a human is 400 trillion to one. Okay, religious people will credit a “creator”  but I hate to break it because there is no God or Allah or even Buddah. I hope I can capture the history and process (also arguements) on how I corrected my fate in this blog post. I hope you can draw </p>\n<img src=\"\" alt=\"sanildefonso\" style=\"width: 700px\">\n<p>I was born to a poor family in San Ildefonso, a town 2 hours from Manila, our nation’s Capital in 1985.\nFor the most part of my childhood, I am serving the local church as an altar boy..even got medals for it.\nAll of my friends did the same. My whole family did too. I was so proud in serving the weekly-evening-saturday-mass. I always felt that I was the cool person helping spread the word of God.</p>\n<img src=\"\" alt=\"university\" style=\"width: 700px\">\n<p>Maybe my view-point changed a little bit when I started my university studies. In my second year, I was able to answer a very difficult problem by deducting environmental effects as to how greeks became the creators of the scientific approach and birthed philosophy. Also, things doesn’t add up.. The very people that taught me to adhere to catholic virtues seem to sway away from it. At the back of my head something is missing and but paralyzed of my incapacity to understand the core of it. </p>\n<img src=\"\" alt=\"christianity\" style=\"width: 700px\">\n<p>During my board examinations for praticing public and private accounting, I reconnected in my inner desire to connect with the creator. Most of our instructors explain the role of “God handling the things that we can’t control” during the examination. Things like:</p>\n<ul>\n<li>Eating spoiled food. Some counter this by bringing packed lunch.</li>\n<li>Worst room airconditioning. It takes 3 excruciating hours for each exam at the time. Room selection is random and based on your last name and selected schools by the Board of Accountancy. </li>\n<li>Forgetting to bring important stuff like your exam passes or IDs. </li>\n</ul>\n<p>Arriving late bars you from entering the examination premises. Strees. Traffic. A lot of reasons. You get the picture.</p>\n<p>If I were to have a hand in my fate as to where I should start this life of sacrifice and struggle I wouldn’t choose a developing country hampered by corruption and social turmoil. </p>","excerpt":"We don’t choose our birth parents. Most people haven’t reflected on the fact that being born to this world is not of our own choosing. Gary…","fields":{"tagSlugs":["/tags/personal/","/tags/darwinian-model/"]},"frontmatter":{"title":"Why I became an Agnostic (a person who doesn't believe in any religion)..","tags":["personal","darwinian model"],"date":"January 27, 2019"}}},"pageContext":{"slug":"/Genetic-lottery/"}}