{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>Intermenttent fasting is going well so far, avocados in the Americas cheaper than the Philippines..</em></strong></p>\n<p>Intermentent fasting is still going strong, haven’t had any big side effects from it. I normally stop eating from eight in the evening up to twelve noon of the following day. I don’t feel loss of energy in between, even if my job requires phyisical and superior mental focus all the time. I can adapt to multiple routes of transactions, mostly handling sensitive issues. I credit my strong ability to adapt comes from the ketogenic diet, anchoring fats as the main source of energy. Fasting was compatible to keto as it triggers more fat consumption. But take this blog with a grain of salt as I am still yet to reach a year or two with intermittent fasting or even the ketogenic diet. </p>\n<p>Another astonishing fact that I have measured was from 125 lbs I became heavier to 126.6 lbs which I really can’t explain. Possibly that I am consuming more fats and doing more slow calisthenics routines for muscle building.</p>\n<p>Avocados are amazing here in Cayman Islands. I am so lucky that the abundance all year round of healthy produce for my diet. My friend in almost a similar diet is explaining to me that Philippines is selling avocados per kilo at three to four times the price here. That is really another bewildering thought, It could be that since most people cannot afford pricy and seasonal produce, they try to stranggle the market by making prices high. This strategy will work in third world countries where governments are corrupt. I might be wrong but this is what I believe. </p>\n<p>Edited yesterday’s blog <a href=\"https://tech-stoic.github.io/momento-mori/\">Momento Mori</a></p>\n<p>PS. Have been vlogging again, my random topic today is <a href=\"https://www.youtube.com/watch?v=aLv76nT3KpM\">Batching important activities</a></p>","excerpt":"Intermenttent fasting is going well so far, avocados in the Americas cheaper than the Philippines.. Intermentent fasting is still going…","fields":{"tagSlugs":["/tags/keto/","/tags/blog/"]},"frontmatter":{"title":"Keto 7 and a half months in..","tags":["keto","blog"],"date":"November 19, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/keto-seven-months-in copy/"}}