{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<br/>\n<h3><b><em>I really wish I had more time!</em></b></h3>\n<p><img src=\"rocketman.jpg\" alt=\"rocketman\">\n<br/></p>\n<p>Just a quick blog about <a href=\"https://en.wikipedia.org/wiki/Elon_Musk\">Elon Musk</a>, using my lunch time to make draft blogs is in-operable as of late because of the need of me to concentrate on solving some problems at my work in Cayman Islands. </p>\n<p>Back to Elon… I’ve followed him for years now where he was working on <a href=\"https://tesla.com/\">Tesla</a> and <a href=\"https://spacex.com/\">SpaceX</a> after the infamous <a href=\"https://en.wikipedia.org/wiki/PayPal_Mafia\">PayPal Mafia</a> and always waiting for his September event yearly (often times exactly at my birthday) to see what cool stuff he have came up…that was before a lot of the newer <a href=\"https://neuralink.com\">Neuralink</a>, <a href=\"https://boringcompany.com/\">Boring Company</a> and <a href=\"https://starlink.com/\">Starlink</a>. I try to model his way of thinking a lot but yeah it is rather hard to mimic someone who I believe to have a genetic mutation. </p>\n<p>I wish to work for this guy in the future, the future where he is converging humanity to reach for the stars..</p>\n<p>PS. Obviously I could write a lot more info about Elon - maybe in the future, yet I would keep this blog open to like savor the moment where humanity was blessed with the mind and heart of probably will end up as the most important person in history ever.</p>","excerpt":"I really wish I had more time! \n Just a quick blog about  Elon Musk , using my lunch time to make draft blogs is in-operable as of late…","fields":{"tagSlugs":["/tags/creating-art/","/tags/people/","/tags/blog/"]},"frontmatter":{"title":"If I had more time","tags":["creating-art","people","blog"],"date":"August 28, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/if-i-had-more-time/"}}