{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0LT1weiR5HIDNKa9A9bMf4Pcgb9s7XykMHJxCZimTjHme7fnX\" alt=\"Gratitude\" style=\"width: 700px\">\n<p>Not the first time I’m writing about gratitude but I couldn’t help it, applying the habit is worth repeating over and over most specially in this blog. </p>\n<p>Be thankful of the opportunity to talk to your parents or friends overseas. Be thankful that you have time to create art, code projects or write a blog. The mere ability to write is to be thankful for..  The fact that we have two hands in comparison to a bird or a frog.. the mere fact that we breath air everytime we wake up is simply amazing. The miracle of our body to have an ability to feel emotion and be able to have a chance to reflect on how we feel is worth savoring, as we are the only animals who can do this. The never ending opportunity to do good is empowering. There so many small but essential things that enables us to do what we want to do in life that are most often gets under appreciated. </p>\n<p><em>Consider the people in Syria or Sub-saharan Africa where they can’t seem to perceive if they can live tomorrow..\nRape victims who simply cannot break the pattern of suffering. People that are in grief to the disasters caused by super typhoons or massive earthquakes. People who don’t have money to buy them a meal or a piece of clothing.</em></p>\n<p>Instead of starting your day with problems in mind do this instead and write the answer to this question the moment you wake up: </p>\n<p><em>“What three things am I grateful for today?”</em> </p>\n<p>Force yourself to relfect with gratitude every morning and trust me, you will look at things much better as you frame the day with optimism. Forming this habit have benefited me so well, I hope you will too.</p>","excerpt":"Not the first time I’m writing about gratitude but I couldn’t help it, applying the habit is worth repeating over and over most specially in…","fields":{"tagSlugs":["/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Gratitude","tags":["personal","blog"],"date":"February 16, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/gratitude/"}}