{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>Why does India have a space program and Filipinos does not even care about this question at all?</p>\n<p>My answer: </p>\n<p>The public and private sectors does not include technology as a part of their goals. We are falling far behind in the area of innovation.</p>\n<p>Take a look at these problems..</p>\n<ul>\n<li>\n<p>It is estimated that the country loses <a href=\"https://newsinfo.inquirer.net/970553/jica-traffic-congestion-now-costs-p3-5-billion-a-day-metro-manila-traffic-jica-cost-of-traffic\">3.5 billion pesos (66 million USD)</a> in traffic everyday. </p>\n</li>\n<li>\n<p>Degredation of natural resources is already affecting human lives. <a href=\"https://www.rappler.com/newsbreak/iq/212703-how-itogon-benguet-naga-cebu-landslides-are-alike\">Soil erosion killed 90 people</a> and others missing in two separate locations in a span of a week.</p>\n</li>\n<li>\n<p>A <a href=\"https://files.eric.ed.gov/fulltext/EJ1108534.pdf\">2016 study</a> shows that as a country, we are producing students incapable of adapting to the future.</p>\n</li>\n<li>\n<p>Food supply have been an issue in the recent months. <a href=\"https://www.foodnavigator-asia.com/Article/2018/08/30/Philippine-rice-crisis-escalates-as-shortages-push-prices-to-a-three-year-high\">Rice shortage</a> is a three year high. </p>\n</li>\n</ul>\n<p>Some of these problems have plagued us for the last couple of decades and shows evidence that we are not coping with the growing population and degredation of natural resources. As the under-educated population gets bigger and bigger, it then magnifies the problem leading to more loses in time, resources, opportunity and even lives. <!-- What I meant by under-educated Filipinos are the ones who decide to just complain about the situation and just follow the big three (this is why I don't watch the news at all). I believe a large number of the population has this mindset. --></p>\n<p>History shows that the massive improvements we enjoyed in the 1.8 million years of our existence as humans were <a href=\"https://interestingengineering.com/19-great-inventions-that-revolutionized-history\">all attributable to technology</a>. It simply translates to lower costs and higher productive output. Thinking big is a “mindset” that every nation should adapt. Innovation pushes for more favorable results compared to using outdated solutions to solve the same old problems as it will always have the same outcome.  </p>\n<blockquote>\n<p>So we got two options.. </p>\n<ul>\n<li>Adapt - As the world is rapidly evolving, I honestly believe that adapting an innovation mindset is a must. Take bold risks, investments and insights. There is a mars mission now and rockets return to earth automatically, virtually any problem can be solved. This is the hardest pursuit of any person or nation will ever do but this is the only way. History speaks for itself.</li>\n<li>Die - Yes, die slowly as a nation. Failing to accept the role of technology causes more problems because it adds up to the old problems. A nation that fails to adapt will lose it’s capacity to drive growth and serve itself.</li>\n</ul>\n</blockquote>\n<p>I applaud our president Rodrigo Duterte and his administration for their accomplishments. But the magnitude of problems handled by the government will not be solved with the current technologies being implemented. Moreover, it should be a collective effort of in coordination with the private businesses and the general public. </p>\n<p>Changing our curriculums to include computer coding and foreign languages as core subjects will allow job seekers to be more resilient in the current age of globalization. We should create vertical farms to alleviate the problems of food shortages and maaximize useable land. Smart cities should be implemented instead of people living in high risk areas of flooding and soil erosion, this could be a way to alleviate the traffic in Metro Manila. This options are now available and being adapted to other countries.</p>\n<p>My experience living and working in Dubai was so refreshing to reflect as I am writing this article. A desert turned to a smart city and a thriving economy where all nationalities come to enjoy tourism, business and work. </p>\n<p>So what will our country choose? adapt or die?.. only time will tell..</p>","excerpt":"Why does India have a space program and Filipinos does not even care about this question at all? My answer:  The public and private sectors…","fields":{"tagSlugs":["/tags/blog/"]},"frontmatter":{"title":"Philippines and technology","tags":["blog"],"date":"October 19, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/Philippines-and-Tech/"}}