{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<!-- <img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRmxqt3B6BKs4aZdj7Tx8siG8a5eT2_9ICNSHntS3FEg7_gkeh1\" alt=\"\" style=\"width: 700px\"> -->\n<p>Totally unrelated to tech but the idea that I will share here is invaluable to all and worth reflecting every now and then. </p>\n<p>It is very easy to pre-judge a bad situation by looking at it the moment it happened or is happening.. but after a year or ten years one may say that it was the most wonderful lessons that they could have ever learned and all the lessons learned were worth the pain at a time…</p>\n<p>The riskiest things I’ve done in last two years and the lessons I have learned..</p>\n<ul>\n<li>Climbed a mountain without breakfast or lunch, without any gear and after a 21-kilometer bicycle ride..This made me realize that humans are stupid and how valuable life is..</li>\n<li>Doing a business in a remote island in Palawan.. Ahhhh.. I thought this was the thing that I would do for the rest of my life.. living in one of the most beautiful islands in Palawan and the opportunity to help the locals were great reasons to stay. But after taking so much reflection..I am understating my potential to impact the world if I choose to stop growing or learning as an individual. Losing the security of a steady income from working as an accountant was a risk that no sane accountant will ever take (the job pays well). But with that reason I learned so much things that I can never probably have learned working 12 hours, 6 days a week in Dubai. </li>\n<li>Had the longest boat ride of my life, in the midst of a rising tropical storm.. It was a good thing that my boatman was drunk at the time… It was well worth it as all of our workers were very to happy to celebrate christmas with salary.. After almost dying the second time.. this made me reflect more on where I should devote my life..and money is not one of them…</li>\n<li>Learning how to code.. this was the most gut crunching thing I ever did.. most of my peers and friends all look at it as seemingly stupid. Assessing the circumstances, most of the time I was just hearing the voices I am creating…thinking that people all around me is kicking my brain…Anxiety.. But this decision made me antifragile..\nI saw that the most important thing that we should learn is to make use of our finite life to help improve the world in any way possible. Most may think that this is too altruistic but for me our very reason in life is to become the most productive version of ourselves and share it to the world. Coding is the most powerful skill on earth in my opinion. It has the power to create projects that can transform human lives..</li>\n</ul>\n<p>Stupid decisions create opportunities. This is true for my story. Making sense of the world is much easier for me now, I embrace uncertainty much better now..because of these stupid decisions.. Great experiences hides in the fear that we feel looking into the future.. We must seek uncertainty must well..</p>\n<p> I intend to read this blog every now and then to reflect how far I have gone through life..while doing seemingly stupid stuff and hiding the genius of the moment..this will also be a great read for my grandchildren in the future.</p>","excerpt":"Totally unrelated to tech but the idea that I will share here is invaluable to all and worth reflecting every now and then.  It is very easy…","fields":{"tagSlugs":["/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Hiding the genius of the moment","tags":["personal","blog"],"date":"October 25, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/hiding-the-genius-of-the-moment/"}}