{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>There were a lot of bad events that have happened in our human history, but one of the most devilish period of our human existence was the regime of the Nazis and Adolf Hitler also known as the “holocaust”. </p>\n<p><img src=\"survivors.jpg\" alt=\"holocaust\"></p>\n<p>Imagine you’re one of these people - being alive and dead at the same time, not knowing what is going on while enduring the horror of realities they were facing in the concentration camps. Waiting for their turns to die either out of hunger, chemical pesticide or the mere cold..Viktor Frankl accounted it in fine vivid detail in his book “Man’s search for meaning” wherein how he expanded the story of his life in the camps in Austria. It always bring me to chills whenever I reflect on the parts of the book that grips me in the throat. The glimpse of luck that he has at the time was so mind shattering as he kept on going despite the hell he was in..</p>\n<p><img src=\"hitler.jpg\" alt=\"hitler\"></p>\n<p>Hitler has a very compelling argument - make our species better by eliminating the weak. This argument has the case for prospering natural selection and propel any animal species to supreme power over most. He treated the weak as pests, using chemical Zyklon B to erradicate the old and powerless… imagine you have fever and was categorized as a weak man and got sent to one of the gas chambers, sensing the end and with others who either have accepted their fate or gone insane as the gas engulfs the room. As the gas comes in contact with your nose… to the throat and into the lungs go cyanide laden molecules that stops the processes where our body can utilize any form of cellular energy. Imagine dying like a rat or cockroach with other humans that turned into nuisance in the eyes of Hitler - you are to be erradicated from the face of this planet through his totalitarian structure of the world.</p>\n<p>Now why I’m so grateful of life? I’m so happy that I am not born in this period where humans can treated as animals worth eliminating. Totalitarian actions of the few causing so much deaths and pain in history that is chilling and appalling. I’m so happy to just be able to write and make digital art about the dark chapters of our history, especially this one.</p>\n<p>I love life because the sacrifice of millions of people just to get us here in the modern arena should be treasured. Our generation can laugh, play video games, code and love because of the bloodbath - oceans of human blood have created the things we enjoy now. I find it hard to talk to people who always complain. I always just tell to myself they were just poorly taught and lacks the knowledge of bloody history.</p>","excerpt":"There were a lot of bad events that have happened in our human history, but one of the most devilish period of our human existence was the…","fields":{"tagSlugs":["/tags/creating-art/","/tags/history/","/tags/blog/","/tags/projects/"]},"frontmatter":{"title":"Why I'm so grateful?","tags":["creating-art","history","blog","projects"],"date":"August 16, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/undefined/"}}