{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"death.jpg\" alt=\"death\"> </p>\n<p><strong><em>Pointing a gun on my head..</em></strong></p>\n<p>Stoic philosophy took me to ideas I never thought I would cross, topics that are controversial for 99% of the general population. I have thought of death almost everyday since I almost died in a boat ride in a storm in Palawan. I always think that anything I do will be my last. That is why I lost almost all of my fear. </p>\n<p>I do not fear what most people fear the most. I don’t fear losing all of my money - have done this and have found lessons more valuable than money, yet the general populous will die as they identify life as to acquiring physical things. You might be one of them, yet have you quetioned the idea of your intentions in gathering so much resources and losing it when you leave the face of the planet. </p>\n<p>As crazy as it sounds, the fear of dying trumps the truth of knowing. It is a crazy feat to navigate the world with close to not fearing anything, as fear is a construct that our brain have created to protect us. But having too much fear is limiting or more importantly too damaging. As most will never get to reach their true potential as a consequence. </p>\n<p>A great example of this is a lot of people fear the ketogenic diet because its core intake is fats, massive intake of fats. Most choose to stay comfortable than hearing even the science behind why carbohydrates and sugar is bad and even trying to villify a diet they haven’t tried understanding first. Our human nature is sometimes a detriment to the truths that are just in front of us. We choose not to run five miles everyday because it is hard. Yet tremendous amount of material supports that cardiovascular exercises improve blood circulation, cognitive capacity and overall lifespan. We, humans choose the easy way forward - the path that most people take even if this is not the right thing to do.</p>\n<p>I always wake up like there is a gun pointed at me. This keeps the routine going, the good ideas flowing. I meditate on the fragility of the opportunity to do humanly possible activities. The ability to read, write and learn is so brilliantly unique to our species. I savor every second of it. I drink every ounce of free water that I could, enjoy every conversation I take and tinker any idea I can grab with my waking time. Everytime I sleep I do not ponder to regret what I have not done, because the bar I have set for myself is high enough to absorb failure as still as a learning experience. Nothing gets wasted when you try to tackle the frailities of the human experience as an opportunity to prosper or fail without any hesitation or need of validation. </p>\n<p>I hope you will try pointing a deadly weapon metaphysically to yourself for even once in your life. You will be suprised where the simulation will lead you.</p>\n<p>PS. Have been vlogging again, my random topic today is <a href=\"https://www.youtube.com/watch?v=o-8W2Pabi7c\">“Habit formation, Biology and Brains”</a> </p>","excerpt":"  Pointing a gun on my head.. Stoic philosophy took me to ideas I never thought I would cross, topics that are controversial for 99% of the…","fields":{"tagSlugs":["/tags/philosophy/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Momento mori","tags":["philosophy","creating-art","blog"],"date":"November 18, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/keto-seven-months-in/"}}