{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<p>&#x3C;img src= alt=“pic” style=“width: 700px”></p>\n<p>Studying climate science in a broader sense made a impact in my perspectives the past three weeks and allowed me to reflect further into how things are going on to playout..the global economy, the world and our role as humans as the most dominant species in history.. Figuring out the right questions to ponder on as I felt that creating software projects or entrepreneurship leads me to the wrong directions. This blog post will cover my attempt to tackle a fundamental question that everybody should think about asking themselves..</p>\n<p>“Am I solving the right problem?” - a question running in the back of my mind that is filled with rich ideas and if diagnosed properly like any sickness may reveal weak spots needed to be addressed or habits to be improved or removed… when one is solving the wrong problem, you will going to waste energy, effort and money..</p>\n<p>Entrepreneurship is the act of risking your resources and credibility and add value to other people. This requires tremendous out of the box thinking to convert your assets and sustain continuity. I came to a point to understand that all entrepreneurial projects are in some way exhausting natural resources that took millions of years ago to build (eg. trees, forests, corals) or hide (eg. oil, minerals, precious metals) that is why this caused me to dial down my pursuit of freedom and profits as it will invariably affect the biosphere in some way (like what I did with my old project..) </p>\n<p>Software development is hard. It’s an exercise of breaking down problems to subsets of actions that a computer or device can understand and act upon in a predetermined manner. That’s why companies pay a lot for developers creating solutions to the world’s problems. I love the power to tinker code and communicate information through the web much better. I am also thinking offering my skills to companies solving the climate change problem for free. </p>\n<p>To be honest, I haven’t found an exact answer to the problem as still I’m figuring out what should I spend my remaining finite lifetime with considering all the talents and experience I was able to acquire..What I know is I will continue to study fundamental concepts like what I did with web development, classical mechanics for physics, ecology and climate science. Governing my perspectives now is I want to make the world better in accordance to mutual co-existence with the biosphere..which is very difficult to apply..</p>\n<p>So my question to you will be.. are you solving the right problem? or solving a problem that create bigger problems further in the future?</p>","excerpt":"<img src= alt=“pic” style=“width: 700px”> Studying climate science in a broader sense made a impact in my perspectives the past three weeks…","fields":{"tagSlugs":["/tags/personal/"]},"frontmatter":{"title":"Are you solving the right problem?","tags":["personal"],"date":"November 09, 2018"}}},"pageContext":{"slug":"/am-i-solving-the-right-problem/"}}