{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxg_tJ-doXOCuwxa0Wpvtb2bcZK3sjDJJrSiobuJfU8NvxlZse\" alt=\"habits\" style=\"width: 700px\">\n<p>I am not an expert on behavioral science but I would argue that this is worth studying. I believe it is crucial for everyone to study how our own lives revolve on layers of habits and as it connects with our own community or social group. These way the world becomes more predictable. </p>\n<p>Forming a habit is easy to mess up, infact we do it most of the time without thinking of it. The way we listen, learn and speak are good examples of simple habits we were able to acquire from our environment. </p>\n<p>The human brain easily gets stressed from  bad information like the stuff you can read from social media or conventional media news. This event triggers the release of tons of cortisol to the blood stream, immersing our body to the feeling of uneasiness. Then we get easily attracted to doing the easy stuff to negate this feeling. This becomes a positive feedback loop, releasing more cortisol and the cycle repeats. </p>\n<p>Bad habits are sometimes become”normal thing to do”. I lived in the islands before observed chaos and it was easy for them to receive money from politicians in exchange of votes. The environment we live in determine the preconditions of our mindset. It became their reality. Corruption became accepted as a way of life.</p>\n<p>More and more people become obese. I’m not a dietician or nutritionist, but studying history and ketogenic diet has convinced me that carbohydrates is one of the big reasons of it. It is very easy for us to acquire the need to eat from carbohydrates as we increase the glucose in our system as we digest it, releasing unnecessary energy in our system. The moment that energy surge subsides, you will most likely eat the soonest. </p>\n<p>Even though we feel that our decision is our own, it is not our own..it is rather heavily relying on our emotions… emotions that are driven by necessity.. needs that are intertwined with our environment.. It is a chain reaction of things out of our control. </p>\n<p>It is astonishing that our world nowadays is so attached to stories around money. Friendships get lost along the way because of money, people change because of money. It is in somewhat logical as money is fundamental to our everyday living. But is it? destroying your own identity just because of money? I find the problem much more deeper..</p>\n<p>I came across a topic of Dr.Jordan Peterson which deep dives on the topic of “relative poverty” as the source of all crimes. He explains that criminals tend to do wrong things not because they are poor but because they are “poor compared to another person” that “other person” maybe your friend, brother or neighbor. Comparing is a bad habit to acquire but I believe society became accustomed to this nowadays as most of our idols are now movie artists or sports figures. We follow this people on what they wear and what they buy. Sounds familiar? yes this is how media works, they help us develop a habit to buy stuff…yet sometimes streched to a point criminality is possible.</p>\n<p>Starting at an early age, my family problems caused me to think very independently. Coming up with my own decisions, failing and learning became a habit I never thought I was creating. This was a situation I never wanted but became a pre-condition to who I am now - a more grateful and observing person, still make tons of mistakes but learns from them. </p>","excerpt":"I am not an expert on behavioral science but I would argue that this is worth studying. I believe it is crucial for everyone to study how…","fields":{"tagSlugs":["/tags/personal/"]},"frontmatter":{"title":"habits shape our impact","tags":["personal"],"date":"Invalid date"}}},"pageContext":{"slug":"/habits/"}}