{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<p><img src=\"tools.jpg\" alt=\"tools\"></p>\n<p>Each line, shade or dot used in this illustration wouldn’t make sense individually to capture our awe. The combination of little things makes the whole to create awesome art. That is why small stuff matters - collectively.\nThis massive owl took me four hours to trace and copy. The original one was created by one of my favorites in the art world - <a href=\"https://kerbyrosanes.com/\">Kerby Rosanes</a>. </p>\n<p>Yeah, small stuff matters - our bodies composed of billions of billions of cells, our brains composed of billions of nerves, the the sun composed of billions and billions of hydrogen atoms, your computers built with processors that uses billions of nano-transistors and the list goes on. Our crazy life is built around atoms that interact and become big enough to become parts of our lives.</p>\n<p>One of the most compelling concepts that took me to digging this theme was human behaviour. Since we are the most dominant force in face of the planet, it’s very compelling to study how we operate and decide the fate our own and other species - as the <a href=\"https://www.google.com/search?q=6th+mass+extinction+facts&#x26;rlz=1C1CHBF_enPH738PH738&#x26;oq=6th+mass+extinction&#x26;aqs=chrome.2.69i57j0l5.11999j0j4&#x26;sourceid=chrome&#x26;ie=UTF-8\">6th mass extinction</a> currently taking place. </p>\n<p>How far did I get studying this subject matter to-date? </p>\n<ul>\n<li>Evolution - Charles Darwin - Two billion years ago life started with microbes, half-billion years after this became fishes, hundred million years after - rodents, ten million years after - apes, million years after us - humans.. </li>\n<li>History - 10,000 years of recorded history after the Agricultural Revolution, Industrial Revolution, Nazi germany, Gulag - Soviet union</li>\n<li>Intellectual minds - <a href=\"https://www.youtube.com/channel/UCL_f53ZEJxp8TtlOkHwMV9Q\">Jordan B. Peterson</a>, <a href=\"https://en.wikipedia.org/wiki/Robert_Sapolsky\">Robert Sapolsky</a>, <a href=\"https://www.amazon.com/Laws-Human-Nature-Robert-Greene-ebook/dp/B07C87SQ53\">Robert Greene</a>, <a href=\"http://podcasts.joerogan.net/\">Joe Rogan</a>, <a href=\"https://samharris.org/\">Sam Harris</a> </li>\n<li>Coding - Web apps, Blockchain</li>\n<li>Astronomy, Physics, Chemistry, Biology</li>\n</ul>\n<p>I believe the effort to deeply dive into these topics will take a lifetime..as new events are still shaping us - climate change, social media, <a href=\"https://thenextweb.com/contributors/2018/04/18/9-ethical-problems-vr-still-solve/\">virtual reality</a> and <a href=\"http://www.bbc.com/future/story/20170522-how-automation-will-affect-you-the-experts-view\">automation</a> - no one still knows how these massive events will creep on us and shape history.</p>","excerpt":"Each line, shade or dot used in this illustration wouldn’t make sense individually to capture our awe. The combination of little things…","fields":{"tagSlugs":["/tags/charles-darwin/","/tags/robert-sapolsky/","/tags/talking-history/","/tags/talking-tech/"]},"frontmatter":{"title":"Tools, Culture & Biology / Blog#0027 / Art#0004","tags":["Charles Darwin","Robert Sapolsky","talking-history","talking-tech"],"date":"March 03, 2019"}}},"pageContext":{"slug":"/tools-culuture-biology/"}}