{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQQMUXk1aVJL-NppGQGoyLGnnjUJQ6GSkZRAwBix1eOkn3Yg5Dc\" alt=\"curse_of_creativity\" style=\"width: 700px\">\n<p>My appreciation for culture, science, people, history and art is unprecedented. Dr. Jordan Peterson (a Canadian clinical psychologist and professor at the University of Toronto) coined this as the curse of creativity. He explains that it is one of the worst talents that you can have. It is very difficult to create an identity for yourself as your constant fascination constantly drag you to different directions. Another thing is creativity is very very difficult to monetize and make as a career..</p>\n<p>His explanation was a narrative that played out for the past two years. I sure did enjoy doing the following jobs:</p>\n<ul>\n<li>online consultant</li>\n<li>vlogger / blogger / social media marketer </li>\n<li>web developer</li>\n<li>blockchain developer</li>\n<li>marketing and business development head</li>\n<li>drone videographer</li>\n<li>video editor  </li>\n<li>construction supervisor</li>\n<li>accountant </li>\n<li>finance manager</li>\n<li>camp volunteer</li>\n<li>tour guide  </li>\n<li>historian</li>\n<li>researcher</li>\n<li>futurist</li>\n<li>stoic</li>\n<li>climate change advocate</li>\n<li>entrepreneur</li>\n</ul>\n<p>In the eyes of many, they couldn’t understand what I was doing and why I was sharing it so much of it in social media.. I do understand them for that and I shouldn’t have done that. When we step back and look at ourselves from a far.. that is when we realize our horrendous mistakes.</p>\n<p>For me, I was only doing what I think was really good to try.. I simply tried doing the fun stuff. There were a lot of good and bad in it. I just don’t want to regret that I did not pursue trying when I had the health, wealth and time to experiment. I faced the demons inside of me, those noises that stops us from acting.. I handled fear by talking to it constantly. </p>\n<p><em>I lost a ton of money. I gained a lot of experience. I ignored great advices, but learned thereafter..</em></p>\n<p>The process was excruciatingly risky but comfortable after I accepted the uncomfortable nature of creativity. I did helped creating a hostel and provide jobs to people and made an impact to the friends that I met along the way.. Good or bad, I know that I was able to share a different dynamic to viewing their world. These are the things that I’m most proud of.</p>\n<p>This curse is unique most especially in my cultural heritage as a Filipino, I am not proud of it, but it just is basically me.. Constricting it is catastrophic. Managing it and creating a more balanced approach is wiser. The process makes me a better person and contributor to society.. </p>","excerpt":"My appreciation for culture, science, people, history and art is unprecedented. Dr. Jordan Peterson (a Canadian clinical psychologist and…","fields":{"tagSlugs":["/tags/personal/","/tags/blog/","/tags/jordan-b-peterson/"]},"frontmatter":{"title":"the curse of creativity","tags":["personal","blog","Jordan B. Peterson"],"date":"November 29, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-curse-of-creativity/"}}