{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/7ef64de53ea0bc4cc6639fd09a36dbbb/13a83/death.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 139.78159126365054%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAcABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAQFA//EABQBAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhADEAAAAb6Wk0rGoIL1sBgA/8QAGxAAAgIDAQAAAAAAAAAAAAAAAAECAxESITH/2gAIAQEAAQUCI37PfBdPgvL0VNOwaylTBSP/xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/AR//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/AR//xAAdEAACAgEFAAAAAAAAAAAAAAAAARARAiEiQXGx/9oACAEBAAY/AivTcilqUupxXCm0o//EAB0QAQACAgMBAQAAAAAAAAAAAAEAESFBEDFxUWH/2gAIAQEAAT8hcFxkpTqk1IP4XKK9nutQH6W5EwF5ZUZNxjdFevBIM9kOP//aAAwDAQACAAMAAAAQkAA8/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAwEBPxAf/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAgEBPxAf/8QAIBABAAICAgEFAAAAAAAAAAAAAREhADEQUYFBYZGh4f/aAAgBAQABPxBCJgCVz0CZkQWluPynxfcQyTZTk081kaEIi4bvxeBAoAF7wCaKD1P7iTzsNWz964BAZNwMYXgpEJqe+P/Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"death\"\n        title=\"\"\n        src=\"/static/7ef64de53ea0bc4cc6639fd09a36dbbb/c739e/death.jpg\"\n        srcset=\"/static/7ef64de53ea0bc4cc6639fd09a36dbbb/8ee9c/death.jpg 148w,\n/static/7ef64de53ea0bc4cc6639fd09a36dbbb/ebbe7/death.jpg 295w,\n/static/7ef64de53ea0bc4cc6639fd09a36dbbb/c739e/death.jpg 590w,\n/static/7ef64de53ea0bc4cc6639fd09a36dbbb/5413e/death.jpg 885w,\n/static/7ef64de53ea0bc4cc6639fd09a36dbbb/4efde/death.jpg 1180w,\n/static/7ef64de53ea0bc4cc6639fd09a36dbbb/13a83/death.jpg 1282w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n     </p>\n<p><strong><em>Remember that you must die..</em></strong></p>\n<p>Stoic philosophy took me to roads I never thought I would cross, concepts so that never gravitate to 99% of people who live in the present. Death is something I revisit everyday after that boatride in the middle of the storm almost two years ago in Palawan. I often think that what I do as of the moment could always WELL be my last. That is why I lost almost all of my fear - uncomfortable conversations, people, losing someone, snakes - name it, I can find an argument to tackle almost anything. I don’t fear losing all of my money as I have done this a lot of times and have found lessons more valuable than coins and bills itself. The average person tend not to think like this as they identify life’s purpose is to acquiring physical things. You might be one of them, yet have you questioned the idea of your intentions in gathering so much resources and losing it in the moment you die?</p>\n<p>The fear of dying trumps having the ability to discern the truth. It is a crazy feat to navigate the world unfazed as fear is a construct that our brain creates to protect us. But having too much fear is limits us from thinking rationally or more importantly too damaging to our ability to assess risks that guide our future. As most will never get to reach their true potential as a consequence. </p>\n<p>A lot of people fear the ketogenic diet because its core idea is to consume massive amounts of fats. Most choose to stay comfortable than hearing even the science behind why carbohydrates and sugar is bad and even trying to destroy a diet they haven’t tried understanding first. Our human nature sometimes stops us from uncovering truths that are right in front of us. We choose not to run five miles everyday because it is hard. Yet tremendous amount of material supports that cardiovascular exercises improve blood circulation, cognitive capacity and overall lifespan. We, humans choose the easy way forward - the path that most people take even if this is not the right thing to do.</p>\n<p>I occasionally reflect on the idea of a gun pointed at my forehead, especially when making crucial decisions or simply feeling stagnant… This keeps the routine going and good ideas flowing. </p>\n<p>I meditate on the fragility of the opportunity to do humanly activities. To speak, read, write and learn are abilities brilliantly unique to our species. I drink every ounce of free water that I could, enjoy every conversation I take and tinker any idea I can grab with my finite time. I do not regret what I have not done, as I set myself to a standard that is high enough to absorb success and failure equally as a learning experience. Nothing gets wasted when you try to tackle the frailities of the human experience as an opportunity to prosper or fail without any hesitation or need of validation. </p>\n<p>Simulate the idea of you watching your own funeral and see where will the idea lead you.</p>\n</br>\n<p>PS. Have been vlogging again, my random topic today is <a href=\"https://www.youtube.com/watch?v=o-8W2Pabi7c\">“Habit formation, Biology and Brains”</a> </p>","excerpt":"  Remember that you must die.. Stoic philosophy took me to roads I never thought I would cross, concepts so that never gravitate to 99% of…","fields":{"tagSlugs":["/tags/philosophy/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Momento mori","tags":["philosophy","creating-art","blog"],"date":"November 18, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/momento-mori/"}}