{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<img src=\"\">\n<p>After posting my ideas about climate change, I refocused again think hard of my plans for the near future. That is how I made my way out of a depressed state and looked farther in the future again. I try not to predict too much as one decision of another intelligent life form like Donald Trump (or not that intelligent) can alter and create tremendous uncertainty for mankind.</p>\n<p>With the ever increasing complexity of the world, I would not rely on plans to guide my day-to-day living. But a general purpose just to create a structure of actions for the future will be better to have. It is also necessary to base your decisions from your own understanding of your own reality and not of others life or opinions (I do believe most of people do this, I’m like this before).</p>\n<p>I will have to go back learning new concepts again. Yes, that is my ultimate antidote to chaos. Remaining static or failing to upgrade your brain…will render life static and unfulfilling for me. Currently I’m learning physics and astronomy (these areas of sciences allowed me to better understand the effects of what we do to global warming and climate change).</p>\n<p>After I get a job overseas..I will be enrolling to Singularity University as their programs are so enlightening and may hold the key to the future by harnessing the potential of the crowd to power exponential growth. I consider the next two to three years my sandbox period to learning what the future holds. I might consider to apply for a migration to climate change. We’ll see..</p>\n<p>I will continue to advocate for climate change awareness as well as this is the biggest deterrent of our future as it will pushback our progress a thousand of years again. Scientists predicts that if we happen to figure out solutions to climate change, creation of evironmental friendly energy resources, rising complexity of technology and the role artificial intelligence.</p>","excerpt":"After posting my ideas about climate change, I refocused again think hard of my plans for the near future. That is how I made my way out of…","fields":{"tagSlugs":["/tags/history/"]},"frontmatter":{"title":"Plans..sort of.","tags":["history"],"date":"November 07, 2018"}}},"pageContext":{"slug":"/climate-change-the-longer-explanation/"}}