{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>I’m trying supplements..haven’t seen the effects yet..</em></strong> </p>\n<p>Six months into my ketogenic diet, I’m trying out a little bit of variation on how I adapt myself moving forward… One of them  is taking MCTs or medium chain triglicerides where I believe are unique combination of nutrients that are well absorbed by the body. Rare nutrients are essential to my ketogenic journey as I try to build a better cognitive base layer for the tons of information that I want to make sense in the coming months, including the projects that I’m looking to deep dive in especially those related to tackling the climate change.</p>\n<p>I was discussing with my colleague Sandra that I really feel that everyday that I do not have much time that is why I’m trying to do more from what I have now. Even though I’m part of the 1% of the world who has the 50% of the resources, I still view that there is so much important things to do, relationships to build and ideas to understand that the time we have is so limited… ’</p>\n<p>The race against time is one of my few anxieties existing, but rather than staying lazy…I figured that moving towards more productive ways of dealing with life’s suffering - eating well, exercising, thinking endlessly, working and sleeping should be accounted for rigorously. Keto is so powerful in my stand for creating more stronger pillars that will hold my structure for tackling the bigger challenges of life.</p>\n<p>Another great point that I was able to discuss with my boss in ITC Ms. Alpha a few weeks ago that it should be a moral responsibility of everyone to pass better genes to the succeeding generation. I am into this logic, all in. Lot’s of people now become so disengaged from their role in society. Most just suffer through life with either endless pleasure or endless cortisol jolts from social media or traditional news.</p>\n<p>Six months in, this has been a powerful sacrifice…paying off exponentially through my increase capacity to do more and absorb more. I hope people who will be able to read this may get to evaluate themselves and their loveones with regards to health concerns. Biology have saved me numerous times and the ability understand and connect diet with genetics will be instrumental in connecting now into future and beyond…</p>","excerpt":"I’m trying supplements..haven’t seen the effects yet..   Six months into my ketogenic diet, I’m trying out a little bit of variation on how…","fields":{"tagSlugs":["/tags/creating-art/","/tags/keto/","/tags/blog/"]},"frontmatter":{"title":"MCTs - keto six months in..","tags":["creating-art","keto","blog"],"date":"October 08, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/mct/"}}