{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<br/>\t\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/ea7ea7ab3a7977d3728e1877ad3764f7/e8ac2/adolfhitler.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 51.521984216459984%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAKABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAUCA//EABQBAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhADEAAAAbmOswpg/8QAGRAAAQUAAAAAAAAAAAAAAAAAEAABAxEi/9oACAEBAAEFAnV6E4//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/AT//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/AT//xAAXEAADAQAAAAAAAAAAAAAAAAABECBx/9oACAEBAAY/AoGr/8QAGxAAAgEFAAAAAAAAAAAAAAAAAREQADFBcbH/2gAIAQEAAT8hNI4dB2ZU3aex/9oADAMBAAIAAwAAABAX3//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8QP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8QP//EAB0QAQABBAMBAAAAAAAAAAAAAAERACFBYRAxgZH/2gAIAQEAAT8QYQMJMUXZpAYfPvN+tzV1Za//2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"adolfhitler\"\n        title=\"\"\n        src=\"/static/ea7ea7ab3a7977d3728e1877ad3764f7/c739e/adolfhitler.jpg\"\n        srcset=\"/static/ea7ea7ab3a7977d3728e1877ad3764f7/8ee9c/adolfhitler.jpg 148w,\n/static/ea7ea7ab3a7977d3728e1877ad3764f7/ebbe7/adolfhitler.jpg 295w,\n/static/ea7ea7ab3a7977d3728e1877ad3764f7/c739e/adolfhitler.jpg 590w,\n/static/ea7ea7ab3a7977d3728e1877ad3764f7/5413e/adolfhitler.jpg 885w,\n/static/ea7ea7ab3a7977d3728e1877ad3764f7/e8ac2/adolfhitler.jpg 887w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>My fascination for human behavior is endless. I have been studying this topic for two months already and still I want more of it. It brought me to interesting paths of empathy towards people that caused me great harm and allowed me to reflect a lot with how I handled my decisions in the past. But another thing that strikes me the most is that our human capacity to coordinate with each other and create chaos against groups of people to whom we are not affiliated with… our capacity to start and implement wars..</p>\n<p>Wars are one of the worst tools ever wielded by humanity. We are not the only animals who can band into groups and destroy other species but our degree of sophistication in implementing violence and destruction is unfathomable. We can create guns that allows us to eliminate targets with precision. We also created economies for private armies, armaments, ammunition and the list goes on. Cyber attacks and social media campaigns being carried out by nations to distabilize others.\nAnother thing to mention are nuclear bombs / nukes hidden in the ocean through submarines. We are really too technologically powerful nowadays to the point that I wouldn’t be suprised to see robots weilding lasers in the future carrying out. </p>\n<p>But deeply reflecting on the significance of wars in history have taught me a few good things that I believe everyone should know..</p>\n<ul>\n<li>It teaches gratitude. Living  peacefully at present beacause people fought for it in the past is truly empowering. The energy that I get whenever I rememember that our history is covered in blood keeps me going, trying to do more in every situation. </li>\n<li>It brings out the heroism of the few. This is what also frames history. Those few ones who used their skills, intellect and will to survive and fought the evils of our kind. Winston Churchill stood up against Adolf Hitler in the 1940s during the World War 2. I wonder where would humanity be today if he didn’t had the courage to stop the horror of the Nazis? I clearly see more deaths..</li>\n<li>It drives technological improvements. It’s hard to imagine a world without the internet, computers, weather systems, gps, digital cameras, ambulances etc. We enjoy the benefits of these things because of the drive for innovation in support of wars. </li>\n</ul>\n<p>No one can escape the strands of impact wars have created. It intertwines us all, more and more as we thrive now in a global economic stage. What I discovered after studying our behavior and history is that wars are a big part of our ancestors daily lives. With climate change knocking at our doorsteps and neverending conflicts in Sub-saharan Africa &#x26; Middle East, I honestly fear that the kind of garbage information being injected by social media to the public will spiral and trigger the death of billions of people if the worst effects of climate changes hits us all.</p>","excerpt":"My fascination for human behavior is endless. I have been studying this topic for two months already and still I want more of it. It brought…","fields":{"tagSlugs":["/tags/history/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"A few lessons from Wars","tags":["history","creating-art","blog"],"date":"March 20, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/a-few-lessons-from-wars/"}}