{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><b>Warning: This blog post will scare you, If you have stress, anxiety or depressive states in the last 2 days, READ WITH CAUTION. </p>\n<p>Again. You have been warned…</b></p>\n<p><img src=\"skullpng.png\" alt=\"skullpng\"></p>\n<p>Imagine yourself becoming fossilized due to extreme heat. Your sunglasses won’t be able to help you. That is how the earth will feel like in three decades…or sooner. Time is not on our side.</p>\n<p>In the past months where I devoted a lot of time studying climate science, I tried to convince people important to me.. to be mindful of the crazy things that are happening because of our excessive use of fossil fuels. Unfortunately, they reversed the situation and just laughed at what I’m saying or believing. </p>\n<p>People everywhere are in denial. Even you will not believe what is written here. I do accept the truth that a lot of people will die.. even people that truly matter to me the most. It is really difficult for people to understand an abstract problem that we haven’t encountered in our lifetime.</p>\n<p>In a matter of decades, there will be changes in our climate and will alter history forever - billions of people might die. Imagining the future is very difficult for David as he tells the story in his book the Uninhabitable Earth on <a href=\"http://podcasts.joerogan.net/\">JRE podcast with Joe Roegan</a>. He tells a bleak picture of the future.</p>\n<p>We will overshoot the <a href=\"https://www.ipcc.ch/sr15/\">IPCC target</a> formulated by UN, on track to 4 degrees celcius warming by the end of the century. Six climate catastrophes (heat waves, super typhoons, famines, disease outbreaks, civil wars) can happen in multiple countries all at once. Losing all ice in the polar ice caps will increase the sea level by 260 feet causing significant damages to all island nations (including my country the Philippines) and coastal cities. We literally built all of our civilization’s significant infrastructures near ocean waters thinking that the climate will remain stable. </p>\n<p>Losing the arctic permafrost is another part of the discussion that really paints a new page in my understanding of bad things can happen in the not so distant future. A reindeer killed by anthrax and frozen for a century in Russia caused the death of a kid and several reindeers last year after the same bacteria got released to the wild (again) due to melting ice.</p>\n<p>Besides the ancient methane reserves hidden in the permafrost, there are diseases that if the melting continues, imagine bubonic plagues or spanish flu - it will be catastrophic as our body is not adapted to them.</p>\n<p>The link to the whole interview is <a href=\"https://www.youtube.com/watch?v=RoWXvMQ3xqg\">here</a>. It’s better that you hear the stories directly from David and Joe. His book is sold in Amazon, here is the <a href=\"https://www.amazon.com/Uninhabitable-Earth-Life-After-Warming/dp/0525576703\">link</a>.</p>","excerpt":"Warning: This blog post will scare you, If you have stress, anxiety or depressive states in the last 2 days, READ WITH CAUTION.  Again. You…","fields":{"tagSlugs":["/tags/creating-art/","/tags/climate-change/","/tags/jre/","/tags/blog/"]},"frontmatter":{"title":"Uninhabitable Earth","tags":["creating-art","climate change","JRE","blog"],"date":"March 13, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/uninhabitable-earth-david-wallace-wells/"}}