{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>I really cannot believe that a better fuel for the brain means a superior memory recall - way better even when I was younger..</em></strong></p>\n<p>To be honest, I really just wanted a superior health and unlimited energy from the ketogenic lifestyle and have dispensed out a lot of the “improvement in cognitive ability” that most prominent ketogenic sources so mentioned. I never thought that this might be the most important part of the diet - getting back to our primal nature creates a tremendous edge in cognitive ability.</p>\n<p>How cutting edge it is? Is it like a super power?</p>\n<p>Well, I should say there were unique scenarios that I was able to use my memory that a conventional person will not be able to do. This real situations gave me a chance to test my increase in effeciency in memory recall:</p>\n<ul>\n<li>My boss was looking to purchase some vehicles from Japan, then he just randomly asked when did the tsunami happened there as it is very relevant to the year model of the trucks. I just spurt the information out loud - “2011 sir!” and he even said are you sure? and as we googled it out - it is 2011. As I could recall, I did view the videos how some of the locals are able to capture that event and I had a second of brain processing then had the answer on hand. That was weird and remarkable for me.</li>\n<li>In my job as a receivables clerk, there are customers that we are really monitoring. One time a customer tried to buy in our other warehouse and I just out of the blew happen to remember that he has unpaid dues. Right then and there we were able to collect some of the money. My boss was relieved to collect some of it. I was arrogantly in check of how I significantly evaded a blindside from the customer, a bit arrogant at the time that he was not able to escape my memory.</li>\n<li>I happen to release a purchase order was two days earlier that include some boxes of caulking (used for installing some counter-tops) and then some workers came\nto ask the same quantity and item. I immediately and politely asked is it for the other warehouse with me almost sure that it really is. And to my boss suprise that I remembered that despite the hundreds of transactions I processed days earlier. I just told him that the diet really works.</li>\n</ul>\n<p>There are a lot more of instances that I have improved my ability to recall information. And also, the firing of neurons while exercising is hugely as important to my superior ability to collect data like a sponge and be able to utilize it in a manner that is useful. I have been doing some re-reading especially of the old books that is dusting out in my kindle. Also, I am retaking my old course which is way easier now as it is rather easier for me to see how javascript captures unique patterns. </p>\n<p>I am really trying to dig this new found upgrade in my brain processing. Also  I am taking huge steps to preserving my body, mind and spirit as I do not want the potential to go to waste because of an unfortunate event. I am very optimistic with things are going in my life and has a great outlook especially as 2020 is approaching. I wonder still if this could land me a job with any of Elon Musk’s companies. Well, I might have to improve my computer coding skills to get me going on that path. Only time will tell… </p>","excerpt":"I really cannot believe that a better fuel for the brain means a superior memory recall - way better even when I was younger.. To be honest…","fields":{"tagSlugs":["/tags/keto/","/tags/neuroscience/","/tags/blog/"]},"frontmatter":{"title":"Enhanced memory (keto, 10 months in..)","tags":["keto","neuroscience","blog"],"date":"December 23, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/enhanced-memory copy/"}}