{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRw9KkDZPkPHMq65GtSnPPnu1jIBSkVVo8xx6o9z78xAx1Z4wH5\" alt=\"christianity\" style=\"width: 700px\">\n<p>We don’t choose our parents and most people would not reflect on that because there is no incentive in it - there is just no benefit on asking the question why we are incapable of changing or influencing our origins. But is it really the right framing of ideas? Should we just move ahead and navigate life without a firm grounding of the past?</p>\n<p>Born to a poor family in San Ildefonso (a town 2 hours from Manila), I grew up serving the local catholic church as an altar boy and even got medals for it while studying. All of my friends did the same. My whole family practice christianity too. Serving the evening saturday mass felt like I was one of the cool kids helping spread the word of God.</p>\n<p>During my CPA board examinations (for praticing public and private accounting) I reconnected with my inner desire to connect with the creator. Most of our instructors explain the role of “God handling the things that we can’t control” during the seven months of review and tests. Things like:</p>\n<ul>\n<li>Worst room airconditioning. It takes 3 excruciating hours for each exam at the time. Room selection is random and based on your last name and selected schools by the Board of Accountancy. </li>\n<li>Eating spoiled food causing bad stomach. Some fix this problem by bringing packed lunch.</li>\n<li>Forgetting to bring important stuff like your exam passes or IDs. With the millions of topics covered in the exams, it is easy to neglect things.</li>\n</ul>\n<p>Arriving late stops you from entering the examination rooms. Stress. Traffic. A lot of reasons. You get the picture.</p>\n<p>Early in my 20s, I was working as a cost accountant (eventually got promoted to lead the warehousing department) in a real estate company ran by a christian family. As an officer in the company, I hold myself obliged to support bible studies, friday morning gatherings, and some weekend mass/events. </p>\n<p>In a country where Islam and Christianity have existed for the most of history, you don’t have a choice but acknowledge the role of a creator the moment you are born.\nAnywhere you go, until you cease to exist..there you will bump into religious influence as I am describing in my personal stories. </p>\n<p>I wondered much on my inability to create software projects after learning computer coding and climate science back in October. Seeking to be more productive in improving my “original thinking” I found myself focusing on scientific beliefs like astronomy and philosophy. This then snow-balled to a series of crash course on biology, economics, media literacy, history and more. </p>\n<p>Religious belief has been the topic of debate from the era of greek philosophy and until at present times. Why can’t one acknowledge too many Gods? Why does the holy books did not mention the germ theory that could have saved a billion people? Why does the these books never mention nuclear technology? </p>\n<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmaZi--G15cCBMvoaf8iZk36JYSr5s7cYqpVZvLsharlE7u1e7TA\" alt=\"cell\" style=\"width: 700px\">\n<p>Though the story of Adam and Eve is a good one, our existence as humans was realized through the method of natural selection just like every living thing that ever walked upon this planet. This process is well documented from the time of Charles Darwin and strenghtened by various naturalists until the present times. But it is just so sad that we’re losing more and more species of wildlife everyday because of loss of habitat due, to our own undertaking intentional (like illegal logging) or unintentional (use of fossil fuels).</p>\n<p>There are a number of problems that the bible have solved over the 20th century like the erradication of slavery in civilized society but science (and its processes) have a better grasp on what is happening all around us like climate science, sustainability, artificial intelligence and genetics - of which are I would argue that the most important topics of our generation. Staying ill-informed is not exercising our human ability to navigate the world around us and address the lurking problems that lies ahead of us the the dominant inhabitant of the planet.</p>\n<p>If I were to have a hand as to where I should start this life of sacrifice and struggle, I wouldn’t choose a developing country hampered by polarizaing ideologies like religion and corruption that either don’t have any truthful basis or lacks productive outlook in progressing our species. Instead, I’m constantly focused on deploying gratitude and as Gary Vaynerchuck’s says that <em>“the odds of becoming a human is 400 trillion to one</em> which defines that it is a miracle just to be alive - at all and the chance to make a difference to the lives of others is all that matters. </p>\n<p>But this is just a personal account of my journey and my belief on what life is. The kind of a personal realization I gained from this process will be different to you or anybody else we know. I really contemplate a lot that our capacity as humans to create a very unique experience makes us a god in a way, just like the people who wrote the early stages of the bible. </p>","excerpt":"We don’t choose our parents and most people would not reflect on that because there is no incentive in it - there is just no benefit on…","fields":{"tagSlugs":["/tags/personal/","/tags/charles-darwin/","/tags/blog/"]},"frontmatter":{"title":"Becoming Agnostic","tags":["personal","Charles Darwin","blog"],"date":"February 06, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/becoming-agnostic/"}}