{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxg_tJ-doXOCuwxa0Wpvtb2bcZK3sjDJJrSiobuJfU8NvxlZse\" alt=\"habits\" style=\"width: 700px\">\n<p>Forming a habit is one of the easiest thing to mess up in our lives. Our bias is part of human nature and cannot be easily scrapped out of our decision making, most especially when we are wired not to evaluate ourselves which is impactful in the way we do things on a regular basis.</p>\n<p>Self-awareness is not on the radar of everyone, corrupt government and media tells you what to do in life. The human brain gets easily gets stressed of bad news, releasing tons of cortisol to the blood stream, immersing our body to the feeling of uneasiness. Then we get easily attracted to doing the easy stuff. Reading / liking social media posts, watching netflix or more depressing news and gossiping are few of the examples of impulsive actions most take. This becomes a positive feedback loop, releasing more cortisol and the cycle repeats.</p>\n<p>Bad habits are intertwined as “normal things to do”. I lived in the islands before and it was easy for them to receive money from politicians in exchange of votes. More and more people become obese. Free will is not true. The environment we live in determine the preconditions of our mindset. This includes social media, television, and even your friends have a direct influence in what you do. It became the norm for them. It became their reality. Corruption became accepted as a way of life.</p>\n<p>Even though we feel that our decision is our own, it is not our own..it is rather heavily relying on our emotions… emotions that are driven by necessity.. needs that are intertwined with our environment.. It is a chain reaction of things out of our control. </p>\n<p>I guess I was lucky in a way. My family problems caused me to think very independently at an early age. Coming up with my own decisions became a habit I never thought I was creating. This was a situation I never wanted. As a consequence, I created more unique experiences than the average person, gone to relationships (both private and professional) that gaved me different highs and lows. </p>\n<p>It is astonishing that our world nowadays is so attached to stories around money. Friendships get lost along the way because of money, people change because of money. It is in somewhat logical as money is fundamental to our everyday living. But is it? destroying your own identity just because of money? I find the problem much more deeper..</p>\n<p>I came across a topic of Dr.Jordan Peterson which deep dives on the topic of “relative poverty” as the source of all crimes. He explains that criminals tend to do wrong things not because they are poor but because they are “poor compared to another person” that “other person” maybe your friend, brother or neighbor. Comparing is a bad habit to acquire but I believe society became accustomed to this nowadays as most of our idols are now movie artists or sports figures. We follow this people on what they wear and what they buy. Sounds familiar? yes this is how media works.</p>\n<p>This topic just popped up in the air with my a discussion from my former business partners.</p>","excerpt":"Forming a habit is one of the easiest thing to mess up in our lives. Our bias is part of human nature and cannot be easily scrapped out of…","fields":{"tagSlugs":["/tags/personal/"]},"frontmatter":{"title":"habits","tags":["personal"],"date":"Invalid date"}}},"pageContext":{"slug":"/habits/"}}