{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>I literally do not have time to write today but still force myself to do so as I like the habit of articulating my thoughts through this blog. </p>\n<p>And my topic (sort of) is garbage! what a weird thing to discuss in this blog of which is normally rigged to philosphy and technology… but I believe it is important to think of garbage in a way as how it is so pervasive in our lives - physically and mentally.</p>\n<p>Physical garbage is so problematic as we do not know what to do with it at scale. Most of the time our garbage end up to large bodies of water, contaminating ecosystems and altering much of life beneath. I talked about it extensively in my blog about our impending <a href=\"https://tech-stoic.github.io/consumption-overdrive/\">over-consumption</a>. I bet our ability to manufacture as humans will come to a halt when the ill effects of climate change would rally against us. It is a large scale experiment that we have yet to see the outcome…</p>\n<p>Another experiment that we need understand is the amount of garbage information that a few select number of groups of people or organizations feed our brain through the internet - which is somewhat garbage information. Amazon, Google, Facebook, Instagram, CNN, Fox etc. - these big companies are pumping stress hormones to our body 24/7 - non-stop. Another psychological experiment that is unfolding itself as the amount of depression to young ones (especially those that were born with all this gadgets and the interweb at the on set), thus increasing the number of suicide incidents. </p>\n<p>I once had a discussion with a really beautiful swedish girl and after some drinks I get to learn that despite the beauty and blessings she has (being born in one of the best countries to live) still is contemplating of taking her life. I’m in utter shock to what I am encountering that the myriad of garbage the world have now can manipulate a beautiful soul to disregard how wonderful her opportunities are. </p>\n<p>I’m more scared of the latter as too much information hinders anyone to think clearly. I see this alot and believe that this is now how our society works - smartphones eating up the pie of our daily schedules. Such an experiment that we are yet to see the outcome. This has been the case for most of history… struggles through tyranny, utter end of the world because of nuclear war or even tribalistic war when we were still apes - earth have always witnessed the way we navigate these exeperiments as part of natural selection. True to fact, we are always unfortunate enough to see the outcome as our 99 years at most is not enough to catch the book that will tell the stories of how will unfold.</p>","excerpt":"I literally do not have time to write today but still force myself to do so as I like the habit of articulating my thoughts through this…","fields":{"tagSlugs":["/tags/creating-art/","/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Two kinds of Garbage","tags":["creating-art","personal","blog"],"date":"August 13, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/garbage/"}}