{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/53b42969835fb73187827a9c4c1f0379/8af60/stevejobs.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 99.46619217081852%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGQABAAMBAQAAAAAAAAAAAAAAAAIDBQEE/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEAMQAAAB183QpPeiOQC0H//EABkQAQADAQEAAAAAAAAAAAAAAAIAAQMRE//aAAgBAQABBQLbY4kbZ5yr7W9Zo+R4BQCJuA1Z5P/EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8BH//EABsQAAICAwEAAAAAAAAAAAAAAAECABEQITFB/9oACAEBAAY/AraKxZiW7LEp6J8lOoqBV5Nib3j/xAAbEAEAAgMBAQAAAAAAAAAAAAABADERIUFRcf/aAAgBAQABPyGwy0HYyaKnyASZGmYwFHFlQeqlWCoK4X7NAW7uMf/aAAwDAQACAAMAAAAQwwcA/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAwEBPxAf/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAgEBPxAf/8QAHBABAQADAAMBAAAAAAAAAAAAAREAITFBUWHR/9oACAEBAAE/ECFETuWaiCQaptPjhUjUHSZQEBcbPGAl16gJ7pzCTQ+m9b3N5WeFy3Ol+W8AdU+DM//Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"stevejobs\"\n        title=\"\"\n        src=\"/static/53b42969835fb73187827a9c4c1f0379/c739e/stevejobs.jpg\"\n        srcset=\"/static/53b42969835fb73187827a9c4c1f0379/8ee9c/stevejobs.jpg 148w,\n/static/53b42969835fb73187827a9c4c1f0379/ebbe7/stevejobs.jpg 295w,\n/static/53b42969835fb73187827a9c4c1f0379/c739e/stevejobs.jpg 590w,\n/static/53b42969835fb73187827a9c4c1f0379/5413e/stevejobs.jpg 885w,\n/static/53b42969835fb73187827a9c4c1f0379/8af60/stevejobs.jpg 1124w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n     </p>\n<p><strong><em>Multidisciplinary, extreme design thinking and focus - Steve Jobs’s views are arguably about how we will use technology shaped the future and paved ways for people like me to create and express more..</em></strong></p>\n<p>A  big part of my life is my fascination with Steve Jobs ideas. Most of my professional practice as an accountant is some how predicated on ideas or concepts that revolved on curiousity which very much against the typical office working type mindset which you should just do what you are told, less time to accomplish it as much as possible. </p>\n<p>Steve imagined that tech should be interpreted to the normal person, much easier than remembering software concepts. The hardpart of software development I guess is it was created by people where they hardly haven’t made things in very structured ways, unlike other disciplines of development like engineering and architecture where there were a lot of history and experiments including legislation that progressed ever since the western world began. Sofware development is against this as most of it’s development is built through rapid experimentation, fueled by overflowing capital and legislation unable to learn fast enough to cover for the downside of tech. </p>\n<p>The story where Bill Gates stole the “GUI” or graphical user interfaces where Steve have developed for the soon to release Mac is the incident that built the abstract foundation of better tools for us and modern day software developers use. Steve imagined the future like no other at the time. That is why this saying where I’ve heard from a talk of Dr. Jordan B. Peterson about creativity that (I’m going to paraphrase based on what I can remember) “There is such a unique thing about what art can do as the artist enables the audience to see the world differently which is comparable to what scientists does..“. Steve perceived information much differently than the average person, able to connect dots that are rare, so rare that he poked a hole towards new tools that creators, developers and artists can use.</p>\n<p>I just hoped he have lived a bit longer, It is so much of a waste to lose a rare intuitive thinker like Steve Jobs is. He is one of the few people that makes me think a lot of what I’m doing - especially what I feed my stomach and what I consume as content - technically what I feed my brain. Everytime I try to think about buying a car, I tend to pause and reflect that I could’nt let go of Red (my bicycle..) as the car would now stop me from exercising which in effect would make me lazier…that can snowball to accomplishments to my side projects. </p>\n<p>Steve Jobs, another person that I’m very grateful for. I am really happy of the technologies that he help enabled us to enjoy and use.</p>\n<p>PS. Finally, I bought an actual Apple product just this August. I’m a full pledged apple fan now ^_^</p>","excerpt":"  Multidisciplinary, extreme design thinking and focus - Steve Jobs’s views are arguably about how we will use technology shaped the future…","fields":{"tagSlugs":["/tags/creating-art/","/tags/tech/","/tags/history/","/tags/blog/"]},"frontmatter":{"title":"Think Different","tags":["creating-art","tech","history","blog"],"date":"November 11, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/think-different/"}}