{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"\n  <a class=\"gatsby-resp-image-link\" href=\"/static/5fcf3efad0aad4b694ae5384cf4a1098/9e7e7/SmartSelect_20190806-035207_Sketch.jpg\" style=\"display: block\" target=\"_blank\" rel=\"noopener\">\n  \n  <span class=\"gatsby-resp-image-wrapper\" style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\">\n    <span class=\"gatsby-resp-image-background-image\" style=\"padding-bottom: 70.79292641186537%; position: relative; bottom: 0; left: 0; background-image: url(&apos;data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAOABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAMEAgX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHtztSVGg//xAAZEAADAQEBAAAAAAAAAAAAAAAAAQIREjH/2gAIAQEAAQUCbI0XlLTjaR//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/AT//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/AT//xAAZEAABBQAAAAAAAAAAAAAAAAAQAAEyQWH/2gAIAQEABj8CUqOOP//EABoQAAIDAQEAAAAAAAAAAAAAAAEhABFBMVH/2gAIAQEAAT8hf0AbGsjbWdhktCIaZlmvLzkChU//2gAMAwEAAgADAAAAEEPP/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPxA//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAGxABAAMBAAMAAAAAAAAAAAAAAQARITFBYXH/2gAIAQEAAT8QAYkYlqoiU3BgW8eqhhtcKRpVjwNX7UOFAgncITO2RTTdT//Z&apos;); background-size: cover; display: block;\">\n      <img class=\"gatsby-resp-image-image\" style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\" alt=\"johnwick\" title src=\"/static/5fcf3efad0aad4b694ae5384cf4a1098/c739e/SmartSelect_20190806-035207_Sketch.jpg\" srcset=\"/static/5fcf3efad0aad4b694ae5384cf4a1098/8ee9c/SmartSelect_20190806-035207_Sketch.jpg 148w,\n/static/5fcf3efad0aad4b694ae5384cf4a1098/ebbe7/SmartSelect_20190806-035207_Sketch.jpg 295w,\n/static/5fcf3efad0aad4b694ae5384cf4a1098/c739e/SmartSelect_20190806-035207_Sketch.jpg 590w,\n/static/5fcf3efad0aad4b694ae5384cf4a1098/5413e/SmartSelect_20190806-035207_Sketch.jpg 885w,\n/static/5fcf3efad0aad4b694ae5384cf4a1098/4efde/SmartSelect_20190806-035207_Sketch.jpg 1180w,\n/static/5fcf3efad0aad4b694ae5384cf4a1098/9e7e7/SmartSelect_20190806-035207_Sketch.jpg 1753w\" sizes=\"(max-width: 590px) 100vw, 590px\">\n    </span>\n  </span>\n  \n  </a>\n    \n<br>\n<p>The world needs more truthful sources. Stories from people who have dealt with crap and tell the details of it - no matter what.</p>\n<p>Like John Wick, no one should be afraid of telling the truth…or rather his truth. Why is that so? it is the way to know one’s own self (particularly easy to fool yourself in most cases)… and is part of a better process of determining if your ideas are strong enough to hold structure in real world scenarios. </p>\n<p>The reality of it are based on my research on psychology and neuroscience plus personal experiences which shows that the courage to speak the truth is a rare trait. So most of our society is rather choosing either a safer, counter-productive or evil way of navigating very complex problems. I see it a lot more especially in tight situations - choosing themselves instead of implementing what is for the betterment of all - like what happend in the communist regimes in Nazi Germany and Soviet Gulag that killed approximately 100 million people. </p>\n<p>Life is hard, but lying makes it harder for people. Choosing not to exercise is a route to future sickness, easy for now but you pay later. The same with consuming sugar or alcohol. Concealing information will invariably code your brain to do the same thing again and again as it reinforces a bad habit - I have seen this time and time again to be fascinating and sad at the same time, as I for one made this mistake a lot in the past. </p>\n<p>I was thinking of a teenage dream kind of ambitious trip to Europe and have concluded that it was too impractical; I have altered my own little fantasy through the harsh reality that I am holding a third world country passport which hinders me from stepping going to the right places to execute the plan, the truth tells that it is too ambitious as of the moment. </p>\n<p>I’m also thinking of writing a book the past month but after being offered to code remotely by a German company, I have been questioning that route for the past week. I am blessed with a gift to intertwine different skillsets plus an ability to understand more complex problems than the average person…and the ability to code has been bugging me …to a sense that instead of writing a book, why not devote myself to develop technologies that I know that can help other people? I did try that with Ethereum / Solidity / Blockchain but the thing is this stack of tech I believe needs more time - specifically decades more to be of impact to society…because of the impractical and massive need of electricity that the code needs to maintain the system and ill  positioned as we are to combat the dire effects of climate change in the coming decade. I have seen some interesting technologies that I could substitute the book project. Neuralink is one company that I might aim to secure a slot in the future, as I  agree with Elon Musk on his personal drive to improve our cognitive cababilities to help or merge with AI in the future. IBM just open-sourced their code for cancer research of which I would like to look at - as I love freaking biology and how it makes me understand about our species. Space is another thing but I need superior understanding physics especially Einstein’s theory of relativity. </p>\n<p>Knowing a truthful assessment of myself critically gives me the right options or arguments. It will really be a battle of arguments inside of me in the next coming weeks or so, hoping to extract the proper route… I’m really grateful of the opportunities crashing into me lately; strong cognitive thinking, unlimited energy through keto and cycling -thus allowing me to better tackle bigger, more ambitious sets of problems.</p>\n<p>Lastly, given the opportunity, health and clarity to do what compels me, I will do it…no matter the cost or walls needed to be smashed…Coming out of retirement to be a force of good like my favourite movie character John Wick.</p>","excerpt":"The world needs more truthful sources. Stories from people who have dealt with crap and tell the details of it - no matter what. Like John…","fields":{"tagSlugs":["/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"I'm not hiding my ideas..","tags":["creating-art","blog"],"date":"August 06, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/john-wick/"}}