{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<br/>\n<p><strong><em>“8/16”</em></strong> </p>\n<p>I’m thinking of a monthly and weekly focused blog especially about topics I’m really digging and experimenting with and one of them that pops into my head at most (well I decide on it everyday) is my ketogenic lifestyle. So I started to talk about it in this <a href=\"https://tech-stoic.github.io/keto/\">blog</a>, but now I will try to maintain a workable track of my experiences from this lifechanging decision, so this is to follow through the first one…</p>\n<p>I have been doing intermittent fasting for the past 13 days (I track all my activities with <a href=\"https://daylio.webflow.io\">Daylio</a>) and it has been a somewhat a seamless transition from a 3-day meal to a 2-meal with 8 hours (starting from 12nn to 8pm) then 16hours fast. Seamless transition? because the ability that I have made myself compatible with the use of fats (or ketones) as a more robust power source makes it much compatible with the way fasting works. I’m still yet to discover the significant benefits of it over time as thirteen days is so miniscule to a year or ten years of doing a significant health decision but yeah, the support behind the practice is so compelling for me to not do it. </p>\n<p>Also, I crossed paths with <a href=\"https://youtu.be/-gAyPKxX2H4\">Violin MD’s video</a> about the ketogenic lifestyle and it made me review my choices on which types of food combination. Her video basically explains that high carb and low-carb diets are living less years than the more balanced - medium carb based diet. Also, red meat was discouraged by the study done and was published in the lancet. Worth watching if you are into either Paleo, keto or low-carb.</p>\n<p>Maybe my next blow will be about aging…stay tuned…as I’m currently fascinated of Andrew Sinclair’s work. More on this next time..</p>","excerpt":"“8/16”   I’m thinking of a monthly and weekly focused blog especially about topics I’m really digging and experimenting with and one of them…","fields":{"tagSlugs":["/tags/creating-art/","/tags/philosophy/","/tags/health-and-wellness/","/tags/blog/"]},"frontmatter":{"title":"Intermittent Fasting","tags":["creating-art","philosophy","health and wellness","blog"],"date":"September 11, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/intermittent-fasting/"}}