{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"heart.jpg\" alt=\"heart\"></p>\n<h3><b><em>Even though I have illustrated this, I still do not know what a healthy heart looks like..</em></b></h3>\n<br/>\n<p><em>My decision to cycle arround Cayman Islands, fourteen kilometers everyday non-stop fascinates me to the core. I recently checked my resting heartbeat per minute (RBPM) through Samsung Health app and my Smartphone and have found that it is flirting at 58 to 64 heartbeats per minute. An athlete’s heartbeat is at 40 to 60. Mine is so close to an active person in sports! Bloody briliant!!!!</em></p>\n<p><img src=\"red.jpg\" alt=\"red\"></p>\n<p>This is Red. A bicycle that I bought from Ms. Lois for CI$ 75 last April. Costs I have incurred to fix, maintain and improve Red are as follows:</p>\n<ul>\n<li>2 tires at CI$ 16.75 each</li>\n<li>2 Pumps at approx CI$ 26~</li>\n<li>Waterproof Sits for CI$ 16~</li>\n<li>2 inner tubes for CI$ 4.75 each</li>\n<li>WD-40 for approx. CI$ 20~</li>\n<li>Metal Basket for bringing stuff - CI$ 22~</li>\n<li>Tools approx. CI$ 30~</li>\n</ul>\n<p><b>Total Cost of my almost athlete heart: CI$ 232~</b></p>\n<br/>\n<p>How I achieved a great milestone for just merely spending so little? the discipline should be emphatic - definitive and insane levels. The daily routine goes like this:</p>\n<ul>\n<li>Try to wake up 4AM to 4:30AM</li>\n<li>Meditate 15 mins to 1 hr; Try to do calisthenics after recovery / rest..</li>\n<li>Prep for 30 mins to work - the usual stuff</li>\n<li>Go cycling 5:30AM - 5:45AM..(7.2 Kms..)</li>\n<li>Work extremely well from 6:45AM to 4:45PM; try to squeeze a blog and art all after lunch..</li>\n<li>5PM cycle back home (7.2 Kms..)</li>\n<li>Buy supplies and / or Prep food (keto) dinner and the ff day’s lunch.. normally 6PM..and eventual dinner.. </li>\n<li>Complete partial blog / art, code / study JavaScript and other topics of interest -normally through youtube and podcasts after dinner. Occasional Mobile Gaming..</li>\n<li>8PM to 9PM sleeptime</li>\n</ul>\n<p>As you can see from my abbreviated list of things that I do everyday - there is no downtime except for sleep. This schedule will drive an average person mad. Well it worked out for me that is why I would recommend this routine to everybody who’s wanting to create a healthy lifestyle. </p>\n<p>Integrating a life long passion for at the very least an aerobic exercise will greatly enhance your life, relationships (sex life, transferring healthy genes) and career (better cognitive abilities). I hope anyone who gets to read this post should study what I have written here very carefully, as I would argue that this is one of my best articles ever written.  </p>","excerpt":"Even though I have illustrated this, I still do not know what a healthy heart looks like.. My decision to cycle arround Cayman Islands…","fields":{"tagSlugs":["/tags/creating-art/","/tags/biology/","/tags/psychology/","/tags/philosophy/","/tags/blog/"]},"frontmatter":{"title":"Primatology","tags":["creating-art","biology","psychology","philosophy","blog"],"date":"August 25, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/primatology/"}}