{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcThNWSNrIK1qd2PXwwyIOj8nOBtVvpcI1XUo47smmfBa3bxro7m\" alt=\"blog\" style=\"width: 700px\">\n<p>I stopped coding after finishing two online courses in web development and ethereum because of my research on climate change which took roughly three weeks. That being said..I will be focusing on coding again..building a sustainability and space research project - <a href=\"https://www.astronucleus.github.io\">astronucleus</a></p>\n<p>I’ve been encouraged by Dr. Jordan Peterson teachings through YouTube (highly recommended!) to take blogging seriously again. He pointed out that the strongest weapon you can possibly acquire in this world is the ability to explain yourself in written form. Writting articulately unlocks one’s potential to think clearly and communicate effectively. He also created a <a href=\"https://www.selfauthoring.com/\">writting program</a> dedicated to increasing the number of people that takes responsibility for their own lives.</p>\n<p>I want to endorse Dr. Peterson’s book as well. I haven’t finished reading it but the fans that talk about this book and his work is so compelling. Here is the link to <a href=\"https://jordanbpeterson.com/12-rules-for-life/\">12 Rules For life: An Antidote to Chaos.</a> </p>\n<p>I am not the sneakiest coder or writer but what’s good about me is I learn rapidly from my mistakes and takes actions to develop habits that builds up over time. I’m pretty sure that If I make an effort to share something valuable everyday, I’ll make the world a little bit better even at a very small scale..</p>","excerpt":"I stopped coding after finishing two online courses in web development and ethereum because of my research on climate change which took…","fields":{"tagSlugs":["/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"write blogs regularly and code often","tags":["personal","blog"],"date":"November 28, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/ramping-up-blogging-again/"}}