{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>Experimenting on my ability to retain information - done with html and css and now javascript, react, node, etc..</em></strong></p>\n<p>I have fairly done really well memorizing a lot of numbers in my work a a receivable accountant here in Cayman Islands or rather found a lot of quick referrences through repetition of methods - normally daily reports or routines that ensures me checking all the boxes in a number of tasks that I am needed to accomplish. But to be fair, I have been doing accounting work or business transactions per se for the past twelve years already. So the learning curve is not as complex as learning code is or even consuming content straight forward topics from books and podcasts. But I see code very differently.</p>\n<p>Machine language is very different than human language. That is why most people find it very hard to navigate coding as it is somewhat another foreign language - but the catch is your talking to a non-human. Well transistors read zeroes and ones which is very different from our brain who fires neurons when we think. We consume very little electricity while thinking and computers need 220V all the time thus making them more energy intensive though. The catch is we don’t actually have a working science on how we encode data to our brain, all we can do is try to mimic our way of perception through a lot of image recognition, memory, logic and math.</p>\n<p>I have made my progress with html and css easily while I’m still stress testing my capacity to understand javascript concepts. The great conditions for me now compared when I started web development are my capacity to get better fuel for my brain (ketones!!!), abundance of resources because I have the means now and uncanny discipline as the reasons to take code seriously are tremendous (see <a href=\"https://tech-stoic.github.io/why-code/\">why code</a>). </p>","excerpt":"Experimenting on my ability to retain information - done with html and css and now javascript, react, node, etc.. I have fairly done really…","fields":{"tagSlugs":["/tags/tech/","/tags/blog/"]},"frontmatter":{"title":"Retaking my full-stack web dev course","tags":["tech","blog"],"date":"December 04, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/re-taking-zero-to-mastery/"}}