{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>Though I have dealt millions of transactions over the years of working as a professional accountant, I believe this list of contracts that we must get right if one will pursue a meaningful life…</em></strong> </p>\n<p>There were a list of things that one should get right to have a life well lived. I guess I’m like aggregating in this blog what I believe Dr. Peterson’s teachings shed to debunk the important problems that face a normal human being..</p>\n<ul>\n<li>\n<p><strong>Our connections with our friends</strong> - be friends with people who want the best for you. Stay away from people who lies from you. Quite difficult to crack open nowadays as most even hardly understand themselves even. The greatest people to associate with only focus on telling you the truth, which is most likely geared to seeing you grow and learn from your mistakes. I bet they are very rare to find as that was my experience.  </p>\n</li>\n<li>\n<p><strong>Our understanding of our jobs</strong> - This was quite harder for me to learn. I bet after learning a lot from Dr. Peterson’s works gave me a more better understanding of how to formulate a better understanding of how the concept of work plays out in our lifetime. As the world now gears to becoming more cybernetic - the concept of education, profession and jobs consequently will change big time. Like for most of history, people are unaware of how us humans figure it out over the past two hundred thousand years. We first became hunter gatherers, then shamans, then farmers, some are priests but most went to war as soldiers or seafarers in concquests, factory workers when we discovered the power of steam engines, became office employees to support the growing need to rebuild countries after two world wars and now we are creating intelligent machines as computer coders. I guess the fundamental concept of work should be “continues learning” since we are so adaptive to the ever changing needs of our society. One must accept that we are not confined in one system of productivity and peek out into the unkown and discover ourselves.</p>\n</li>\n<li>\n<p><strong>Our ability to understand nature and the universe</strong> - most never had the chance to  </p>\n</li>\n<li>\n<p><strong>Our relationship with ourselves</strong> Most navigate life to the thought of our ideas are always correct. This was the case for me for maybe the first thirty years of my existence, well it’s not that I did pathological things or mistakes only but it never crossed my mind that I can be wrong. Now, developing the parts of my thinking were first:</p>\n</li>\n<li>\n<p><strong>Our relationship with our significant other</strong> </p>\n</li>\n<li>\n<p><strong>Our relationship with the future generations</strong></p>\n</li>\n<li>\n<p><strong>Our relationship with the past</strong></p>\n</li>\n<li>\n<p><strong>Our relationship with the future</strong></p>\n</li>\n</ul>","excerpt":"Though I have dealt millions of transactions over the years of working as a professional accountant, I believe this list of contracts that…","fields":{"tagSlugs":["/tags/blog/"]},"frontmatter":{"title":"Important contracts","tags":["blog"],"date":"January 04, 2020"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/important-contracts/"}}