{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>This blog entry is very difficult to create and altered all my plans for the future.</p>\n<p>We have twelve years to throw our economies to rubble, change our culture and mindsets and heal the planet as per <a href=\"http://www.ipcc.ch/report/sr15/\">IPCC report by UN</a> on climate change.</p>\n<p>Professor Guy R. McPherson, an ecology and evolutionary biologist and american scientist that I happen to check and contact with in the interweb told me that there is no hope…less than eight years until we get extinct. This is\n<a href=\"https://guymcpherson.com/climate-chaos/climate-change-summary-and-update/\">Professor McPherson’s report</a> and it’s quite a long read.. eight years is pretty bold claim but after reading and watching his presentations..he has a very strong case for such estimates.</p>\n<p>The economy that is solely relying on fossil fuels since the 1750s had done enough damage to last for centuries to come..Not to mention the plastic we create and use.. </p>\n<p>No technology has ever been built yet to remove carbon in the atmosphere effectively without soaking up too much energy.. or convert plastic without releasing harmful gas..</p>\n<p>BTW, for climate change deniers..<a href=\"https://www.google.com.ph/search?q=97%25+of+leading+scientists&#x26;rlz=1C1CHBF_enPH738PH738&#x26;oq=97%25+of+leading+scientists&#x26;aqs=chrome..69i57.7599j0j4&#x26;sourceid=chrome&#x26;ie=UTF-8\">97% of leading scientists</a> all over the world agree on this. A definitive truth.</p>\n<p>Earth is a freaking masterpiece, luckily not too far or near the sun, has the right orbit to trigger manageable seasons..enough water to generate diversity of life.. Our existence as humans in the last 200 years had altered this balance.. </p>\n<p>I just find it funny, amazing and stupid that we caused our own extinction.. I do accept that death is inevitable but extinction was hard for me to consume..mixed ideas popping in to my head..</p>\n<p>We are in the age of the <a href=\"https://en.wikipedia.org/wiki/Anthropocene\">Anthropocene</a>, the extinction of most life forms (if not all).. caused by stupid humans.. </p>\n<p>For the curious and interested:</p>\n<ul>\n<li>WATCH: <a href=\"https://www.youtube.com/watch?v=M2Jxs7lR8ZI\">Climate change by SciShow</a>, a very honest lesson on climate change..</li>\n<li>WATCH: <a href=\"https://www.youtube.com/watch?v=z9gHuAwxwAs\">The Sixth Extinction by It’s Okay to be Smart</a>, an overview of the the subject..</li>\n<li>WATCH: <a href=\"https://www.youtube.com/watch?v=y2euBvdP28c\">Why people don’t believe in Climate science by It’s Okay to be Smart</a>, If you want to learn more on your primal behaviors..</li>\n</ul>\n<p>I recommend anyone who will read this post to reflect on how precious each second, each day, each moment is..love all forms of life..and don’t harm the planet much more..we already reached the tipping point..</p>\n<p>I still believe the human collective can still make a difference if we let go of this shit economy that we built. This economy that rendered us powerless to the need of material stuff and powerful enough to damage the earth’s lungs.. namely the forests, oceans, and all forms of life.. If we don’t put the planet above everything we do..we’re done for..</p>","excerpt":"This blog entry is very difficult to create and altered all my plans for the future. We have twelve years to throw our economies to rubble…","fields":{"tagSlugs":["/tags/climate-change/","/tags/extinction-notes/","/tags/blog/"]},"frontmatter":{"title":"Climate Change","tags":["climate change","extinction notes","blog"],"date":"November 04, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/climate-change/"}}