{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>I’m kind of obsessed on how to maximize time the little time I have in my life…moreover gone across the depths of science and the universe just to understand the valuable resource not most of us understand..</em></strong></p>\n<p>This is a good metric of where time is…lifespans of some significant things that revolve our lives:</p>\n<ul>\n<li>Single use plastics - 1 day to a week</li>\n<li>Smartphones - 2.5 years</li>\n<li>Dogs - 10 to 13 years</li>\n<li>Cats - 2 to 16 years</li>\n<li>Car -  8 to 15 years</li>\n<li>Gorillas - 35 to 40 years</li>\n<li>Humans - 79 years </li>\n<li>Nile Crocodiles - 70 to 100 years</li>\n<li>Cast iron sewer pipes - 75 to 100 years</li>\n<li>High quality wooden cabinets - up to 50 years</li>\n<li>Earth - 4.5 billion years</li>\n<li>The Sun - 4.5 billion years</li>\n<li>The Universe - 13.78 billion years</li>\n</ul>\n<p>So I have 39 more years if I manage to survive the average age. Though I wanted to live longer than 39 years, well it is rather very difficult to compete with my own biological clock. And who am I to question the magnificent structure of the universe. Very grateful to even have the ability to write blogs and make sense of the experience living in it. </p>\n<p>The right path moving forward is to accept that our time should be well spent, every second of it should be put into the greatest experience that the cup of life enabled us. Each interaction should be well articulated. Listen with silent ears across the noise. Taste even the unfortunate events that fate bestow us. Live life on the edge, because there is no alternative. Some say wasting away through mediocrity is the path forward and I’m not on that bandwagon. Social media is not a game I want to play. Eating tremendous amounts of sugar poisons our body and the future of mankind. Too much alcohol deteriorates the brain and one’s health. The responsibility to maintain the abundance of consciousness is more relevant more than ever now. As the relative truth of the ill informed can cut through the efforts of the renowned scientists and philosophers that invested their resources and time that progress humanity today. </p>","excerpt":"I’m kind of obsessed on how to maximize time the little time I have in my life…moreover gone across the depths of science and the universe…","fields":{"tagSlugs":["/tags/philosophy/","/tags/physics/","/tags/blog/"]},"frontmatter":{"title":"Geological time","tags":["philosophy","physics","blog"],"date":"December 24, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/geological-time/"}}