{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>Ms. Mandy Richardson replied and July to September 2019 is still open for volunteering!!!!</em></strong></p>\n<p>After going to the Immigration Office here in Georgetown, I was browsing my emails and I found a reply from the Kevin Richardson Foubdation c/o Ms. Mandy (his wife) of which I almost fell from my sit while waiting for my turn to the processing counter. I just celebrated it with 2 burgers for CI$ 6~ and it was one of my best meals in a very long time. The immense opportunity to have this crazy and challenging life is rewarding in all by it self.</p>\n<p>Have been a fan of Kevin for years and it would be truly gratifying to see him embodying these connection like no other. The opportunity to cycle out my resources for a better cause especially as the volunteering program of the sanctuary is in a way supporting the expenses in caring for the lions, hyenas and leopards in the park. It is a once in a lifetime opportunity to be with these majestic beasts and meet the man behind the project. </p>\n<p>I have to account all of my gear I guess in the coming months and aprepare my body, mind and health (including my yellow fever vaccination certificate..) because the tasks there is not a walk-in-the-park… Got to check the flight costs and the visa is a tricky one, need to get it from New York. </p>\n<p>Now I seem to have a great material to talk about the <a href=\"https://www.youtube.com/channel/UCSvsJZz6MztOXu_UE9tk7lw\">vlog</a>.</p>","excerpt":"Ms. Mandy Richardson replied and July to September 2019 is still open for volunteering!!!! After going to the Immigration Office here in…","fields":{"tagSlugs":["/tags/creating-art/","/tags/volunteering/","/tags/blog/"]},"frontmatter":{"title":"2 for 6","tags":["creating-art","volunteering","blog"],"date":"October 28, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2-for-6/"}}