{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<p>I will explain how our species have greatly damaged the world in pursuit of money and identity and affecting the balance of ecosystems, oceans and the atmosphere thus our very existence..</p>\n<img src=\"\">\n<p>Modern civilization as we know it was built by wars, religion, education and the invention of money. To date Catholic churches and other religous groups influences Filipinos on how to go on with their daily lives, we acquired this from Spain in 1521 in the age of colonization. Wars created unimaginanble horrors throughout history destroying countless lives and instilling fear upon anyone it touches, causing us to cling to our primal behavior - survival. Educational institutions on the other hand taught the public how to read, write and follow rules. These three concepts could have been great foundations for modern civilization, as we see it now but I would argue they are not in the sense that they failed to preserve the planet or even compare our existence to the universe… These concepts gave birth to the world economy instead..   </p>\n<p>I see economic activities as tied in everything we do. We became very good at optimizaing everything we do.</p>\n<p>Tremendous numbers of Filipinos died in wars and crimes and instilled massive fear in us. This premise is now being capitalized by media to sell their advertisements. Modern media in its core is selling fear everyday, each news you will see will let you feel the world is on the brink of madness. </p>\n<p>A lot of my understanding of the issues in climate change were fortified with my experiences living in the islands for more than a year and acquiring a better understanding of the science of physics and astronomy - the language of the natural world. It is a very complex problem and needs tremendous effort from all of us. If not addressed within the decade…we will really face our extinction - a topic I will discuss in my next blog.</p>\n<p>This is the greatest threat to our existence and I feel the urgency of spreading knowledge and insights.  </p>","excerpt":"I will explain how our species have greatly damaged the world in pursuit of money and identity and affecting the balance of ecosystems…","fields":{"tagSlugs":["/tags/climate-change/","/tags/extinction-notes/"]},"frontmatter":{"title":"Humans toying with the natural world","tags":["climate change","extinction notes"],"date":"November 07, 2018"}}},"pageContext":{"slug":"/climate-change-the-longer-explanation/"}}