{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>For the complete history of stoicism - I made a separate <a href=\"https://migueldeguzman.github.io/stoicism/public/index.html\">website</a> for it. But what I was able to do with stoicism is the main focus of this blog post.</p>\n<p>Stoicism. I first encountered this frame of thinking from Tim Ferris, author of Tools for titans and 4HWWK and he explains it as his main operating system for life. It is a life altering mindset, much better than anything I’ve come across - believe me I’ve studied and tried everything. </p>\n<p>Ms. Alpha (my boss here in the islands) recently have a piece of comment on my look while walking towards her wearing my full packed bicycle gear all with a camera on my helmet. “Miguel is like a machine, he got everything right - he has his diet and his exercise”. I hope I remembered everything that she said correctly but what my response to her is that “This island is like magic island, the island allows me to do practially everything I want”. </p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/0c1fabe4c7882c0bb79c9a93d527940c/6dca9/machine.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 84.915611814346%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAARABQDASIAAhEBAxEB/8QAGQABAQADAQAAAAAAAAAAAAAAAAQBAgMF/8QAFQEBAQAAAAAAAAAAAAAAAAAAAAH/2gAMAwEAAhADEAAAAfdn7zRUyNZQsB//xAAZEAADAQEBAAAAAAAAAAAAAAABAjEAAxD/2gAIAQEAAQUCMRyWxnNw/hnKb//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8BH//EABgQAQADAQAAAAAAAAAAAAAAAAEAEBGB/9oACAEBAAY/AoiZel9r/8QAHBAAAgMAAwEAAAAAAAAAAAAAATEAEBEhQVFx/9oACAEBAAE/IWQy0Aie6Z8gXbnBo8pkfT//2gAMAwEAAgADAAAAEHsogv/EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8QH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8QH//EABwQAQEAAQUBAAAAAAAAAAAAAAERABAhUaGxQf/aAAgBAQABPxBIhsgu+ObkCQf2aUOSilyMpByuPdOvnbe6f//Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"machine\"\n        title=\"\"\n        src=\"/static/0c1fabe4c7882c0bb79c9a93d527940c/c739e/machine.jpg\"\n        srcset=\"/static/0c1fabe4c7882c0bb79c9a93d527940c/8ee9c/machine.jpg 148w,\n/static/0c1fabe4c7882c0bb79c9a93d527940c/ebbe7/machine.jpg 295w,\n/static/0c1fabe4c7882c0bb79c9a93d527940c/c739e/machine.jpg 590w,\n/static/0c1fabe4c7882c0bb79c9a93d527940c/5413e/machine.jpg 885w,\n/static/0c1fabe4c7882c0bb79c9a93d527940c/6dca9/machine.jpg 948w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Why she called me a machine? I cycle a minimum of 14 kms a day, eating only meat and fats (keto!!) while trying to maintain a high octane kind of work in the ground floor of our company. I am just happy that she appreciated the way I try to do life - as I see most are just baffled or confused of what I do. She and her husband Mr. Elie (my boss as well) understands my views that is why I try to reciprocate the appreciation with the highest quality of work possible. I love their knowledge of philosohy and history and it makes it easier for us to talk most of the time. </p>\n<p>But that is not a complete answer as after reflecting much on what she said.  Why I do what I do is because predicated on the idea that I don’t like regrets - health, learning and life is most real when your moving and experiencing.. stoicism is my pillar for this thougths. </p>\n<p>Stoicism fits with physics, natural selection, psychology, calming oneself and the drive to master skills. The ability to watch people interacting with you even in a contentious one - stoicism makes it easy to understand anything. It’s just so weird that this way of thinking is so ancient as the greeks and it works all the time. </p>\n<p>When you were put into experiences where you lose everything - literally - friends, money and resources - this pushes one to make a complete reformation of life. I’m really happy that I have read on stoicism as it kept the last breathing piece of me to be intact enough to get things together and resurge with flames of freedom like a phoenix. </p>\n<p>Rebirth. I’m a changed person after I crashed and burned in my project in Palawan. But that gave me the most powerful realization of all - Invincibility is achieved in the mind, not through material things or the retinas of others…Invincibility is truly achieved in stoicism.</p>","excerpt":"For the complete history of stoicism - I made a separate  website  for it. But what I was able to do with stoicism is the main focus of this…","fields":{"tagSlugs":["/tags/creating-art/","/tags/philosophy/","/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Stoic philosphy","tags":["creating-art","philosophy","personal","blog"],"date":"August 12, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/garbage/"}}