{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>I did not hold the guitar for more than a week and it is due to a lot of reason but more importantly I believe is I try to atleast do a headstart in learning music despite my lazyness..</em></strong></p>\n<p>Starting at zero is a concept that one trying to learn anything new must acknowledge. Accepting that one can build from nothing is a core of how any great feat can be achieved. I did it with computer coding, cycling and calisthenics - now I’m doing it to physics, psychology and neuroscience, writing and yes - playing the guitar.</p>\n<p>Another note on learning is that one must have very compelling reasons to pursue such endeavor. It gives us more power to recalling bits of details on what we are studying plus gives us an extra boosts when habit formation becomes harder and harder which is very true when holding the guitar at the right form and including the toll on the tips of the fingers where it will really hurt a lot first before it will be easy.</p>\n<p>Nothing great starts easy. This is always true in life in general - creating a family or fostering a relationship, enduring a loss of a love one…all of such require sacrifices. But I would argue that the end all of sacrifices are rewards that one will see into the future. Even though there is no time machine to see the far future, the inevitability of hard earned habits is inevitable to pursue without putting a lot of time and effort. The sad truth for this matter is our current over abundance hides this truism, making most of the world clinging to cortisol kicks from  news and social media.</p>","excerpt":"I did not hold the guitar for more than a week and it is due to a lot of reason but more importantly I believe is I try to atleast do a…","fields":{"tagSlugs":["/tags/music/","/tags/blog/"]},"frontmatter":{"title":"GL-EP#2 - Starting at Zero","tags":["music","blog"],"date":"September 27, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/guitar-lesson-ep2/"}}