{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/b2ea916cb3ccd64e6411da83ee79a070/4b553/kidgorilla.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 65.99799398194584%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAECAwX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHo3bNxB//EABoQAAIDAQEAAAAAAAAAAAAAAAECAAMREBL/2gAIAQEAAQUCtZvSXbxq9gqUQDB//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAGRABAAIDAAAAAAAAAAAAAAAAAQAQESEx/9oACAEBAAY/AtKQzXb/AP/EABoQAQADAQEBAAAAAAAAAAAAAAEAESExQXH/2gAIAQEAAT8hCUTzMfsQUXmpBsuW+wfIbVcmAcn/2gAMAwEAAgADAAAAECAP/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPxA//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAHBABAAICAwEAAAAAAAAAAAAAAQARITFBYZHR/9oACAEBAAE/EKnDwAp28hJaQoKIADTLu3F04fkO5LYQqvIRamif/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"kidgorilla\"\n        title=\"\"\n        src=\"/static/b2ea916cb3ccd64e6411da83ee79a070/4b3ab/kidgorilla.jpg\"\n        srcset=\"/static/b2ea916cb3ccd64e6411da83ee79a070/f8bb1/kidgorilla.jpg 148w,\n/static/b2ea916cb3ccd64e6411da83ee79a070/900ac/kidgorilla.jpg 295w,\n/static/b2ea916cb3ccd64e6411da83ee79a070/4b3ab/kidgorilla.jpg 590w,\n/static/b2ea916cb3ccd64e6411da83ee79a070/78641/kidgorilla.jpg 885w,\n/static/b2ea916cb3ccd64e6411da83ee79a070/4b553/kidgorilla.jpg 997w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>I love that young silverback gorilla. It reminds me how evolution turned us from primates to homo sapiens. What skills we needed to improve over 2.5 million years and reach our current state.</p>\n<p>After retiring from my profession as an accountant two years ago, I took time to pursue different things - skills that have been shoved out of my brain because I was busy with work. I have done both… improving my best armaments and improving what I’m so bad at so in this blog I will try to share my reflections on both paths..</p>\n<p>Strengths are traits, skills, techniques that we have that we don’t need too much thinking or effort to exert as this is what we normally use at work or business as our bread and butter. Core abilities keeps us surviving, like the fishes know how to swim away from predators or lions know how to stealth and strong-arm their kill. There are a lot of books that says improving your strengths is easier than focusing on your weaknesses and that is true. You don’t need too much thinking to create opportunities for yourself as doing things the way you normally do will naturally open doors for you. Since we have a world of abundance - especially for work, it is very rare to not find a trade that you won’t function at your peak capacity.</p>\n<p>For the most part of my professional accounting experience, this is what I have been doing. Since I wield the computer keyboard extemely well, I was able to acquire better software knowledgeability than most and have been able to solve unique problems awarded by top executives in the offices I’ve worked with. That is also a big reason for me to pursue my passion after retiring - trusting myself that when the worst of worst happens with pursuing unstructured ways of earning a living.. I could always go back and I’ll can adapt and perform at my peak. That brings me to the 2nd part of my blog today..  </p>\n<p>Most books would recommend that do not improve your weaknesses. That is what I followed for the most part of my life, I just focused on them in the last two years. I would understand why they are recommending focusing on ones’s strengths instead - my personal biases worked against me, improvement takes a lot of time, rather no clear path to follow and seeking proper advice has proven to be so difficult. This takes too much effort and eats up a lot of our thinking capacity and pulls us into different directions - places that we’ve never been yet.</p>\n<p>The journey for the past two years was so extreme. The highest of high as I used my passionate drive to view the world and it took me to places, people and ideologies that scared people would’nt dare to venture. Passion is a double edge sword. It is rather easy to trip into human landmines when your imbued with tremendous pursuit. I have encountered that, what seem to be the right path became the worst that you can imagine. People at best when you have resources, became worst when your’e out of ammo. As guns lost their edge, I became a person that people tried to corrupt for their own personal agenda. That is chasing to improve your weaknesses for me - it’s like entering the abyss. </p>\n<p>The abyss is the place where conventional thinking will not work. I tried it. Anxiety and pain will just be the anchor that you can cling on and it is futile - as this route will destroy you. Money, Books and Friends will not help you when your in the abyss. Money - or rather resources are already lost at this point that is why it sucks. There is no book that can save you, the problem is so personal that your solution should come from a place where nobody has gone before. Conventional friends - sadly the current post modern world turned your friends to zombies and they won’t even bother helping you, your so deep in the void that they won’t care to reach you because they have they’re own problems to resolve. This hole I was to solve can be solved by my own efforts alone. That swayed me to trying to improve my weaknesses.</p>\n<p>Improving what you’re good at will get you to somewhere, but not to a place where you deeply would want to pursue. This was a big revelation for me at the time. The abyss I was in forced me to reach farther than I am reaching… to be honest I even tried to reach the end of the universe through astronomy. To get to my Integral level (a level where one can adapt to different stages of conciousness - <a href=\"https://en.wikipedia.org/wiki/Integral_theory_(Ken_Wilber)\">pioneered by Ken Wilber</a>) and view each situation wholistically (primal, tribal, modern, post-modern), I needed to study A LOT of stuff I’m so weak at. These skills are writing, philosophy, biology, physics, astronomy, human behaviour, neuroscience, web development, blockchain.. most I guess have been part of my blogs before and there are still a lot in the pipeline that I need to study. I have now accepted the fact that I don’t know everything, and it will take a lifetime to learn properly. Realizing this broke a barrier I never thought that is existing. It allowed me to absorb more from what reality is - plugging in to only what is true.</p>\n<p>In summary, one must improve their ourselves and become better members of society.\nWhile improving our strengths will keep us surviving and perform well, improving our weaknesses will reveal a new us, hiding in the horizon. But…\nThe point that I would like to impart is that there is a different cost for both - one is easier, the other - more messier. Venture at your own risk. </p>","excerpt":"I love that young silverback gorilla. It reminds me how evolution turned us from primates to homo sapiens. What skills we needed to improve…","fields":{"tagSlugs":["/tags/self-help/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"What to improve? strengths or weaknesses?","tags":["self-help","creating-art","blog"],"date":"March 07, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/improve-what-strength-weaknesses/"}}