{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"pandorasbox.jpg\" alt=\"pandora\"></p>\n<p>Physics is the field I wished that I have deep dived more when I was younger. I now see the implications of knowing the boundaries of everything we are and the universe. It all comes down to atoms and molecules interacting at the quantum level to create all the trees and the stars, the oceans and the corals, us and the people we love. Scientific truths like this are particularly harder for most people to understand, as seen to the numerous contradictions to the science of climate change. Truth is experiential for most, as what they say that their best teacher was their past decisions or regrets. I might have understood along the way that this method of learning is not the case even though I have experienced more than the average person. </p>\n<p>Like Physics, Natural Selection is fairly difficult to understand for most. This is due to the myriads of metaphysical ideologies that we encounter the moment we are born to this world. Most (like me!) have been disuaded most of their life by any form of ancient teachings that are packaged in the concept of religions. We also are socialized by our family in the ways themselves have been taught by their elders, and so on and so fort. We evolved from apes but we fail to recognize this very fact at scale, I often see our species being too addicted to sweets or be impaired by our inability to swim faster than fishes in the ocean… We are mammals and we will never escape that.</p>\n<p>We can only live a tiny bit of time compared to how old the world or the universe is. I believe this is one of the most misunderstood concepts of all. We fail to recognize the importance of facing risks, loving unconditionally, exercising routinely, learning as much as we could or as much as possible. Our time is limited (approximately 99+ years hopefully for me) and recognizing the limitations of our biological capacity will push us to realize that death is at the core of our existence. </p>\n<p>Realizing the frailities of life for myself while traveling and my year doing business in Palawan, Philippines have taught me that anytime I can die. I cycle everyday in Cayman Islands even though it is very risky to do it. I battle that thought a lot with myself..as my pursuit of creating a good family for my own definitively needs me to be alive, well and cognitively capable. I need to live but I need to live freely, enjoyably and healthily as much as possible…I still don’t have the right formula for my drive to fix the death issue of cycling. I’m factoring extreme acceptance over it. My response time to almost accidents that happend where on-point but scary - because it has only been one of the four occurences that I have been scared. I may see it in a way like MMA fighters or US army soldiers were trained - and the Amygdala is not flaring up -  the fear sensing part of the brain.</p>","excerpt":"Physics is the field I wished that I have deep dived more when I was younger. I now see the implications of knowing the boundaries of…","fields":{"tagSlugs":["/tags/health-fitness/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Discerning the truth","tags":["health & fitness","creating-art","blog"],"date":"August 02, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/discern-ng-the-truth/"}}