{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>First hand impressions upon discovering I’m an INFJ type..</em></strong></p>\n<p>My friend Zeiya from Malaysia offered me this morning the idea to check my Myers-briggs personality type. The result caught me off guard. </p>\n<p>All this time I thought that there is a problem with society on how to perceive information or the lack of gratitude or knowledge on how history, science, biology is connecting…but the idea that I have caught some wave of ability to innately convert unconventional information to use - filtering people’s emotions, voices, reactions very differently from a normal person - it never have crossed my mind. </p>\n<p>So I’m approaching the world very differently than most. How different? I play part of the .05% of the global population especially that I’m a male. This explains why I’m so curious. This explains why I’m so very intuitive. This explains why I can get to understand different sorts of frame of thinking in a number of disciplines. So that’s equally good and bad - fascinating as it sounds, yes I’m cursed in a way.</p>\n<p>Who would want to be a walking sponge of other people’s emotions for all shit the world has to offer? Knowing that the assessment explains well how I think, but yeah a lot of it is not all good. I’m happy to have found a lot of lectures and materials online especially Dr. Peterson’s videos. The past two years I believe I was able to improve my way of thinking and decision making. Yeah, more knowledge is a somewhat cure to this insanity. </p>\n<p>Lucky or unlucky as I may sound… I should put myself on the responsible end, consider it as a gift instead of a burden and try to make an impact to society. That I believe I need to figure out in the coming years.</p>\n<p>btw, if you are interested in the test, here is the <a href=\"https://www.16personalities.com/\">link</a>. </p>","excerpt":"First hand impressions upon discovering I’m an INFJ type.. My friend Zeiya from Malaysia offered me this morning the idea to check my Myers…","fields":{"tagSlugs":["/tags/psychology/","/tags/blog/"]},"frontmatter":{"title":"INFJ","tags":["psychology","blog"],"date":"December 11, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/INFJ/"}}