{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS-aL0UZFiVvUcqvZUjwCYXUoZj3nSCr5HHTLfvvB4HC8SUnQI0\" alt=\"consumption\" style=\"width: 700px\">\n<p>To sustain all of our global needs - we make fruits and vegetables available even if out of season, allocate significant areas of land to produce meat, use fossil fuel for energy, use cargo ships and fossil fuels to transport cotton for clothing, quarry for construction materials, again use fossil fuel for travel and leisure, extract resources for technology and research. Most of these problems are sourced out to businesses that operate for a profit - hence Capitalism. More consumption, more profit, more products, better services - the cycle repeats itself over and over.  </p>\n<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQE--AdhiXCxcWCg6H1x1MDYDE-Si_r6NU91UUyF1mWqnVkYK6i\" alt=\"foodwaste\" style=\"width: 700px\">\n<p>I find this very alarming due to the amount of resources needed to sustain our wants and needs. <a href=\"https://www.youtube.com/watch?v=6RlxySFrkIM\">A video done by Climate lab and Vox</a> on food wastage explains that United States throw 40% of the food that is still edible! This shows how broken the system is.</p>\n<p>We are approximately 7.7 billion to-date, growing at a pace of <a href=\"https://www.google.com/search?q=rate+of+increase+in+population&#x26;rlz=1C1CHBF_enPH738PH738&#x26;oq=rate+of+increase+in+&#x26;aqs=chrome.1.69i57j0l5.10772j0j7&#x26;sourceid=chrome&#x26;ie=UTF-8\">1.07% per year</a>. It is catastrophic if all humans on earth would try to live like an average american. Experts thinks that we need <a href=\"https://www.bbc.com/news/magazine-33133712\">four earths</a> to accomodate resources needed. </p>\n<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRxKbBU-mp9DnSoDiDMjmZYYegrxtOb92l9ouO9pCSY-qm7b2-Gng\" alt=\"charlesdawrwin\" style=\"width: 700px\">\n<p>I find it amazing to reflect on the law of natural selection theorized by Charles Darwin. We came to a point where our human species can create complex systems to support the population, but to madly reflect on how can it not create waste while providing all of us its benefits - there is a limitation in a way. I’m deeply afraid of how things can playout in the near future. I wonder what will Sir Charles say about the <a href=\"https://www.nationalgeographic.org/encyclopedia/great-pacific-garbage-patch/\">Pacific Garbage Patch?</a></p>\n<p>Earth will survive as long as the magnetic field created by the iron core is intact, protecting itself from solar radiation. If all ice will melt, all of us will perish but earth will survive. What we should fear in our generation should be our own fate - the first generation entrusted with the most complex task of adapting 7.7 billion people to scarcity and change of culture.  </p>","excerpt":"To sustain all of our global needs - we make fruits and vegetables available even if out of season, allocate significant areas of land to…","fields":{"tagSlugs":["/tags/capitalism/","/tags/charles-darwin/","/tags/history/","/tags/blog/"]},"frontmatter":{"title":"Consumption Overdrive","tags":["capitalism","Charles Darwin","history","blog"],"date":"February 25, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/ç/"}}