{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ0qNgF34XXR2gshrskr98Lg-EDENYIlVCM3uDT1g0z4AVLU2cNMg\" alt=\"plans pic\" style=\"width: 700px\">\n<p>After conducting a week of in-depth research and learning on climate change and how bad can things become in the near future.. I focused on creating a plan..sort of. This is how I made my way out of a depressed state and become very optimistic future again. This is the focus of this blog and how you may get some interesting ideas from my thought exercises..</p>\n<p>With the ever increasing complexity of the world, I would not rely on plans to guide my day-to-day living. Creating habits are better at that. </p>\n<p>But a general purpose plan to create a structure of actions for the future is a great thing to have. It is necessary to base decisions from understanding your own reality and not of other life or opinions (I do believe most people do this, I’m like this before..).</p>\n<p>I will have to go back learning new concepts again as learning is my ultimate antidote to chaos. Remaining static or failing to upgrade your brain…will render life stagnant and unfulfilling. Learning physics and astronomy are areas of sciences that allowed me to better understand the effects of what we do to global warming and climate change in the not so distant future. I push to continue this new found super power of searching for well grounded truths around the world that I could learn and apply into my own life…</p>\n<p>Enrolling to Singularity University is a sure thing for me as their programs may hold the key to the future, harnessing the potential of the crowd to power exponential growth. I consider the next two to three years my sandbox period to learning what the future holds. I might consider to apply for a migration due to climate change. We’ll see..</p>\n<p>Finding resources became a topic that pops into my head as well. A great job overseas or migrate to other countries are viable options.</p>\n<p>Advocating for co-existence due to issues climate change awareness as well as this is the biggest deterrent to the future, a pushback to the progress of the great minds that built civilization as we know it today.</p>\n<p>So my three-concept-general-purpose-plan is learn and build resources, advocate for co-existence.</p>","excerpt":"After conducting a week of in-depth research and learning on climate change and how bad can things become in the near future.. I focused on…","fields":{"tagSlugs":["/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Plans..sort of","tags":["personal","blog"],"date":"November 07, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/plans-sort-of/"}}