{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>Well to kickstart the series of my progress on the ketogenic diet…I’ll maybe be focusing on why I’m doing it because I realy haven’t explained it extensively in this blog. So why I’m on Keto..? It’s because of three sets of topics namely: sugar, evolutionary science and benefits.</p>\n<p>Sugar. Almost everything has sugar nowadays and its hilarious what we have made society so vulnerable to the taste of it. I had numerously told in various blogs / vlogs how sugar is causing obesity and diabetes but I haven’t really explained the science behind it. Caveat: I’m not a medical personnel and take my advice with precaution. My goals in sharing my thoughts about Keto is to share knowledge that I have applied for myself and known to work four months in to the diet. Sugar basically is not a very good power source for our brain - of which is the most energy intensive part of our body. Overeating creates an alteration to our neurological reward system and throwing errors all over the place thus creating sugar addiction. It is so common. Why I say this? whenever I talk to people about the reasons why I’m doing the ketogenic diet - most tend to sway off, not listen or contradict… of which I do understand that the addiction is more stronger than lending another person an ear to hear out another way of living. In this <a href=\"https://www.youtube.com/watch?v=UYxFYuwXTEg&#x26;list=PLTJxtj-PNNe-2FTSR7RwtEs78UB0adwyv\">video</a>, I explained it in a different light.</p>\n<p>Evolution. Our species branched out from a common ancestral line as the bonobos 200,000 years ago. From that point, we started to learn organized hunting, eating bone marrow and mastering the art of fire until we discovered organized farming 12,000 years ago. Doing the math: 12,000 / 200,000 = .06 or 6%. What does this equation mean? it means that for 94% of the time, we have been consuming fats and meat through hunting and foraging. There are also earlier discoveries of our species where in we have been categorized as smashing mamoth bones - for bone marrow as it is also believed that this caused our neurocortex to be more developed than most species. This concept is fairly hard to understand for most but I this theory though unproven as no one can go back in the past makes sense since it fits the concept of natural selection - which I believe is the overarching code of the universe and runs in the background..</p>\n<p>The benefits of Keto is unprecedented to my surge of creativity and cognitive function. I have been able to comprehend complex problems at scale and be able to produce more content in this blog. My mind is constantly bombing of ideas - thus bursting into words in this blog. Tiny snippets of data that I come across from people becomes very useful to me whenever I discuss with my co-workers. And not to mention that I’m gaining muscle mass even though I cycle 14 kms per day - 7 days a week. </p>\n<p>The downside of keto? maybe the amount of explanation that I get to share to a lot of people whenever they knew my diet…and it’s deep science as I have explained above. Another downside maybe is people around you trying to adjust to your diet which is sometimnes uncomfortable because it is not in my intention to bug people just because I’m doing a different thing - especially Filipinos are infatuated of rice and other cool pastries. </p>\n<p>For me, it is a test of discipline and courage to maintain the diet. But I’m doing great with it with no downside, so there is no stopping as of the moment. </p>\n<p>PS. I’m quite curious of how I will adapt still if I will be in a relationship… A pretty fascinating problem to solve.</p>","excerpt":"Well to kickstart the series of my progress on the ketogenic diet…I’ll maybe be focusing on why I’m doing it because I realy haven’t…","fields":{"tagSlugs":["/tags/creating-art/","/tags/health-fitness/","/tags/blog/"]},"frontmatter":{"title":"Keto - four months in..","tags":["creating-art","health & fitness","blog"],"date":"August 08, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/keto/"}}