{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>Kicking of the first day of the year to plan the year itself..</em></strong> </p>\n<p>Since 2019 went well than expected, even though the pains of mediocrity tries to grip my commitments to learning, experiments and volunteering - I happen to still cut through the its tentacles. Well this blog should cover for my focus on 2020. </p>\n<p>I think I’ve covered this on my reflections on 2019, but yeah… an overarching plan for the year should constantly creep my thoughts so I could fully check on myself every now and then especially when I’m moving in seemingly good paths where fatal flaws stay hidden. Well, let’s write some ideas for 2020:</p>\n<ul>\n<li>A stronger upper body frame especially improving my back muscles, even thought the flexibility routine that I used for a year to fix my scoliosis have seem to work, I believe improvement in these areas are still warranted for the long run.</li>\n<li>Better mix of diet, infuse more variety of minerals and vitamins to my ketogenic diet as chasing to learn more code, basic math and art is to energy intensive not to mention the physical toll of cycling, calisthenics. (I forgot to add here that I have a day job as well. If I’m not adapted to the ketogenic lifestyle, ow man I do not know where will I get the energy to stay productive and responsible..)</li>\n<li>I was reading an algebra book yesterday and now I recognize that I should view any kind of math as a pattern recognition mechanism. Let’s see where will this book lead me. Could it be productive to write a website for algebra so I can better remember what I’m learning. I’ll think about how to do this along the way. </li>\n<li>Journaling daily, a physical notebook I recycled from the office…forcing me to exercise the ancient art of writing while adding some doodles too. </li>\n<li>More art as I need to improve on the muscular dexterity of weilding a pen or digital pen. </li>\n<li>Need to plan for a short vacation from the island. Too much options - especially when options are as endless nowadays.</li>\n<li>Seek more people that are interested in the same works that I do.</li>\n<li>Should make drastic improvements on the caymaneco website, me and Ms. Tammy will kick-off this year’s discussion on the 4th.</li>\n</ul>\n<p>Nothing in this list is engraved in stone. It will definitely change and improve on these rough ideas as I navigate the year, trying to make diamonds out of them just as how I did with cycling, writing code and learning.</p>","excerpt":"Kicking of the first day of the year to plan the year itself..   Since 2019 went well than expected, even though the pains of mediocrity…","fields":{"tagSlugs":["/tags/blog/","/tags/art/","/tags/philosophy/","/tags/psychology/"]},"frontmatter":{"title":"Why create empty spaces?","tags":["blog","art","philosophy","psychology"],"date":"January 19, 2020"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/empty-spaces/"}}