{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"stoic.jpg\" alt=\"stoic\"></p>\n<p>For the complete history of stoicism - I made a separate <a href=\"https://migueldeguzman.github.io/stoicism/public/index.html\">website</a> for it. But what I was able to do with stoicism is the main part of this blog post.</p>\n<p>Stoicism. I first encountered this way of thinking from Tim Ferris author of Tools for titans and 4HWWK and he explains it as his operating system. It is really an operating system much better than anything I’ve come across - believe me I’ve studied and tried everything. Ms. Alpha (my boss here in the islands) recently have a piece of comment on my look while walking towards her wearing my full packed bicycle gear all with a camera on my helmet. “Miguel is like a machine, he got everything right - he has his diet and his exercise”. I hope I remembered everything that she said correctly but what my response to her is that “This island is like magic island, the island allows me to do practially everything I want”. </p>\n<p>Why she called me a machine? I cycle a minimum of 14 kms a day, eating only meat and fats while trying to maintain a high octane kind of work in the ground floor of our company. I am just happy that she appreciated the way I try to do life - as I see most are just baffled or confused of what I try to do.. </p>\n<p>But that is not a complete answer - why I do what I do is because I don’t like regrets - health, learning and life is most real when your moving and experiencing..where stoicism is a pillar of this. </p>\n<p>Stoicism fits with science, natural selection, the concepts of psychology, calming oneself and the drive to master skills. This is huge for me, I say a game changer. The ability to watch people interacting with you even in a contentious one - stoicism makes it easy to understand anything. It’s just so weird that this way of thinking is so ancient as the greeks. </p>","excerpt":"For the complete history of stoicism - I made a separate  website  for it. But what I was able to do with stoicism is the main part of this…","fields":{"tagSlugs":["/tags/creating-art/","/tags/philosophy/","/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Stoic philosphy","tags":["creating-art","philosophy","personal","blog"],"date":"August 12, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/stoic-paradigm/"}}