{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"jbp.jpg\" alt=\"jbp\"> </p>\n<p><strong><em>Help the world if you have the capacity to do so.. A thought that ran into my brain while after <a href=\"https://www.jordanbpeterson.com\">Dr. Peterson</a> explained how one should tackle individual responsibility first before spreading it to the world..</em></strong></p>\n<p>This blog is one of the steps I’m taking to understand the stages of my adult life. I’m taking a lot of action to try to develop my skills in a lot of areas I’m interesested with but applying them for the betterment of society has always been at the back of my head, constantly contemplating. </p>\n<p>Volunteering is a milestone I’m reaching out deep in to my cognitive and physical capacity. Now I’m helping Ms. Tammy to remodel the <a href=\"https://caymaneco.org/\">Caymaneco.org</a> website. I’m looking to spend my vacation in 2020 to volunteer in a different country, I applied for one today for a wildlife sanctuary in South Africa which specializes in handling lions, hyenas and leopards. The guy behind this project is <a href=\"http://www.lionwhisperer.co.za/contact/\">Kevin Richardson</a>, also known as “The Lion Whisperer” and I did cited his case in <a href=\"https://tech-stoic.github.io/7.7-billion-gods/\">one of my all-time-favorite blogs that I wrote</a>.</p>\n<p>There is this feeling that I am trying to do so much stuff. I do not know the path for this stage moving forward but I guess realizing that there is more things needed to be done is a critical step of which I’m willing to take now more than ever. The unlocking mechanism to my potential as an individual connected to the cosmos is best extracted through accepting the responsibility in all areas of life within my grasp. This stage is bloody challenging for me. Being financially stable is a downside to my ability to focus on what to do next - making me consider more options which is most of the time not good.</p>\n<p>After I settle all of my debt (yes I’m paying for the Navotac project still..) - I’m going to see if I can finance some coding projects with remote coders in the Philippines. We’ll see, there is really so much options.</p>","excerpt":"  Help the world if you have the capacity to do so.. A thought that ran into my brain while after  Dr. Peterson  explained how one should…","fields":{"tagSlugs":["/tags/creating-art/","/tags/volunteering/","/tags/blog/"]},"frontmatter":{"title":"2 for 6","tags":["creating-art","volunteering","blog"],"date":"October 28, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/volunteering copy/"}}