{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/29f93d2ebc7af491820523ce937d44a1/9eebb/tools.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 76.20357634112793%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAECAwX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHrrwaA/8QAGxAAAgEFAAAAAAAAAAAAAAAAAQIRAAMSITL/2gAIAQEAAQUCYkXMpC8sNxSiB//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABoQAQABBQAAAAAAAAAAAAAAAABhARAREjH/2gAIAQEABj8CzCFGzlv/xAAaEAACAwEBAAAAAAAAAAAAAAAAAREhMUFR/9oACAEBAAE/IcEgTe60nZCjw6mcE9pdSMSnp//aAAwDAQACAAMAAAAQ4A//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/ED//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/ED//xAAcEAEBAAMBAAMAAAAAAAAAAAABEQAhMVFxgbH/2gAIAQEAAT8QqVHUm9vv0ZZmCgQm9cPMsiUaFV/c1akAgtjcHKBDF7vnxjNEdmf/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"tools\"\n        title=\"\"\n        src=\"/static/29f93d2ebc7af491820523ce937d44a1/c739e/tools.jpg\"\n        srcset=\"/static/29f93d2ebc7af491820523ce937d44a1/8ee9c/tools.jpg 148w,\n/static/29f93d2ebc7af491820523ce937d44a1/ebbe7/tools.jpg 295w,\n/static/29f93d2ebc7af491820523ce937d44a1/c739e/tools.jpg 590w,\n/static/29f93d2ebc7af491820523ce937d44a1/9eebb/tools.jpg 727w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>I use my personal laptop to code. I use my smartphone strictly for art and studies. I use YouTube, Udemy and Coursera to watch a lot of free courses. I use my profession as an accountant to earn money. I use money to support my mom and fund my experiments. </p>\n<p>Tools. We are not the only animals who could wield items. Chimpanzees use sticks to get termites from mounds. They use rocks for nuts, crushed leaves for water. True to fact, we were just so lucky to have discovered fire - this tool have given us enough to create warmth in cold climates (yes, we survived the ice age), defend ourselves from predators and most important of it all - the ability to cook food. </p>\n<p>In the book <a href=\"https://archive.org/stream/pdfy-DDoNCJJ_Wt0qOH7e/Catching%20Fire%20%5BHow%20Cooking%20Made%20Us%20Human%5D_djvu.txt\">Catching Fire</a> I would quote: </p>\n<p><em>“Those claims constitute the cooking hypothesis. They say humans are adapted to eating cooked food\nin the same essential way as cows are adapted to eating grass, or fleas to sucking blood, or any other\nanimal to its signature diet. We are tied to our adapted diet of cooked food, and the results pervade\nour lives, from our bodies to our minds. We humans are the cooking apes, the creatures of the flame.”</em></p>\n<p> I don’t like cooking but after learning this fact, I have utmost respect to our ancestral connection in weilding the pot and spatula. I should learn to cook properly..</p>\n<p>Language is a tool that separates us apart from the animal kingdom. We can customize our thoughts through the amount of data that we can memorize and utter to our peers.</p>\n<p>Money is a tool that we cannot live without. But the inequality around the world is commonly attributed to  We divide our world withstanding to the amount of riches one has. Statistics show that if you earn <a href=\"https://www.investopedia.com/articles/personal-finance/050615/are-you-top-one-percent-world.asp\">32,400 USD annually</a>, you are part of the 1% of the world. The gap between the rich and the poor becomes wider and wider every decade. The lowest of the 23 poorest countries - Democratic Republic of Congo has an annual <a href=\"https://www.businessinsider.com/the-23-poorest-countries-in-the-world-2015-7\">average income of 394.25 USD</a>.   </p>\n<p>Going back to my opening statement.. not all people use the tools that I use in the same manner and yes its bad to ask them to do use them as I do. But bear with me. Most people see their jobs as their identity. I was like that before but when it came to a point that my profession is not responding as it was explained to us in universities to reasons beyond your control (eg. you got fired, poor management etc..) - the situation you are in will bite you. Personal computers are rarely used for productivity, most common use of it now to watch online videos or read social media posts. Smartphones are designed to allure us and consume our attention so specific platforms can run advertisements and consume our valued time. TVs bombards us too much of seemingly important news (eg. accidents, politics etc.) but true to fact, this do not help us at all. These are reasons why we should think of these aspects of our lives as “tools” and not as identities that represent us.</p>\n<p>Our attention is a tool that is being mined by companies everyday. Never in our history that a few groups of people that have the capacity to affect the minds billions. We are in that spectrum now. Tools shape our culture. Tools mold our body - gradually, over long periods time. We developed a culture for cooking and in the process we acquired a brain capable understanding the world around us. I just hope that each people who have the chance to read this material would keep an open mind about how their actions compares to the past and how it shapes the present and eventually the future as this intertwine between our tools, culture and biology will determine our metamorphosis, our history moving forward.</p>","excerpt":"I use my personal laptop to code. I use my smartphone strictly for art and studies. I use YouTube, Udemy and Coursera to watch a lot of free…","fields":{"tagSlugs":["/tags/charles-darwin/","/tags/robert-sapolsky/","/tags/history/","/tags/technology/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Tools, Culture & Biology","tags":["Charles Darwin","Robert Sapolsky","history","technology","creating-art","blog"],"date":"March 03, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/tools-culuture-biology/"}}