{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"rose.jpg\" alt=\"rose\">\n<br/></p>\n<p>I have reflected a lot for quite a while on what I can say to you as of the moment, I hope you would hear me out.</p>\n<p>I thought I would be okay if I were to die now, nextweek, tomorrow - anytime. I thought I was okay.</p>\n<p>Why? I had a great run! I did all the things I want whenever I want it while trying to stay truthful to myself and the people I interact with. I have traveled so much in my life, helped people in need. No regrets at all. </p>\n<p>I did a lot of mistakes along the way and have wronged people in the process, helped a corrupt presidential family to keep destroying a nation and lied quite a bit. I’m no saint, there are things that I have been involved and I will never be proud of those times..ever.</p>\n<p>I did the best life ever that I could, it was a good 33 years run. I bakpacked Thailand-Vietnam-Malaysia &#x26; Philippines and met the most amazing people. Most people from my country could’nt afford what I have done and for that I’m so grateful of the the opportunities that rain on me time and time again.</p>\n<p>I have crashed and burn after Navotac. A drastic shift in my paradigm occured as I became more inclined into learning more about how our human mind works as I have tasted true maelovence in this chapter of my life and refocused my views on living as educated and truthful as possible.</p>\n<p>I have been blessed along the way to meet people from the interweb and including words of advice from great philosphers - alive and dead. I deep dived into the science of everything, from the atoms to the stars, the corals and the galaxies…I learned everything I could just to become better at articulating deep problems. I always say to my peers in Salty’s (the Badgers!!!) that it’s either its a serious or depressing talk is always my point of discussion. I’m sure you’ll find me to cracky most of the time.</p>\n<p>I am at my healthiest state: mind, body and spirit. Built foundational skills that bring me top shape. More grateful and respectful in most of the frailities of human interaction. I rarely get mad…after understanding that all of us make mistakes, and our subjected to biological weaknesses…it’s just unfortunate that most do not know neuroscience, as it could be a game changer for our species.</p>\n<p>All the material cravings went away after fostering stoic values. I always try to control myself and not the difficulties of others. This is a lifelong pursuit and hope that you would understand my decisions in the future.</p>\n<p>Now I’m sure I would like to live… because I want to meet you. This I believe is the only remaining chase I’m striving for..to find you and build a future with you. If I were to die tomorrow, I would be fucking pissed of fate as We never got the chance.</p>","excerpt":"\n I have reflected a lot for quite a while on what I can say to you as of the moment, I hope you would hear me out. I thought I would be…","fields":{"tagSlugs":["/tags/creating-art/","/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Letter to my future wife","tags":["creating-art","personal","blog"],"date":"August 09, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/letter-to-my-future-wife/"}}