{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<hr>\n<p>I have studied parenting and psychology so much that I realize that I became too complex of a person. Meeting new people became a burden for me especially considering someone as a potential “life partner”.</p>\n<p>Discovering the deeper intricasies of life is overly beneficial and have paved way for a meaningful life, making every second of my waking time worth and fulfilling. Yet a detailed construct of how people’s brain work kind of makes me a perfectionist in a way because every emotion and interaction that I absorb iany situation… surely I have an explanation for it. Rarely that I do not.</p>\n<p>Considering this frame of thinking, I sound crazy. Maybe it’s just that I hated wasting time and focus it to fruitful pursuits like finding the one person. Like killing a werewolf with a silver bullet - the answer to the question that I have been trying to decode for the past two or three years.</p>\n<p>I have met a lot of women along the way and considered them significantly. This might be the serotonin kicking in as I try to map my standards to my friends standards, or rather soceity’s standards of relationships… But to think of it, the standards are vague in itself. Rather a complex machine of biology, culture and two individuals trying to navigate the world.</p>\n<p>I met someone that can understand me or rather tries to understand what I’m up to in the past three years. Most of the research I do (the narrative of this blog) and the projects I tinker are so profound that I often become singled out by mediocre systems - trying to dispense out my uttered words or written code, trying to bring down a lot of the significant narrative that made the modern world peaceful and more orderly in the past 70 years. Her perspectives on my views are framed in a different culture and set of experiences - but we get parallel still as we try to disect the truth of the topics we have touched so far.</p>\n<p>The truth cuts through. It cuts us even when we tell lies. We bleed yet the bleeding causes us to understand that the complexity of knowledge is best articulated in questioning the very foundations of our ways of belief and sharing them with others.</p>\n<p>I’m very thankful of your time Zeiya</p>","excerpt":"I have studied parenting and psychology so much that I realize that I became too complex of a person. Meeting new people became a burden for…","fields":{"tagSlugs":["/tags/psychology/","/tags/blog/"]},"frontmatter":{"title":"Zeiya","tags":["psychology","blog"],"date":"December 19, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/defining-a-life-partner/"}}