{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"\n  <a class=\"gatsby-resp-image-link\" href=\"/static/815f09c15179f9aca868dd6dbf66b2a1/3c844/SmartSelect_20190804-103912_Sketch.jpg\" style=\"display: block\" target=\"_blank\" rel=\"noopener\">\n  \n  <span class=\"gatsby-resp-image-wrapper\" style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\">\n    <span class=\"gatsby-resp-image-background-image\" style=\"padding-bottom: 49.84395898350424%; position: relative; bottom: 0; left: 0; background-image: url(&apos;data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAKABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAMEAQX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHuS1rHGh//xAAbEAABBAMAAAAAAAAAAAAAAAACAAEDERIxMv/aAAgBAQABBQI9RyZEi5Fmtf/EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABcQAAMBAAAAAAAAAAAAAAAAAAABELH/2gAIAQEABj8CNjv/xAAaEAEAAgMBAAAAAAAAAAAAAAABABEQIUFR/9oACAEBAAE/IUlyJVu+HjgDZ5Cahj//2gAMAwEAAgADAAAAECMP/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPxA//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAGxABAAEFAQAAAAAAAAAAAAAAAREAECExQWH/2gAIAQEAAT8QdyqOAd0KIRgMeU9sQARUiUoRO8HYt//Z&apos;); background-size: cover; display: block;\">\n      <img class=\"gatsby-resp-image-image\" style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\" alt=\"jackofalltrades\" title src=\"/static/815f09c15179f9aca868dd6dbf66b2a1/c739e/SmartSelect_20190804-103912_Sketch.jpg\" srcset=\"/static/815f09c15179f9aca868dd6dbf66b2a1/8ee9c/SmartSelect_20190804-103912_Sketch.jpg 148w,\n/static/815f09c15179f9aca868dd6dbf66b2a1/ebbe7/SmartSelect_20190804-103912_Sketch.jpg 295w,\n/static/815f09c15179f9aca868dd6dbf66b2a1/c739e/SmartSelect_20190804-103912_Sketch.jpg 590w,\n/static/815f09c15179f9aca868dd6dbf66b2a1/5413e/SmartSelect_20190804-103912_Sketch.jpg 885w,\n/static/815f09c15179f9aca868dd6dbf66b2a1/4efde/SmartSelect_20190804-103912_Sketch.jpg 1180w,\n/static/815f09c15179f9aca868dd6dbf66b2a1/abfc3/SmartSelect_20190804-103912_Sketch.jpg 1770w,\n/static/815f09c15179f9aca868dd6dbf66b2a1/3c844/SmartSelect_20190804-103912_Sketch.jpg 2243w\" sizes=\"(max-width: 590px) 100vw, 590px\">\n    </span>\n  </span>\n  \n  </a>\n    \n<br>\n<p>Thanks to Architect Jonathan Dioscoro for giving me an inspiration to write something about this complex topic.\n<br/></p>\n<p>Okay, to start the point of our discussion was the few people who are somewhat presented of a unique capacity to deep dive into complex problems. Different fields of disciplines varying from science, sports, art and even technology… The unique concept of a person tagged as “jack of all trades”.</p>\n<p>I’m not sure if I can fit myself into this category. My coding skills are average, enough to debug open source codes that I like. My grammar is not that good compared to people who can really write well and  I haphazardly put myself into mediocrity as I almost got hit by a car a while ago. But of all the things I could do, one thing I am extremely sure that I’m very good at is approach a problem as truthful  and deep as possible. </p>\n<p>What do I mean by truthful and deep? Let me expand on this.</p>\n<p>My fascination for a lot of scientific subsets like physics, neuroscience and computer science have gave me an edge over the average person. I see things in how our human mind works while factoring the physical boundaries of a certain problem and also applying binary logic to it. I mirrored this perspective from Elon Musk. This process goes deep sometimes. I’ll give an example. Climate change and plastics have baffled me from my stint in Palawan as garbage was all over the string of islands of Linapacan during the months of June to September including the bleaching of corals. Undertstanding this problem needs a fair amount of technical knowledge. The jetstream is the wind channel where most of our climate is highly dependent upon, the garbage patches all around the world are also being directed by this. The impact of the arctic region and the amount of sea ice it creates to give a cooling effect in our atmosphere while also reflecting the sunlight back to space is decreasing. The sun’s power to constantly bombard our planet with lightwaves is a constant. We still continue to charge our atmosphere of carbon dioxide from fossil fuels. It is not because we don’t have the technology to not to do so…but rather excruciatingly painful fact to accept is the amount of people who still need cheap (from an economic standpoint) power most especially less fortunate countries are still tremendously high. How can we just tell them to stop? Is it more rationale to improve the lives of all people all around the world so we can focus as a species to tackle the ambitious re-energification of the world…? It goes deep. So deep that I really do not have the solution to how complex of a problem it is.  </p>\n<p>The example above shows my understanding of a fairly big burden. I see it from a physics, psychological, technological and economical aspect. Our daily lives is filled with massive amounts of small or big burdens that needs to be understood and resolved. Some have easy solutions, most needs time and collective effort. </p>\n<p>Possibly another key trait that I have is extreme patience. What do I mean by extreme patience? well I believe my mom (nanay in Filipino) provided me with an embeded genetic structure to endure worthwhile pain and appreciate sacrifices along the way. This blog is a particularly good example. The art I created and used in this post was done for two and a half hours. I took a forty five minute (10 kms) in between just to go to a really cool location (Camana Bay) just to write a fairly long technical post. Upon finishing the project and entering the last code on the commandline, it didn’t posted…apparently the public wifi doesn’t allow git push to Github servers so I ended have going home in the heat of tropical noon. I started 7am and finshed 2pm..  I believe most will not do this as it takes tremendous effort just to understand what I have just said. I’m patient enough to create with no particularly direct positive result. I do it even though I make grammatical mistakes over most of my write-ups. This is somewhat similar to some subsets of stoic philosphy where in you just try your best at all cost, even though there will be mishaps along the way.</p>\n<p>I believe these two traits might be my super power. Passionate and driven to solve all kinds of problems and combined with uncanny patience, I see it as a deadly combination. Whenever a wall of uncertainty is presented in my path…I never evade…I’ll just find the right tool to disect the problem so I can patiently smash it pieces to pieces. </p>\n<p>This is why maybe I definitely agree with Arch. Jonathan’s understanding of how a person categorized as a “jack of all trades” work…which is a person where given a particular problem to solve or skill to learn…will excel at it than the average person…the only difficult part of it is since they have the uncanny ability to adapt to any situation, their future is rather very difficult to predict. They live mostly in the present and hyper focused to find progress and solutions.</p>\n<p>I could empathize on this frame of thought a lot. I really do not know where I will be in the next two to three years… as I currently am being bombarded with a ton of complex opportunities. I only try to learn and understand as much as possible, making sure I eat well and exercise a lot. Am I part of this group? I do not know…I just know that I do not fit in the boxes that society currently have for the most of the population. </p>\n<p>But to end this complex post, Hitler was artistic enough to apply for university studies, got denied in the process and ended up killing millions of people in the holocaust. Having said that…it is a big of a responsibility to the mature ones to guide the next generation of misfits - the world needs more of Elon, Einstein and Shakespeare and not another monster hiding in the shadows of poor parenting. </p>","excerpt":"Thanks to Architect Jonathan Dioscoro for giving me an inspiration to write something about this complex topic.\n Okay, to start the point of…","fields":{"tagSlugs":["/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Jack of all trades","tags":["creating-art","blog"],"date":"August 04, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/jack-of-all-trades/"}}