{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/06f1561d2cc5532735993b4bba4650d3/60bdf/whysoserious.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 568px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 91.72535211267605%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAASABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAQFAQP/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHfz7IjRcEngFAP/8QAHBAAAgICAwAAAAAAAAAAAAAAAAECEQMyBBIx/9oACAEBAAEFAiN9icqKbmmZPeRtj0//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/AR//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/AR//xAAbEAABBAMAAAAAAAAAAAAAAAABABAREgIxcf/aAAgBAQAGPwJaNpcUyhih1v/EAB0QAAICAQUAAAAAAAAAAAAAAAERADFREEFhocH/2gAIAQEAAT8hiBKbDsdA3KzAbqAluzGCdoeSlkHzKp//2gAMAwEAAgADAAAAEIMPPP/EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8QH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8QH//EAB0QAQACAgMBAQAAAAAAAAAAAAEAIRExQVFxEGH/2gAIAQEAAT8QiB0ltC8/Ayly6zMixhCtm9+2eTcpkpxBkmzU+RU1GIPwb7iS91P/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"whysoserious\"\n        title=\"\"\n        src=\"/static/06f1561d2cc5532735993b4bba4650d3/60bdf/whysoserious.jpg\"\n        srcset=\"/static/06f1561d2cc5532735993b4bba4650d3/8ee9c/whysoserious.jpg 148w,\n/static/06f1561d2cc5532735993b4bba4650d3/ebbe7/whysoserious.jpg 295w,\n/static/06f1561d2cc5532735993b4bba4650d3/60bdf/whysoserious.jpg 568w\"\n        sizes=\"(max-width: 568px) 100vw, 568px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>As a fan of <em>Batman</em>, the concept of having a clown as the main antagonist is so cool and crazy for avid followers like me. The title of this post is one of <em>The Joker’s</em> most famous lines..in one of my most favorite performances in a <a href=\"https://en.wikipedia.org/wiki/The_Dark_Knight_(film)\">movie</a>. But the question have been a theme lately as I’m often ask of it a lot (or a variation of the same question). </p>\n<p>The answer/s are complicated. I wonder how long this post will going to be..</p>\n<p>Boredom and Focus. Realizing the value of mindfulness and stoicism in my life have taken me to a place to scrutinize my way of response to each information that my mind absorbs or creates. That’s a long sneaky sentence but pretty much captures my point. I find true value in focused effort to improve instead of wasting time to unproductive habits. Nowadays its just so easy to become bored, just hold your smartphone and you’ll never get bored - possibly forever. As I have said in one of my blog posts <em>small stuff matter</em>.</p>\n<p>Regret and death. This is a core to everything I do. I deeply regret wasting time. What if I die tomorrow…what will I do to day if that’s the case? Time is the most precious resource, we trade it for attention, money etc.. I regret having lived a life that other people forced into me.. Regret and death are powerful forces that most do not think about - until they are in the worst situations or the lying in the deathbed.</p>\n<p>Truth. Being serious, focused and purposeful is living on the side of truth. If everyone would just read and understand what have happened in the past, I think there wouldn’t be a need to create this blog post. History, as bloody as it may seem teaches the truth - knowledge fortified over time. I recommend this <a href=\"https://www.youtube.com/playlist?list=PL8dPuuaLjXtMczXZUmjb3mZSU1Roxnrey\">resource</a> if you wish to start learning more where you have come from..</p>\n<p>Stability. Self-aware individuals create a stable nation. It is not the other way around, and will never be. This was well documented in the Gulag / Soviet regime - as all people stuffed their lives full of lies created a horror that will never go away and obliterated communism for the longest time. </p>\n<p>Health. Neuroscience explains a lot about how our body operates - each action powered by a single / group of hormones. There is incentive in doing things right and not half baked as these hormones reinforces what we do. Do a specific action numerous times and you have a habit. Do it a certain number years and it will a significant effect your health. </p>\n<p>Purpose. I believe that my purpose in this world is to make it better and impart the right values to the next generation. This requires tremendous effort, time and energy. This requires me to learn new skills. This requires me to seek refuge in a stable environment. This requires me to experiment. This requires me to love. </p>\n<p>Climate Change. This might be a controversial one to add. I find it troubling to find out that in this generation that I’m now experiencing…on the horizon is food shortages, war, famine, desertification, loss of all ice, extinction.. As I have said before… I do understand that we may die, but extinction is kind of hard for me to accept. The loss of science and progress that our species was able to accomplish is a big deal. </p>\n<p>I could add more to this list maybe in the future. It’s not that long as I thought it would be but I pretty much added value in answering the question.. I hope people will start asking themselves the same question.. Why so serious? or rather why not?</p>","excerpt":"As a fan of  Batman , the concept of having a clown as the main antagonist is so cool and crazy for avid followers like me. The title of…","fields":{"tagSlugs":["/tags/history/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Why so serious?","tags":["history","creating-art","blog"],"date":"March 04, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/why-so-serious/"}}