{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"\n  <a class=\"gatsby-resp-image-link\" href=\"/static/9c09b74a417c502b8e173b6465998e8d/bbc52/SmartSelect_20190314-213849_Autodesk%20SketchBook.jpg\" style=\"display: block\" target=\"_blank\" rel=\"noopener\">\n  \n  <span class=\"gatsby-resp-image-wrapper\" style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\">\n    <span class=\"gatsby-resp-image-background-image\" style=\"padding-bottom: 222.16288384512683%; position: relative; bottom: 0; left: 0; background-image: url(&apos;data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAsABQDASIAAhEBAxEB/8QAGgAAAgMBAQAAAAAAAAAAAAAAAAUBAgYEA//EABQBAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhADEAAAAXkW4hgQHlm9EsHQByKm6Y0JQP/EAB4QAAICAgIDAAAAAAAAAAAAAAECAAMREhMzBBAU/9oACAEBAAEFAnbUK2fRGYtgW+WHC3s3PL+qoLyTyevRhAci0bMc/RX1/wD/xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/AV//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/AV//xAAgEAACAQMEAwAAAAAAAAAAAAABAgAQETESIEFCUXGC/9oACAEBAAY/AthB7YqAvmjcz6qbNiXiiOmo2i+p/8QAHRAAAgIDAAMAAAAAAAAAAAAAAREAIRAxQWGBof/aAAgBAQABPyGxTz1IKIhlTBTKMY6JdLwDq8BAHQvAtQCSTSj+6m9eorDsaBIG6jSEwDPgT//aAAwDAQACAAMAAAAQYMk8QM//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/EF//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/EF//xAAfEAEBAAICAgMBAAAAAAAAAAABEQAhMVEQQWFxgbH/2gAIAQEAAT8QSXkD6zi6WXXgyEU9l5MJYg+gJYX534QhtOej3hANoUdDj8wsLzk9Kgp7bh0FBADSa8OAtxDh7cNMbk2ApHok/Zh8EFwiWO7jS5YlD0q8bZ84IPX8s//Z&apos;); background-size: cover; display: block;\">\n      <img class=\"gatsby-resp-image-image\" style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\" alt=\"codeart\" title src=\"/static/9c09b74a417c502b8e173b6465998e8d/c739e/SmartSelect_20190314-213849_Autodesk%20SketchBook.jpg\" srcset=\"/static/9c09b74a417c502b8e173b6465998e8d/8ee9c/SmartSelect_20190314-213849_Autodesk%20SketchBook.jpg 148w,\n/static/9c09b74a417c502b8e173b6465998e8d/ebbe7/SmartSelect_20190314-213849_Autodesk%20SketchBook.jpg 295w,\n/static/9c09b74a417c502b8e173b6465998e8d/c739e/SmartSelect_20190314-213849_Autodesk%20SketchBook.jpg 590w,\n/static/9c09b74a417c502b8e173b6465998e8d/bbc52/SmartSelect_20190314-213849_Autodesk%20SketchBook.jpg 749w\" sizes=\"(max-width: 590px) 100vw, 590px\">\n    </span>\n  </span>\n  \n  </a>\n    \n<br>\n<p>This post is dedicated to my friends namely “Latakz” (somewhat means “residue” in tagalog / filipino language).. That Image is Ex Machina btw, a facinating movie to watch especially for AI enthusiasts like me.</p>\n<p>My friends know that I’m always bragging about my realizations on a lot of experiments that I did and is doing.. but coding is one of what I am recommending them the most…as it is a life altering skill..</p>\n<p>Why I say that it is a game changer? It simply lets you understand and navigate the world better. The ability to code in javascript have given me a new way of interpreting information in a cause and effect manner. We define the arguments then we put it in code so it can review if your arguments are acceptable by a certain filter that is predetermined by engines hooked in our browsers called JIT compilers then accepts the code so you can make the web do what you want - literally. How cool is that!!! The ability to create interfaces that interacts with data from people using your websites or the ability to design colors, shapes and effects to the finest details… that is what web coding do…or most computer languages does. </p>\n<p>Learning code gave me a better understanding of how things work, especially truths that have plagued me to understand since I was young. My brother use to tell me that there are codes running in our veins that are ancient and proper coding made me realize that biology is in a way a coding mechanism through DNA and RNA. No wonder we’re coding a lot of ills like diabetes through sugar, lung cancer through cigarettes and fossil fuel exhausts or obesity through over consumption and lack of routinary exercise. </p>\n<p>Thoughts encode too… I had this plague in my brain that I hated my dad for making my brother in-operable in the real world after making a big mistake. This threw a bug in my head that “Why do I have to pick up the slack for the family being the youngest?” It is only being recently that I understood that that words somewhat altered my thinking and other thoughts like acceptance and resilience. Coding makes you understand what you do, like how most coding languages have “loops” which is like the habits that we do. The same science is applied through any kind of training. When we put stress to our muscles, it contracts and creates new micro-repairs which is another kind of genetic encoding. It let’s our body as well get accustomed to pain - which is another form of encoding.</p>\n<p>Artificial intelligence is knocking at our doorsteps…Softbank and Microsoft investing billions, there is no evading the future of code - that can understand to a degree of intelligence. It used to be us only who can play chess, go or WOW but now we are being destroyed at the world stage. Languages and art are currently being debuked by machine learning and even there is now a way to create fake videos - mimicking real persons saying any statement that you want them to make, hilarious and scary.</p>\n<p>I don’t want to sound bleak, but I literally believe that there is no choice - coding skills should ramp up as we all are in it. At a basic level, AI is choosing what we see in searches, Facebook sells our data and we follow people in Instagram.. There is no escaping it and to close this blog…Code is a game changer, I believe the cost of not learning it is too high at the world’s current state.</p>","excerpt":"This post is dedicated to my friends namely “Latakz” (somewhat means “residue” in tagalog / filipino language).. That Image is Ex Machina…","fields":{"tagSlugs":["/tags/creating-art/","/tags/blog/","/tags/code/","/tags/javascript/"]},"frontmatter":{"title":"Why code..","tags":["creating-art","blog","code","javascript"],"date":"August 07, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/why-code/"}}