{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"zeiya.jpg\" alt=\"zeiya\"> </p>\n</br>\n<p><strong><em>I don’t know if you’ll like reading this Zeiya! ^_^</em></strong></p>\n<p>Discovering the deeper vines that engulf our lives is overly beneficial and have paved way for a meaningful life, making every second of my waking time worth and fulfilling. Yet a detailed construct of how people’s brain work kind of makes me a perfectionist in a way because every emotion and interaction that I absorb in a situation is almost most of the time - I have an explanation for it, rarely that I do not. Considering this frame of thinking, I sound crazy for the average person. </p>\n<p>Maybe it’s just that I hated wasting time and focus it to fruitful pursuits like finding “the” person. Like killing a werewolf with a silver bullet - the answer to the question that I have been trying to decode for the past two or three years now.</p>\n<p>I met someone that can understand me or rather tries to understand what I’m up to, somehow we are drawn to intersecting forms of interest. Most of the research I do and the projects I tinker are so profound that I often become singled out by mediocrity at large, trying to dispense out my uttered words or written code, trying to bring down a lot of the significant stories that made the modern world peaceful and stable for the past 70 years. </p>\n<p>Her perspectives on my views are framed in a different culture and set of experiences - but we get parallel still as we try to disect the truth of the topics we have touched so far.</p>\n<p>The truth cuts through. It cuts us when we tell lies. We bleed. Yet the bleeding causes us to understand that the complexity of knowledge is best articulated in questioning the very foundations of our ways of believing and sharing them with others makes us more vulnerable but establish courage in the process.</p>\n<p>I’m very thankful of your time Zeiya. Trying to unpack my crazy thoughts with your open mind was very helpful in my formulation of how to interact with the world. I’m sure in this process we are both discovering ourselves and the bits of puzzles that we need to move forward. </p>\n<p>I’m very grateful of each nanosecond spent by your briliant heart and mind…I’m looking forward to seeing your significant works shine through your students, make them better stewards of the future..keep pushing Zeiya. </p>","excerpt":"  I don’t know if you’ll like reading this Zeiya! ^_^ Discovering the deeper vines that engulf our lives is overly beneficial and have paved…","fields":{"tagSlugs":["/tags/psychology/","/tags/blog/"]},"frontmatter":{"title":"Sequencing","tags":["psychology","blog"],"date":"December 19, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/sequencing/"}}