{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<p><img src=\"californiafire2018.jpg\" alt=\"californiafire2018\"></p>\n<p>Physics. Fire is a chemical reaction. Virtually anything in this world can burn given the right circumstances. Those conditions were met last <a href=\"https://en.wikipedia.org/wiki/2018_California_wildfires\">November and December 2018</a> in various places in California. How big of a deal were the California Wildfires?</p>\n<ul>\n<li>Total fires: 8527</li>\n<li>Total area affected: 766,439 hectares</li>\n<li>Total cost of damages: 3.5 billion USD</li>\n<li>Lives lost: 98 civilians, 6 firefighters </li>\n<li>Non fatal-injuries: At least 80 people</li>\n</ul>\n<p>I visualize this happening in other parts of the world and to my suprise a few weeks ago as parts of the mountains in the province of <a href=\"https://www.gmanetwork.com/news/news/regions/456209/benguet-forest-fire-on-and-off-since-march-8/story/\">Benguet is burning</a>. We are also encountering the <a href=\"https://www.rappler.com/business/225837-mwss-says-duterte-wrong-advice-manila-water-mess\">longest water shortage</a> in decades in the Nation’s Capital. What is alarming for me is the misreporting of traditional media regarding this climate changes we are encountering. It’s a global event, available in the internet to study but these establishments where we entrust our lives with information is basically not doing their jobs.</p>\n<p>I guess the thing with not telling the actual has some incentives. People are not in panic mode and society will still function normally as intended. It will trigger massive changes for public infrastructures and would affect all current plans of the government. But is it really worth the price of not telling the truth? Putting the lives of innocent people on the line just to preserve temporary stability or personal  gain? I think only time will tell how much damage will these kinds decisions affect millions of people in our country. </p>\n<p>I also fear that a lot of countries where corruption is pervasive in their government and traditional media structures, that the same conditions are happening - concealing information regarding climate change for the benefit of a few groups of people. How insane could this be? </p>","excerpt":"Physics. Fire is a chemical reaction. Virtually anything in this world can burn given the right circumstances. Those conditions were met…","fields":{"tagSlugs":["/tags/climate-change/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Dr.Peterson Pt.2 -","tags":["climate change","creating-art","blog"],"date":"March 16, 2019"}}},"pageContext":{"slug":"/dr-jordan-b-peterson-part-2/"}}