{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/5c6d0167ea0fb5c596929130e4a41761/45193/donaldtrump.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 76.72327672327673%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAgABBf/EABQBAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhADEAAAAe3qI4x//8QAFxABAAMAAAAAAAAAAAAAAAAAAQARIP/aAAgBAQABBQJuDn//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/AT//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/AT//xAAUEAEAAAAAAAAAAAAAAAAAAAAg/9oACAEBAAY/Al//xAAZEAADAAMAAAAAAAAAAAAAAAAAAREQITH/2gAIAQEAAT8hCiw9E4Ko/9oADAMBAAIAAwAAABCzz//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8QP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8QP//EABoQAQADAAMAAAAAAAAAAAAAAAEAEUEhMVH/2gAIAQEAAT8QVltoejIlNt33DkjxsWqdfcnIAsPWf//Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"donaldtrump\"\n        title=\"\"\n        src=\"/static/5c6d0167ea0fb5c596929130e4a41761/c739e/donaldtrump.jpg\"\n        srcset=\"/static/5c6d0167ea0fb5c596929130e4a41761/8ee9c/donaldtrump.jpg 148w,\n/static/5c6d0167ea0fb5c596929130e4a41761/ebbe7/donaldtrump.jpg 295w,\n/static/5c6d0167ea0fb5c596929130e4a41761/c739e/donaldtrump.jpg 590w,\n/static/5c6d0167ea0fb5c596929130e4a41761/5413e/donaldtrump.jpg 885w,\n/static/5c6d0167ea0fb5c596929130e4a41761/45193/donaldtrump.jpg 1001w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Wherever you live in this world, Donald Trump has affected your life in a way, mostly bad.Okay let’s start pumping stress hormones to your bloodstream (Sorry!):</p>\n<ul>\n<li><b>The power of social and mainstream media.</b> His election inarguably was won through his marketing skills (He’s great at it to be honest), maintream media kept highlighting all of the stupid things that he say all day - non-stop. That is crazy to think that he got around 2 billion dollars worth of free publicity through his rethorics. Social media magnified the problem through its ability to consume people’s attention 24/7. This big hole it caused in history can never be forgotten. It showed that our ability to think and analyze has gone down dramatically. Another example why I keep saying most people are like zombies nowadays. I got in to a heated argument with a girl from USA in Thailand before (Jan 2017) by just explaining how I have perceived of him winning the election against another bad apple - Hilary Clinton. This bullet point is the reason.</li>\n<li><b>Lying becomes the new normal.</b> He is insane, not insidious - yet. He keeps talking about building a wall to guard against Mexico from bringing drugs and guns to his country. He speaks of it like it is a crisis that his country needs to pay attention, painting a picture of dire state of emergency but yet he still keeps golfing on the weekend for 6 hours.. His delusion about what he wants to promote as a right he acquired from winning the oval office is so amazing and stupid at the same time. The strongest economy in the world is being ran by a guy that is the king of lies.</li>\n<li><b>Climate Change Denial.</b> This a big one. He is pulling civilization back just by denying climate change. It would be okay if he is just a president of a small country but it’s not the case. He is supposed to be the most influential person to address the doom we are in and yet he keeps on protecting the fossil fuel industry. We all know that there is tremendous money in it for him to do such but is it really worth it? Going to be written in the history books that you are one of the most stupid person to walk the face of the planet? ow men this one literally burns people as a lot die of heat waves all over the world. It’s not that he’s to blame to all of global warming but come on - power is supposed to be used for the good in the modern times and not to serve certain groups of people.</li>\n</ul>\n<p>It’s not all bad with the “Donald Trump Effect”, Let’s talk about how he is somewhat causing some good in the world..</p>\n<ul>\n<li><b>Intellectual Dark Web and Podcast.</b> <a href=\"https://www.google.com/search?rlz=1C1CHBF_enPH738PH738&#x26;ei=udKIXJ3VHfGzmgeztrioBA&#x26;q=intellectual+dark+web&#x26;oq=intellectual+dark&#x26;gs_l=psy-ab.1.0.35i39j0l9.23335.33293..34508...1.0..0.896.3476.0j1j5-3j2....2..0....1..gws-wiz.....6..0i71j0i131.KpvsnsAN9ak\">IDW</a> is a group of amazing people who focuses on making sense of what is happening all around us. They could be the replacement for traditional media as the knowledge that you can acquire for them is really worth your time. I personally follow <a href=\"https://tech-stoic.github.io//dr-jordan-b-peterson-part-1/\">Dr. Jordan B. Peterson</a>, <a href=\"https://samharris.org/\">Sam Harris</a>, <a href=\"http://bretweinstein.net/\">Bret Weinstein</a> and <a href=\"https://www.youtube.com/channel/UCzQUP1qoWDoEbmsQxvdjxgQ\">Joe Rogan</a> as they do this talks that is so amazing and their arguments becomes tools that fortifies my view about the world. I also listen to a bit of Jocko Willink’s <a href=\"http://jockopodcast.com/\">podcast</a> for he has a lot of sensible arguments to reflect upon. And most importantly..</li>\n<li><b>People are waking up.</b> People are taking notice of how cruel and stupid the world is through Trump’s rise to power.\nWe do need a good picture of the future to some extent so naturally we seek for people who can help us and that is what I think is happening.\nPeople now are like seeking for alternative sources of information (like the IDW) to make sense of what is happening. </li>\n</ul>\n<p>Trump is still seating for approximately two years and He is still writing history as we know it. My personal advice to everyone: go deep into the topics that run your life.. this is really hard because all the things that take away our attention is inside our smartphones and it is so easy to err on the side of simplifying our understanding. Technology have created all of the world’s convenience for us to benefit from but I believe it is hiding the bleak picture that we are getting dumber and dumber that is why people like Trump can shake reality to its knees. </p>","excerpt":"Wherever you live in this world, Donald Trump has affected your life in a way, mostly bad.Okay let’s start pumping stress hormones to your…","fields":{"tagSlugs":["/tags/creating-art/","/tags/history/","/tags/blog/"]},"frontmatter":{"title":"The Donald Trump Effect","tags":["creating-art","history","blog"],"date":"March 15, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-donald-trump-effect/"}}