{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<p>We have twelve years to correct our economy, culture and heal the planet as per <a href=\"http://www.ipcc.ch/report/sr15/\">IPCC</a> on climate change.</p>\n<p>Professor Guy R. McPherson, an ecology and evolutionary biologist and american scientist that I happen to check and contact with in the interweb told me that there is no hope…less than eight years until we get extinct. This is Professor McPherson’s report… <a href=\"https://guymcpherson.com/climate-chaos/climate-change-summary-and-update/\">quite a long read..</a></p>\n<p>The economy that is solely based on carbon baaed fossil fuels since the 1750s had done enough damage to last for centuries to come.. </p>\n<p>No technology has ever been built yet to remove carbon in the atmosphere effectively without soaking up too much energy..</p>\n<p>We are in the age of the Antropocene, the sixth mass extinction and caused by us stupid humans.. </p>\n<p>BTW, for climate change deniers..<a href=\"https://www.google.com.ph/search?q=97%25+of+leading+scientists&#x26;rlz=1C1CHBF_enPH738PH738&#x26;oq=97%25+of+leading+scientists&#x26;aqs=chrome..69i57.7599j0j4&#x26;sourceid=chrome&#x26;ie=UTF-8\">97% of leading scientists</a> all over the world agree on this. A definitive truth.</p>\n<p>I still believe the human collective can still make a difference if we let go of this shit economy that we built. This economy that rendered us powerless to the need of material stuff and damaged the planet’s lungs. The forest, the oceans, the wild life.. Earth is a freaking masterpiece, luckily not too far or near the sun, has the right orbit to trigger manageable seasons..enough water to generate diversity of life.. Our existence as humans in the last 200 years had altered this balance.. </p>","excerpt":"We have twelve years to correct our economy, culture and heal the planet as per  IPCC  on climate change. Professor Guy R. McPherson, an…","fields":{"tagSlugs":["/tags/extinction-notes/"]},"frontmatter":{"title":"Abrupt Climate Change","tags":["extinction notes"],"date":"November 04, 2018"}}},"pageContext":{"slug":"/Climate change and this had put my mind into perspective more than anything else/"}}