{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<br/>\n<p><img src=\"serpents.jpg\" alt=\"serpents\"></p>\n<p><strong><em>120,000 years ago - we are apes that lives on trees and so as big serpents..</em></strong> </p>\n<p><em>We have one of the most powerful eyesights in the animal kingdom. By far the only animals that are better than us are birds of prey like owls, eagles and hawks. But how we get to have a brain where half of it is dedicated for  image processing - one theory is how serpents have helped us to be of such hundreds of thousands of years ago.</em></p>\n<p><em>The theory works like this.. the ape who was able to see the snake in the trees most likely have lived to become our ancestor. Also, another corelated myth where we got our ability to adore mythological and religous personas came from those who were able to slay early snakes, as the stories of these called “heroes” got repeated over time. This I think is one of the best topics I have crossed in the past months, also allowing me to become more grounded on how can natural selection workout across different species and allowing another to evolve for the better at very random instances.</em></p>\n<p><em>One of Dr. Peterson’s warning that I often reflect whenever I see people acting fuzzy or attitudes swaying like bamboo trees is to see that the worst snakes that anyone can encounter are the snakes personified inside people. This logic flows as well in Carl Jung’s theory of embodying the monster inside us where I discussed extensively in another <a href=\"\">blog</a></em></p>","excerpt":"120,000 years ago - we are apes that lives on trees and so as big serpents..   We have one of the most powerful eyesights in the animal…","fields":{"tagSlugs":["/tags/creating-art/","/tags/biology/","/tags/primatology/","/tags/blog/"]},"frontmatter":{"title":"Serpents","tags":["creating-art","biology","primatology","blog"],"date":"September 04, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/Serpents/"}}