{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<p><em>Chasing the impossible creates opportunities for learning what is possible.</em></p>\n<p>Impossible dreams (good or bad) allowed human curiosity to become reality and thus create the world we live in today..The past truly determines the future and we should continue to push our way to trying new things to be able to learn new things in the process.</p>\n<p>What did I did learn trying to do seemingly impossible projects?</p>\n<ul>\n<li>Discovered my fascination on a bunch of topics like culture, history, economics, ecology, climate science, astronomy, physics, philosophy, blockchain and web development… learning is the ultimate superpower. </li>\n<li>Money is one of the most powerful inventions ever made, possibly bigger than internet. It allowed any concept to become quantifiable..even humans most of the time are measured by the amount of money they have in the bank..</li>\n<li>We all came from stardust. All the things your eyes can capture, animals, plants, rocks, oceans, cars..everything came from a dead star about 4.657 billion years ago.  </li>\n<li>The ability of modern science to unravel the truths. From how our brain works to how electricity is being created and gets transferred to your smartphone..yes science knows it.</li>\n<li>Our brain is a poor tool for success and a great tool for survival.</li>\n<li>Television and smartphone are the worst inventions. They eat all of our time that could be spent to books, planting trees, getting sleep.. or even the basic human activity called “thinking”. </li>\n<li>Opinions and decisions change in the light of new information. It is best to let go of unproductive pursuits the fastest time possible.</li>\n<li>It is humbling to understand how we (humans) were built by a never ending cycle of evolution the past 3.5 to 4 billion years ago…and five mass extinction events.</li>\n<li>We are currently creating the 6th mass extinction event through our use of plastics and fossil fuels.</li>\n<li>All religious dogmas are created by humans. </li>\n<li>The natural world governs tried and tested concepts if one would like to take a peak into what will happen to the future.</li>\n</ul>\n<p>There is value in being bold, unfortunately it is counter-intuitive to think like this as most will choose a comfortable path to life.. </p>\n<p><em>Fear and pursuit of comfort have killed too much dreams, probably more than all the deaths caused by wars and epidemics combined..</em></p>","excerpt":"Chasing the impossible creates opportunities for learning what is possible. Impossible dreams (good or bad) allowed human curiosity to…","fields":{"tagSlugs":["/tags/personal/"]},"frontmatter":{"title":"Why try to make the world better?","tags":["personal"],"date":"November 13, 2018"}}},"pageContext":{"slug":"/undefined/"}}