{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<br/>\t\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/60153e0e62d05a016dfdee413c1cc744/382a8/miguel.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 49.89939637826962%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAKABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAQBAwX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHdUYrGSQ//xAAbEAACAQUAAAAAAAAAAAAAAAABAgMAEBESMv/aAAgBAQABBQJjhY2O1ScG3//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABoQAAICAwAAAAAAAAAAAAAAAAABEBECIXH/2gAIAQEABj8CYtUqhmPY/8QAGxABAAICAwAAAAAAAAAAAAAAARARQVEAITH/2gAIAQEAAT8hZR7WeMbGI7ndCusf/9oADAMBAAIAAwAAABBjD//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8QP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8QP//EABwQAAICAgMAAAAAAAAAAAAAAAERACEQQaHB4f/aAAgBAQABPxBSaU0cYyYUF+e8cSCDATGVusf/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"miguel\"\n        title=\"\"\n        src=\"/static/60153e0e62d05a016dfdee413c1cc744/4b3ab/miguel.jpg\"\n        srcset=\"/static/60153e0e62d05a016dfdee413c1cc744/f8bb1/miguel.jpg 148w,\n/static/60153e0e62d05a016dfdee413c1cc744/900ac/miguel.jpg 295w,\n/static/60153e0e62d05a016dfdee413c1cc744/4b3ab/miguel.jpg 590w,\n/static/60153e0e62d05a016dfdee413c1cc744/78641/miguel.jpg 885w,\n/static/60153e0e62d05a016dfdee413c1cc744/382a8/miguel.jpg 994w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Pursuing the meaning of life was a constant problem that I was trying to solve, I thought the answers were either getting absolute “peace” or creating projects out of “passion”. In the process of it, I experimented with a lot of learning techniques and partnerships in pursuit of enterepreneurship but unfortunately, it came to a point that I hit the walls. That lead me to rethinking the whole process again. Then Dr. Jordan B. Peterson’s <a href=\"\">discussion on responsibility</a> gave a new impression on cracking the code of this predicament - the responsible individual trumps the passionate ones..</p>\n<p>At an early age, I somewhat accepted that people’s journeys are very different. There is no one size fits all. The problem with my way of thinking at the time or even as an adult is I do things without proper philosphical foundation for my decisions. I tend to do things in a haphazard way…</p>\n<p>I have been responsible enough for my actions for most of my adult life. I’ve been into relationships with women that I thought that I would marry but ended up not getting to and I took responsibility for everything (predominantly at most are bad) that I can absorb. I have been entangled in entrepreneurial pursuits and manage all sorts of deals along with it. I have been truthful in every single word that I say and it reciprocated with the authentic responses from people - business partners, workers, creditors and potential investors. Living with words truthfully lets one navigate the good, the bad and the ugly. I took responsibility for being the head of the family for my mom and my brother after my dad left our family years ago. He’s back with us now but I am still operating my life as the person on top of the curve for putting the food on the plate for the long-term basis. These core principles were my meaning of responsibility at its core.</p>\n<p>The Divine Individual as described by Dr. Jordan B. Peterson is grounded on individual responsibility - which was very different from my way of thinking. By what that means is don’t be a victim, pick yourself up and go set face your own suffering and if you help yourself get better, everybody around you gets better. He further explains that a society filled with responsible people is the strongest, robust enough to cast a shield against the horrors of our past. His obsession to debunking the Nazi and Gulag evil got him to this point that to control mass amounts of people, the power must reside with each person and it shouldn’t reside in a single or few number of individuals.</p>\n<p>He further grounds responsibility as acting it out while keeping in mind that life is a series of games that we have to play. Step by step, each small action we take moves us a little bit upward, and a little bit more, repeating it again and again. He is famously noted for his analogy of cleaning up your room, that starting with the smallest part of your life that you can fix is the one that you start solving which most of the case is the environment around us, may it be your room or office.</p>\n<p>Another idea that grounds The divine individual is that “all human life has intrinsic value”. I have found out that this is a very daunting and worthwile chase to extend another generation of science, technology and values. This in effect my next task transcend this message in my life. I think it will start with my relationships - my wife, friends and co-workers for now, maybe in the future are bigger sets of groups people. </p>\n<p>I am taking little steps, as little as possible.</p>\n<p>But first I got to find her first..big task I believe. I’m expecting my OEC today that will finalize my tickets to Cayman Islands. I just really hope that she is there in KY.:-)</p>","excerpt":"Pursuing the meaning of life was a constant problem that I was trying to solve, I thought the answers were either getting absolute “peace…","fields":{"tagSlugs":["/tags/jordan-b-peterson/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Responsibility","tags":["Jordan B. Peterson","creating-art","blog"],"date":"March 21, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/responsibility/"}}