{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>I took myself to different routes since January 2017 right after leaving Dubai which kicked off my partial South-East Asian backpacking trip for approximately 5 months and lived in Calibangbangan Island for a year and six months before learning javascript for eight months and now have four and a half months in Cayman Islands. Pretty much that sentence is an abreviation of a much more dense collection of experiences between having the extreme highs and lows of life (so far)… I have met the best and worst people and no regrets on those events, depression and stress came to picture and then after great passion for solving problems - even extreme difficult ones have propelled me and my most primed state as I’m more knowledgeable (I do not claim to know everything as even physicists would tell you that what we know in the universe composes only of <a href=\"https://tech-stoic.github.io/bloody-physics\">5%</a>), in grasp with fundamental truths (proven to be useful especially extreme cases..), healthy and has the capacity to experiment.</p>\n<p>That first paragraph was dense. So dense that flashbacks of memories have gazed parts of my occipital lobe as I write the letters or rather say input codes to my blog engine through frameworks in gatsby, react and node. I sound too technical but that is a truthful description of what I am doing currently. It will feel cracky while reading this, especially those that have no idea what programming is but I’d rather say what I mean to say than hide it or rewriting the truth in a less direct and unnatural to my way of comunicating.</p>\n<p>This is a blog to summarize the important progress (as shown in the diagram below) of my leap of fate to counter the norm and educate myself in a highly unstructured but effective way. This doesn’t mean that I’m highly reliant to the advantages of the modern world like the internet and online courses… but I have also invested enough time in living off the grid in Linapacan, no electricity and no modern water supply system involved for a year and six months.. The courage to experiment could have been my catalyst for this.. I have not taken any psychological tests or consultation as of late but what I could describe as being knowledgeable to the field is my innate strength of will to experiment is quite different than the average person.</p>\n<p>Curiosity have gave me a path away from insanity as writing and creating art became a developmental tool to sanity. The phrase “curiosity killed a cat” is a sure constant as most revolutionary, creative and inventors in history where killed by tyrannical powers because they give a path to another view of reality - especially as most of them spoke the truth which kings and dictators hate. The hate of competence still exist today as some of my conversations become contentious or offensive whenever I touchfundamental concepts that are foundational to most people (eg. religion, professions, diet, health and exercise and much more). </p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/e471ff2ee8d0bbd2366f27b8a48d2ddb/a9e20/educationdiagram.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 83.14833501513623%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAARABQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAIDBAX/xAAWAQEBAQAAAAAAAAAAAAAAAAABAwL/2gAMAwEAAhADEAAAAetG/HB6CCxZlA0jT//EAB0QAAIBBAMAAAAAAAAAAAAAAAACAQMQESESMjP/2gAIAQEAAQUCqTtGxZ15G4E6jeh//8QAFREBAQAAAAAAAAAAAAAAAAAAESD/2gAIAQMBAT8BY//EABcRAQEBAQAAAAAAAAAAAAAAAAECEBH/2gAIAQIBAT8BRK7lZ//EABkQAAEFAAAAAAAAAAAAAAAAABEAARAgIf/aAAgBAQAGPwIITjV//8QAGhABAAMBAQEAAAAAAAAAAAAAAQAQETFBYf/aAAgBAQABPyFe2E3KXKEffIQAh2uNf//aAAwDAQACAAMAAAAQ6yB8/8QAFhEBAQEAAAAAAAAAAAAAAAAAARAR/9oACAEDAQE/EEZkZ//EABkRAAIDAQAAAAAAAAAAAAAAAAABEBEhMf/aAAgBAgEBPxDeBO0cR//EAB0QAQEAAgIDAQAAAAAAAAAAAAERACEQUTFBcaH/2gAIAQEAAT8QklAX7cNQd/IOCII0febPZGjADoDTZkhxdzrj9px//9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"educationdiagramsofar\"\n        title=\"\"\n        src=\"/static/e471ff2ee8d0bbd2366f27b8a48d2ddb/c739e/educationdiagram.jpg\"\n        srcset=\"/static/e471ff2ee8d0bbd2366f27b8a48d2ddb/8ee9c/educationdiagram.jpg 148w,\n/static/e471ff2ee8d0bbd2366f27b8a48d2ddb/ebbe7/educationdiagram.jpg 295w,\n/static/e471ff2ee8d0bbd2366f27b8a48d2ddb/c739e/educationdiagram.jpg 590w,\n/static/e471ff2ee8d0bbd2366f27b8a48d2ddb/5413e/educationdiagram.jpg 885w,\n/static/e471ff2ee8d0bbd2366f27b8a48d2ddb/a9e20/educationdiagram.jpg 991w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>This is how I try to filter the world’s chaotic nature - a number of disciplines / science (not only one) should be able to fit an idea and break it to sizeable bits of digestible puzzle pieces that eventually will reveal themselves if its going to be a good or bad one to consume further. </p>\n<p>Like my blog <a href=\"https://tech-stoic.github.io/integral-thinking/\">integral thinking</a>, I would need to keep on editing this… as the concept of teaching yourself lasts forever. As I ascend to newer landscapes like: migrating to Canada, becoming a parent or properly learning the guitar and music - these experiences will definitely push me to newer heights of curiosity and will continue to create the positive feedback loop. The coding profession continues to baffle me and that is another big thing I’m trying to decode within my cognitive ability.</p>\n<p>For now.. life is so good and there is no reason to stop creating art and blogs about how beautiful and remarkable living in the 20th century is.</p>","excerpt":"I took myself to different routes since January 2017 right after leaving Dubai which kicked off my partial South-East Asian backpacking trip…","fields":{"tagSlugs":["/tags/creating-art/","/tags/psychology/","/tags/blog/","/tags/projects/"]},"frontmatter":{"title":"Pillars of Knowledge","tags":["creating-art","psychology","blog","projects"],"date":"August 18, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/undefined/"}}