{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<br/>\n<p><img src=\"blackhole.jpg\" alt=\"blackhole\"></p>\n<p><strong><em>I did ask one cool girl to put a black hole tattoo in my shoulders..</em></strong> </p>\n<p><em>What a great way to write this blog while listening (half-watching) Dr. Neil de Grasse-Tyson’s <a href=\"\">podcast #1347</a> with Joe Rogan at JRE experience. Dr. Neil basically allowed me a gateway (my desire to learn a lot about climate change) to realizing how to comprehend the world we so love and treasure through scientific lenses. I loved Crash Course Astronomy by Phil where he enumerated what our current technology was able to uncover. I love the topic of the the <a href=\"\">doppler effect</a>  where I always try to apply when cycling here in Cayman, making me more aware of my surroundings through recognizing how sounds created by engines of vehicles vary as they come near me, very useful in tight roads where ten to twelve wheeler trucks pass by..</em></p>\n<p><em>Physics is the science on how the physical world works. This is a foundational science to all fields of expertiese. This made me grip reality at its truest form, connect a lot of what I try to learn and be think more clearer sets of actions. Keto, Cycling, Bilogy and even computer coding are well grounded on equations derived from a physics standpoint.</em> </p>\n<p><em>It is clear to me that there is no better way of approaching big problems through physics. Climate change is physics, blockchain needs a lot of electricity where physics again exists, plastics are developed through chemistry where is grounded in a lot of physics. Biology is chemistry, again grounded in physics and the main power source of our solar system - have been understood through the likes of Einstein, Copernicus, Newton through bloody physics.</em></p>\n<p>There is no escaping bloody physics. Life exists through a great deal of physics concepts - the electro magnetic field that shields us from cosmic rays, the ozone layer that shields us from 99% of ultraviolet rays, water that pass through our waterlines because of pressure, the air we breath is a mixture of oxygen and nitrogen, photosynthesis creates grasses for the cows to eat, we use fossil fuels to cook our food, we love because of hormones running in our bloodstream, we die because our homeostasis is not okay anymore - every single thing in this crazy good universe are connected in some way - it is so freaking awesome to atleast know enough about how everything literally works.</p>\n<p>PS. I believe I will not get my tattoo anymore. Also, it will be a pain in the ass for her to do it of which I’m not comfortable of.</p>","excerpt":"I did ask one cool girl to put a black hole tattoo in my shoulders..   What a great way to write this blog while listening (half-watching…","fields":{"tagSlugs":["/tags/creating-art/","/tags/philosophy/","/tags/blog/"]},"frontmatter":{"title":"Minimalism","tags":["creating-art","philosophy","blog"],"date":"September 08, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/minimalism/"}}