{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/bbbe2f693c4d6f906e5cd8d4ff095642/14c07/capitalismhasitsflaws.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 58.06451612903225%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAMABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAIEAwX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHsqmZUQh//xAAZEAEAAwEBAAAAAAAAAAAAAAABAAIRAxP/2gAIAQEAAQUCvoHSehC7i7Gf/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAFhAAAwAAAAAAAAAAAAAAAAAAAAEg/9oACAEBAAY/AhT/AP/EABoQAQADAQEBAAAAAAAAAAAAAAEAESExYZH/2gAIAQEAAT8hYEF05BS2XPWUxkocPktfWf/aAAwDAQACAAMAAAAQkA//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/ED//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/ED//xAAbEAEBAAMBAQEAAAAAAAAAAAABEQAhMWFBsf/aAAgBAQABPxAyuIjj38xRoJH66PMlpFO6c5ghOY4iMsgMfVPVuf/Z'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"capitalismhasitsflaws\"\n        title=\"\"\n        src=\"/static/bbbe2f693c4d6f906e5cd8d4ff095642/4b3ab/capitalismhasitsflaws.jpg\"\n        srcset=\"/static/bbbe2f693c4d6f906e5cd8d4ff095642/f8bb1/capitalismhasitsflaws.jpg 148w,\n/static/bbbe2f693c4d6f906e5cd8d4ff095642/900ac/capitalismhasitsflaws.jpg 295w,\n/static/bbbe2f693c4d6f906e5cd8d4ff095642/4b3ab/capitalismhasitsflaws.jpg 590w,\n/static/bbbe2f693c4d6f906e5cd8d4ff095642/78641/capitalismhasitsflaws.jpg 885w,\n/static/bbbe2f693c4d6f906e5cd8d4ff095642/14c07/capitalismhasitsflaws.jpg 899w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p><b>Again.. stress alert.. do not read this if you have significant depressive states.. you have been warned</b></p>\n<p>Don’t get me wrong. I love capitalism. I enjoy the benefits of a society built by talents, education, tech and progress coming from enterepreneural pursuits. Never in our lifetime have existed 7.7 billion people that can enjoy the resources of this planet and harness it to improve our living standards without the threat of war. It is truly amazing to live in this moment. Even a guy like me can learn about anything, use rectangular boxes called computers to code and communicate information through websites and publish it through servers and making it accessible through smart devices within a few clicks. </p>\n<p>But yet I have fears that capitalism is the way forward into the future. Eventhough our civilization’s best attributes are built on this concept, I still see its flaws now revealing itself. It is truly scary but enlightening at the same time.</p>\n<p>My firsthand experience with capitalism in Africa is not my best performance as a human being. I’m not proud of helping a governmnent official steal oil from his country’s public resources and transfer it to his personal business. I would not specifically name who is the people involved to promote safety of others still working with them. Capitalism became a way wherein corruption got out of hand all over the world. Even in the Philippines, the main source of all evil and poor progress is - yes, corruption.</p>\n<p>Capitalism enabled tax evasion strategies. Transfering wealth in various tax havens all around the world became a mechanism for rich heads of states to filter out significant funds that they have earned or stole from their countries. This money could have been used to improve third world economies but instead pooled out of their countries for personal gain.</p>\n<p>Capitalism also have introduced social media wherein everyone created a web of information that seems to be reality. Most people get their knowledge from Facebook, Twitter &#x26; Instagram  and what is scary is that data in these platforms are largely unverified.</p>\n<p>Capitalism also hides the layers of history. It is so easy to believe for the younger generations that the world is a static ball of happiness and abundance. The age of our specie is around 250,000 years and the age of stability that we currently have is just 50 years!!!</p>\n<p>Lastly, capitalism paved way for these particular events wherein Exxon Mobil and Shell executives hid the <a href=\"https://www.theguardian.com/environment/climate-consensus-97-per-cent/2018/sep/19/shell-and-exxons-secret-1980s-climate-change-warnings\">devastating effects of fossil fuel use</a> and thus increasing human caused global warming and climate changes. The effects of <a href=\"https://www.scientificamerican.com/article/exxon-knew-about-climate-change-almost-40-years-ago/\">one single memo</a> produced by the executives of this company is so catasthropic that it will change the path of history forever. This is a <a href=\"https://www.youtube.com/watch?v=TbW_1MtC2So\">video</a> on how we got in these mess we are in.</p>\n<p>I overused the word capitalism here because I’m trying to paint a picture that this is so far the best that our society have produced to harness our human capabilities and solve our daily struggles - but its not even perfect at all. Capitalism goes deep, because of the freedom it allows people to create virtually anything. But the downside of it is it doesn’t factor nature - resources and negative impact and also it shows how exposed we are from insidious desires of the few to manipulate the future for personal gain.</p>\n<p>Civilization is continously transforming itself and we might be in a time that we need to improve the way we operate virtually everything.. </p>","excerpt":"Again.. stress alert.. do not read this if you have significant depressive states.. you have been warned Don’t get me wrong. I love…","fields":{"tagSlugs":["/tags/history/","/tags/creating-art/","/tags/blog/","/tags/climate-change/"]},"frontmatter":{"title":"Capitalism has its flaws","tags":["history","creating-art","blog","climate change"],"date":"March 18, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/capitalism-has-its-flaws/"}}