{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/43c3ebe290be84682958de18b5dbdf3d/fabfa/drjordanbpetersonpart2.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 137.5717017208413%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAcABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAMEAgX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHuIYgtJgXleycA/8QAHBAAAgICAwAAAAAAAAAAAAAAAREAAwIhEjFD/9oACAEBAAEFAsoQoOrDrXEXCNVloywsec//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/AR//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/AR//xAAaEAACAwEBAAAAAAAAAAAAAAAAAQIQETFB/9oACAEBAAY/AjVeI4xb7cWRr//EABsQAQEBAQADAQAAAAAAAAAAAAERACEQMVGB/9oACAEBAAE/IfUrDEKboOInjfuWNIddD0N1lVXS7RHhzVeOV7W/r4//2gAMAwEAAgADAAAAEEAFAP/EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8QH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8QH//EAB0QAQEAAgIDAQAAAAAAAAAAAAERACExQVGR8HH/2gAIAQEAAT8QZKg73LhFsvTcVDlByxiURdZCICnZqe8niRqQcCzUNavxi0ISEa5965zZoeYuAwDxo1irH5cHn9z/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"drjordanbpetersonpart2\"\n        title=\"\"\n        src=\"/static/43c3ebe290be84682958de18b5dbdf3d/c739e/drjordanbpetersonpart2.jpg\"\n        srcset=\"/static/43c3ebe290be84682958de18b5dbdf3d/8ee9c/drjordanbpetersonpart2.jpg 148w,\n/static/43c3ebe290be84682958de18b5dbdf3d/ebbe7/drjordanbpetersonpart2.jpg 295w,\n/static/43c3ebe290be84682958de18b5dbdf3d/c739e/drjordanbpetersonpart2.jpg 590w,\n/static/43c3ebe290be84682958de18b5dbdf3d/5413e/drjordanbpetersonpart2.jpg 885w,\n/static/43c3ebe290be84682958de18b5dbdf3d/fabfa/drjordanbpetersonpart2.jpg 1046w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>This is my second post about Dr. Peterson. If you want to see that short thank you blog and links to his amazing content, please check this <a href=\"https://tech-stoic.github.io//dr-jordan-b-peterson-part-1/\">post.</a></p>\n<p>I had seen our family crash down, experienced the worst with how things can be - like almost dying (twice in a span of 2 years) and even did a project that helped a family in the islands but eventually turned their back on me.. It is clear to me that there is no one size fits all to every situation - good or bad but I was always hitting walls wherein I could not understand reality itself. I knew at the back of my head that there is something wrong with how the universe operates but unfortunately I can’t specifically point out what it is.</p>\n<p>Also, we are currently entering to a new stage of society wherein all of the world’s great treasures are at our access - information, technology, good health.. As younger generations tend to disconnect from bloody history, I wonder what challenges would our generation face that will have significant importance.</p>\n<p>Enter Dr. Jordan B. Peterson..</p>\n<p>If you have watched the movie Avengers: Infinity Wars where this scene wherein Thor came back to earth and <a href=\"https://www.youtube.com/watch?v=k0A5cMcNHs0\">threw his hammer to Thanos</a> and then this villain said “You should have aimed for the head..” - Dr. Peterson quite got me on some level where he have hit the holes in my belief that resides in my head for the past decades.. some even when I was still a child, kind of what Thanos had in mind inorder to stop himself.</p>\n<p>His book <a href=\"https://www.audible.com/pd/12-Rules-for-Life-Audiobook/B0797YBP7N\">12 rules for life: an Antidote to Chaos</a> is a great overarching structure on how one should fortify his belief in life. Believe me, I was that guy who used to think that know everything and have read tremendous amounts of materials regarding self-improvement but after listening to him - I realized that I was just scratching a dust from Disneyland in regards of what is truth and the horizon of potential. </p>\n<p>There is so much seemingly simple things that run our life that is complex enough to deceive us until we die. His arguments lets you in that kind of narrative. Like how some parents are strangling their children’s future through bubble wrapping them from how crazy the world is. As a keen oberver of parenting patterns, this hit home in my beliefs. </p>\n<p>Tell the truth. Even though I try to implement this over the track of my life, unfortunately it is rather difficult to not hurt people as we strive to exist as truthfully as possible. Truth hurts pretty bad. Well, as Dr. Peterson said in an <a href=\"https://www.youtube.com/watch?v=aMcjxSThD54\">interview</a> “In order to be able to think, you’ll have to risk being offensive..” which cuts to what the value of truth in our lives should be - an act of courage to reveal reality..whatever the consequences may be..</p>\n<p>He also speaks from his 30 year tenure as a <a href=\"https://en.wikipedia.org/wiki/Jordan_Peterson\">clinical psychologist and lecturer at the University of Toronto</a> that good and evil resides in all of us. This quite needs an evolutionary perspective to make sense but this topic is so crucial to everyone or rather anyone who likes a stable civilization. In order to manage yourself in difficult situations, you must internalize that you yourself can cause great harm than good. I personally applied this to what happened in Navotac as there is no point in destroying the project because they deceived me in their promises. I thought of the people who depends on the project. Kids that would be hurt if I push through the monster that I can become just to retrieve my investments. </p>\n<p>I’m now listening <a href=\"https://www.amazon.com/Maps-Meaning-Architecture-Jordan-Peterson/dp/0415922224\">Maps of Meaning</a>.. which is his first book that he used to decode how can the horror of the past (Nazi Genocide, Stallin/Gulag) won’t rise to power again. Its quite a strong book to consume because it grounds from a lot of disciplines..mostly psychological, philosophical, historical and religous in context. Still digging with it as of this writing.</p>\n<p>Becoming a good person is tremendously hard.. but with the minds of people like Dr. Peterson things get clearer and complex but rather puts us in a path where the difficult could be achievable.</p>","excerpt":"This is my second post about Dr. Peterson. If you want to see that short thank you blog and links to his amazing content, please check this…","fields":{"tagSlugs":["/tags/jordan-b-peterson/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Dr. Jordan B. Peterson Pt.2","tags":["Jordan B. Peterson","creating-art","blog"],"date":"March 17, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/dr-jordan-b-peterson-part-2/"}}