{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"samurai1.jpg\" alt=\"samurai\"> </p>\n<p><strong><em>Stoic life in the modern world…</em></strong></p>\n<p>I have been developing my stoic practices for maybe roughly three years now and just this year was I really reaping the best and worst of its immersive experience. Scavenging the works of Tim Ferris and Ryan Holiday plus the greek accounts about the life of Marcus Aurelius and bits from Seneca and Epictetus have taken me to a tricky position in most of my social interactions. Stoicism is a foundational frame of thinking yet it really will challenge one who dares to apply it in the modern world. Yes, I did say that I seem invincible through accepting that what I could control is only myself and my response to others’ actions…yet the underlying detail of the before mentioned logic turns every part of my world almost sideways - especially as the average person I encounter even in here in the western world interprets it the other way almost always most of the time. </p>\n<p>The tremendous number of activities that you need to handle with those who doesn’t approach life is so immense. You can really see it in people’s faces that they either they are confused or disoriented from the words I say, especially when it is well grounded in the truth that they failed to realize before coming to me. The only solution I bet on is always telling the truth, while trying to listen to the voices of all and taking into account underlying expressions, gestures of the singular or the collective crowd. </p>\n<p>I’m yet very early in my psychological understanding of the world but it is becoming a tool of my trade in discerning really raw and tough situations. A stoic approaches any situation as competent and adaptive as possible while lending all possible ears, eyes and feelings available. It is so energy intensive so daily exercising and the ketogenic diet is crucial for the tremendous cognitive load. Meditation is losing room in my daily schedule but should take it seriously again as most of my focus is well grounded in this practice. I should really consider taking a vacation from work as well to take a solid time off from the noise of working for somebody other than myself.</p>\n<p>No one can evade pain, hurt, sadness, fatigue, hunger, aging, illnesses, etc. etc. Being human is the necessity to accept and endure suffering. Unfortunately, most people are not fully aware of this conceptual framework…the average person that I normally encounter are more focused on their phones than themselves, social media addicts, brains being squeezed by codes written by the guys working in Silicon Valley.  </p>\n<p>Happiness? Being happy alwways or dealing life with excessive optimism is a form of suffering too.. as no growth will happen in a always zero recogniton of negativity. I often interact with all sorts of people who stops themselves from making a 360 degree analysis of any situation, focusing only on the good and not realizing the bad. Dr. Jordan B. Peterson claims that this types of people are often always victims of those who do more harm with others than good.</p>\n<p>Taking responsibility for my own actions is at the core of stoicism and my daily struggles. Most of the time my intuitive nature of managing tasks becomes a talking point with most of my colleagues - new normal I guess. My personality as an extrovert instinctively kicks in most of the time, as I try to dig the depths of my ability to communicate just to convey a truthful message to most, especially the ones who cares to what I say. Why I often use my time like this? It is a well grounded concept in science that social interactions weave better brain connections.</p>\n<p>Life is suffering and this is one meta-truth that our consciousness have enabled us to experience. Stoicism as explained by Tim Ferriss as an operating system for life is a great structure in establishing a framework for dealing with life and its burdens of which I find to be true after intensely dedicating myself to the craft. </p>\n<p>The burning question now to me is really what’s next? Life is not solving one suffering over the other.. yeah really what is next? I should really dig this big problem more in the coming months.. ^_^</p>","excerpt":"  Stoic life in the modern world… I have been developing my stoic practices for maybe roughly three years now and just this year was I…","fields":{"tagSlugs":["/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"Volunteering","tags":["creating-art","blog"],"date":"October 10, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/volunteering/"}}