{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/81aee0570800f6a6dbb6177ba3ff5af4/e1dea/rose.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 195.45454545454544%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAnABQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAECAwX/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHvozNkCtdKGiBIAP/EABsQAAEEAwAAAAAAAAAAAAAAAAEAEBExAiAh/9oACAEBAAEFAnNDhRWNtEHT/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAwEBPwFf/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAgEBPwFf/8QAFBABAAAAAAAAAAAAAAAAAAAAMP/aAAgBAQAGPwJ//8QAHBAAAQQDAQAAAAAAAAAAAAAAAQAQETEgIUFR/9oACAEBAAE/IXGbQvRxqqE2KG6O3j//2gAMAwEAAgADAAAAENDIDAAP/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAwEBPxBf/8QAFBEBAAAAAAAAAAAAAAAAAAAAIP/aAAgBAgEBPxBf/8QAHBABAAICAwEAAAAAAAAAAAAAAREhABAgUWGx/9oACAEBAAE/ENsgL0YURSND3Rm5WBuMoEKzBqUVkF3D64//2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"rose\"\n        title=\"\"\n        src=\"/static/81aee0570800f6a6dbb6177ba3ff5af4/c739e/rose.jpg\"\n        srcset=\"/static/81aee0570800f6a6dbb6177ba3ff5af4/8ee9c/rose.jpg 148w,\n/static/81aee0570800f6a6dbb6177ba3ff5af4/ebbe7/rose.jpg 295w,\n/static/81aee0570800f6a6dbb6177ba3ff5af4/c739e/rose.jpg 590w,\n/static/81aee0570800f6a6dbb6177ba3ff5af4/e1dea/rose.jpg 616w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>I have reflected a lot for quite a while on what I can say to you as of the moment, I hope you would hear me out.</p>\n<p>I thought I would be okay if I were to die now, nextweek, tomorrow - anytime. I thought I was okay. Why? I had a great run! I did all the things I want whenever I want it while trying to stay truthful to myself and the people I interact with. I have traveled so much in my life, helped people in need. No regrets at all. </p>\n<p>I did the best life ever that I could, it was a good 33 years run. I bakpacked Thailand-Vietnam-Malaysia &#x26; Philippines and met the most amazing people. Most people from my country could’nt afford what I have done and for that I’m so grateful of the the opportunities that rain on me time and time again.</p>\n<p>I have crashed and burn after Navotac. A drastic shift in my paradigm occured as I became more inclined into learning more about how our human mind works as I have tasted true maelovence in this chapter of my life and refocused my views on living as educated and truthful as possible.</p>\n<p>I have been blessed along the way to learn from people (even from the interweb) and including words of advice from great philosphers through authors that invested to dissipate the truths of our existence. Deep diving the science of everything, from the atoms to the stars, the corals and the galaxies…I learned everything I could just to become better at articulating deep problems. I always say to my peers in Salty’s (the Badgers!!!) that it’s either its a serious or depressing talk is always my point of discussion. I’m sure you’ll find me to cracky most of the time.</p>\n<p>I am at my healthiest state: mind, body and spirit. Built foundational skills that bring me top shape. More grateful and respectful in most of the frailities of human interaction. I rarely get mad…after understanding that all of us make mistakes, and our subjected to biological weaknesses…it’s just unfortunate that most do not know neuroscience, as it could be a game changer for our species.</p>\n<p>I did a lot of mistakes along the way and have wronged people in the process, helped a corrupt family keep destroying a nation and lied quite a lot. I’m no saint, there are things that I have been involved and I will never be proud of those times..ever.</p>\n<p>All the material cravings went away after fostering stoic values. I always try to control myself and not the difficulties of others. This is a lifelong pursuit and hope that you would understand my decisions in the future.</p>\n<p>Now I’m sure I would like to live… because I want to meet you. This I believe is the only remaining chase I’m striving for..to find you and build a future with you. If I were to die tomorrow, I would be fucking pissed of fate if we never got the chance.</p>","excerpt":"I have reflected a lot for quite a while on what I can say to you as of the moment, I hope you would hear me out. I thought I would be okay…","fields":{"tagSlugs":["/tags/creating-art/","/tags/personal/","/tags/blog/"]},"frontmatter":{"title":"Letter to my future wife","tags":["creating-art","personal","blog"],"date":"August 09, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/letter-to-my-future-wife/"}}