{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><strong><em>I rattled out while trying how alpha males do it in the gun range..</em></strong></p>\n<p>I would have to get to doing some single session training on my own especially how to do the sequence of shoot-reload-shoot again. There is a big getting used to track thing as it is very difficult to do dry run in Cayman Islands as the law prohibits the purchase guns and even of airsoft guns. Yeah I know that it takes time learn especially precision shooting but yeah I’m taking more focus to watch more training videos and do alot of practices in the range. I rattled out because my body is not in sync with the proper reload demo and how to reposition the arm after the reload. That is key to making a great result to doing drills in the range. Well I just have to deploy focus and a lot of patience to get things going. </p>\n<p>Sequencing is a good thing to analyze when you try to check on how one’s autonomous actions playout in their responses. Like what I did in the timed de-facto black badge drill - I shot well for a newbie in the first circle but lost the next circles because I do not know how to reload properly and my quickness in my actions caused my brain to stop thinking properly. Mr. Joey is telling me I’m shooting too fast. I honestly do not see that I’m shooting fast. I can review in my mind each mistake and reload. Well, perks of doing the triad of meditation, ketogenic diet and exercising.</p>\n<p>The harshest critic of myslelf should be me. Only I can make the changes necessary to progress in any kind of pursuit - I might have only focused on my shooting session this Saturday but it applies to alot of discipline. Intently reviewing my actions favored to me alot in my professional practice in our company as it is rather very easy to react with a truthful answer. I believe ultimately, my meditation practice helps me a lot here. Well, I should be more consistent with my meditation sessions. Note to myself.^_^</p>","excerpt":"I rattled out while trying how alpha males do it in the gun range.. I would have to get to doing some single session training on my own…","fields":{"tagSlugs":["/tags/psychology/","/tags/blog/"]},"frontmatter":{"title":"Sequencing","tags":["psychology","blog"],"date":"December 22, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/sequencing/"}}