{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>A core concept in stoic philosophy which is to “accept what we cannot control”. A number of significant processes that exists in our world and the universe is constantly including us in the mix and I always take solitude in accepting that it is what it is.</p>\n<p>Death. There is no escaping the dying off of our cells and reaching the limit of our ability to consume energy and oxygen. It is a fact that our DNA has a clock that started when we were conceived as a fetus and it is ticking up until our body reaches some biologically predetermined years. </p>\n<p>Entropy. A physics concept that engulf all forms of animate and inanimate things in the universe where all are destined to dissipate. This concept explains the mass of heavenly bodies, gravity, blackholes (in some degree) etc.</p>\n<p>Pollution. How hard I try to minimize the amount of garbage that I create, I find it that our modern world is predicated on abundance of technology and its by-product cannot be disassociated as of the moment. One of the great challenges of our generation is to develop a more sustainable world as Earth is yet the only existing planet in the whole universe that we know of that can harbor dynamic forms of life. Our science is still incapable of solving this very complicated experiment at scale especially as 3 billion chinese and indians are primed for massive consumption in the coming decades.</p>\n<p>Social Media. Everyone is a media company nowadays. I for one have decided to remove myself from the loop but I feel to be still connected somehow as 99% of the people I interact with are still using all dominant platforms. This experiment baffles a lot of psychologists as it instigates non-natural responses, making our primal nature stand into unthreaded waters. We have yet to see the significant effects off too much social connection.</p>\n<p>Natural Selection. I find it very hard to accept that our species are becoming weaker on the average if we are going to talk about this topic. The current state of consumption of sugar, alcohol and poor motor habits are coding our genes to become less and less more adaptive to the natural world. The birth control pill have also allowed our species to use sex as a tool for pleasure and not to propagate. </p>\n<p>Artificial Intelligence. This one needs a bit of technical ability to digest. Though jobs have change drastically in the last 100 years (women now can work extensively till their late 40s), the significant changes that robots will create in society in the near future is so immense that we are threatening our stability now in the western world. Universal basic income is a hot topic as of late to counter this but the concept of it goes against the very concept of why jobs are significant to us - as it gives the average person the meaning of existence. </p>","excerpt":"A core concept in stoic philosophy which is to “accept what we cannot control”. A number of significant processes that exists in our world…","fields":{"tagSlugs":["/tags/creating-art/","/tags/philosophy/","/tags/blog/","/tags/projects/"]},"frontmatter":{"title":"What we will not evade","tags":["creating-art","philosophy","blog","projects"],"date":"August 21, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/unavoidable-circumstances/"}}