{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<img src=\"dopmine (2).jpg\" alt=\"dopmine\" width=\"200px\" />\n<br>\n<p>Our body’s reward system is fueled by the chemical bond dopamine. Whatever you desire in life is accomplished by running tons of this neurotransmitter in our bloodstream, causing our brain to make well grounded decisions and coordinates our body to accomplish each step needed. </p>\n<!-- \nThese concepts that I try to layout in this blog seems so hard to believe for most.  -->\n<p>It’s rather very difficult to explain how our mind works, it gets too technical and challenges most as people who truly understand the concept of natural selection is very rare. But okay, I’ll try to describe it in my own experience..</p>\n<img src=\"dopmine (1).jpg\" alt=\"dopmine\" width=\"700px\" />\n<br>\n<p>Dopamine should be utilized all the time as it helps us create synergy with our body and mind, the best state of health that we can ever have. Cycling around Cayman Islands is helping me increase my cardiovascular capacity, feeling lesser and lesser fatigue. Blogging continues to increase my understanding of myself and the world. Coding websites allows me to think properly and resolve  problems I encounter at work much better (I’m an Accountant). Learning how to play the guitar and how <a href=\"https://en.m.wikipedia.org/wiki/Doppler_effect\">doppler effect</a> work helps me to increase my awareness in my surroundings while riding my bicycle to work. </p>\n<p>The positive effects of dopamine is endless. I truly believe that the more you interact with different genres and disciplines - will help your body code new abilities that you will never have if you choose to just focus on one skillset. </p>\n<p>PS>>>\nI was too busy the past 20 days because of work and most of my freetime were dedicated to turnovers from outgoing colleagues as well as going out with them (lots of drinking and karaoke nights!), RollMaster training and cycling. Most of the time whenever I think I’m slacking, I just grab the bicycle and ride it to places…Hmmmm Haven’t decided on what hormone should I discuss next in this blog…</p>","excerpt":"Our body’s reward system is fueled by the chemical bond dopamine. Whatever you desire in life is accomplished by running tons of this…","fields":{"tagSlugs":["/tags/health-fitness/","/tags/creating-art/","/tags/blog/"]},"frontmatter":{"title":"short update blog","tags":["health & fitness","creating-art","blog"],"date":"June 09, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/short-update-blog/"}}