{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/ede83e12af3310aaea8dc2c2bf998d34/c2aaa/bots.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 121.9116321009919%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAYABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAEDBf/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIQAxAAAAHswjVBcQ2B/8QAGRAAAgMBAAAAAAAAAAAAAAAAAQIAEBES/9oACAEBAAEFAmYrA+0wgvltn//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8BH//EABkQAAIDAQAAAAAAAAAAAAAAABAhAAIxMv/aAAgBAQAGPwLFGjyVYf/EABwQAAICAwEBAAAAAAAAAAAAAAABESExQVEQcf/aAAgBAQABPyGwv1IvA/GRxPxFt566FO1A7RmwLgsH/9oADAMBAAIAAwAAABD76L7/xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAEDAQE/EB//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/EB//xAAdEAEAAgEFAQAAAAAAAAAAAAABABExIUFRkaGB/9oACAEBAAE/EOsZh5Bi1ecdwRLMMJdRsEtSNWtKlosxI9SMAg4YlSXbF0+uYEAqvLvP/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"bots\"\n        title=\"\"\n        src=\"/static/ede83e12af3310aaea8dc2c2bf998d34/c739e/bots.jpg\"\n        srcset=\"/static/ede83e12af3310aaea8dc2c2bf998d34/8ee9c/bots.jpg 148w,\n/static/ede83e12af3310aaea8dc2c2bf998d34/ebbe7/bots.jpg 295w,\n/static/ede83e12af3310aaea8dc2c2bf998d34/c739e/bots.jpg 590w,\n/static/ede83e12af3310aaea8dc2c2bf998d34/5413e/bots.jpg 885w,\n/static/ede83e12af3310aaea8dc2c2bf998d34/c2aaa/bots.jpg 1109w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Zeroes and ones.. It’s hard to believe that the modern world we live in now is built by this two binary digits..</p>\n<p>One valuable use of code is making repeatitive tasks loop so you do not have to do them again and again. I am currently now tackling a project (I cannot say the fine details) for my boss that does that - outsource tasks to computers. It solves a few headaches for customers and the team and would give us more time to focus on the right problems to solve.</p>\n<p>I want to emphasize in this post that this project is rather composed of less than a megabyte of data to complete with a fair bit amount of time to construct the logic and extensive testing plus coordination to proper departments. Small snippets of codes that I call “bots”. Bots are all over our smartphones through notifications, handling our credit card information, chats to our best friends… it’s just the gifts of tech where we are in a time where moore’s law is being maximized more and more - even me an accountant have deep dived this unprecedented opportunity of our times to code solutions for some routinary computerized tasks and make art just like this blog.</p>\n<p>What I’m contemplating always about bots is it’s asynchronous capabilities - codes that run in the background that no one ever sees, hiding from the GUI (graphical user interface) of any device or platform you are using. This type of codes are doing stuff that do not reveal themselves to ordinary users. A good example for this is what have happened to last US elections where Russia paid alot of ads through facebook just to push Trump’s campaign. How futile that another nation can invest in chaos codes that push wrongful information to affect the minds of hundreds of millions. Insidous at it may sound, bots are worth contemplating about but it’s just so hard to defend ourselves from it. I did shutdown my social media platforms but still use amazon to buy stuff -consequently lending some of my vital information. Google is feeding itself all of our searches - it knows what we seek, love or hate… we are powering it to access to all our data. It gets creepy as to how these tech giants have power over all of our information - literally.</p>\n<p>This is just the reality of this mega experiment that is folding our minds to places we have not yet tackled as a species, still unfolding its pages at a very rapid phase - probably at lightspeed so our brains even combined at this state of our evolution won’t be able to comprehend what all of these codes are doing. We still have </p>","excerpt":"Zeroes and ones.. It’s hard to believe that the modern world we live in now is built by this two binary digits.. One valuable use of code is…","fields":{"tagSlugs":["/tags/creating-art/","/tags/personal/","/tags/blog/","/tags/code/","/tags/projects/"]},"frontmatter":{"title":"Bots","tags":["creating-art","personal","blog","code","projects"],"date":"August 14, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/bots/"}}