{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Philippines"}},"markdownRemark":{"html":"<p><img src=\"educationdiagramsofar.jpg\" alt=\"educationdiagramsofar\"></p>\n<p>I took myself to different routes since January 2017 right after leaving Dubai which kicked off my partial South-East Asian backpacking trip for approximately 5 months and lived in Calibangbangan Island for a year and six months before learning javascript for eight months and now have four and a half months in Cayman Islands. Pretty much that sentence is an abreviation of a much more dense collection of experiences between having the extreme highs and lows of life (so far)… I have met the best and worst people and no regrets on those events, depression and stress came to picture and then after great passion for solving problems - even extreme difficult ones have propelled me and my most primed state as I’m more knowledgeable (I do not claim to know everything as even physicists would tell you that what we know in the universe composes only of <a href=\"https://tech-stoic.github.io/bloody-physics\">5%</a>), in grasp with fundamental truths (proven to be useful especially extreme cases..), healthy and has the capacity to experiment.</p>\n<p>That first paragraph was dense. So dense that flashbacks of memories have gazed parts of my occipital lobe as I write the letters or rather say input codes to my blog engine through frameworks in gatsby, react and node. I sound too technical but that is a truthful description of what I am doing currently. It will feel cracky while reading this, especially those that have no idea what programming is but I’d rather say what I mean to say than hide it or rewriting the truth in a less direct and unnatural to my way of comunicating.</p>\n<p>This is a blog to summarize the important progress (as shown in the diagram below) of my leap of fate to counter the norm and educate myself in a highly unstructured but effective way. This doesn’t mean that I’m highly reliant to the advantages of the modern world like the internet and online courses… but I have also invested enough time in living off the grid in Linapacan, no electricity and no modern water supply system involved for a year and six months.. The courage to experiment could have been my catalyst for this.. I have not taken any psychological tests or consultation as of late but what I could describe as being knowledgeable to the field is my innate strength of will to experiment is quite different than the average person.</p>\n<p>Curiosity have gave me a path away from insanity as writing and creating art became a developmental tool to sanity. The phrase “curiosity killed a cat” is a sure constant as most revolutionary, creative and inventors in history where killed by tyrannical powers because they give a path to another view of reality -especially as most of them spoke the truth which kings and dictators hate.</p>","excerpt":"I took myself to different routes since January 2017 right after leaving Dubai which kicked off my partial South-East Asian backpacking trip…","fields":{"tagSlugs":["/tags/creating-art/","/tags/psychology/","/tags/blog/","/tags/projects/"]},"frontmatter":{"title":"Self education - progress of my curiosity..","tags":["creating-art","psychology","blog","projects"],"date":"August 18, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/undefined/"}}