{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<img src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxg_tJ-doXOCuwxa0Wpvtb2bcZK3sjDJJrSiobuJfU8NvxlZse\" alt=\"habits\" style=\"width: 700px\">\n<p>Forming a habit is one of the easiest thing to mess up in our lives. Our bias is part of human nature and cannot be easily scrapped out of our decision making, most especially when we are wired not to evaluate ourselves which is impactful in the way we do things on a regular basis.</p>\n<p>Self-awareness is not on the radar of everyone, corrupt government and media tells you what to do in life. The human brain gets easily gets stressed of bad news, releasing tons of cortisol to the blood stream, immersing our body to the feeling of uneasiness. Then we get easily attracted to doing the easy stuff. Reading / liking social media posts, watching netflix or more depressing news and gossiping are few of the examples of impulsive actions most take. This becomes a positive feedback loop, releasing more cortisol and the cycle repeats.</p>\n<p>Bad habits are intertwined as “normal things to do”. I lived in the islands before and it was easy for them to receive money from politicians in exchange of votes. More and more people become obese. Free will is not true. The environment we live in determine the preconditions of our mindset. This includes social media, television, and even your friends have a direct influence in what you do. It became the norm for them. It became their reality. Corruption became accepted as a way of life.</p>\n<p>Even though we feel that our decision is our own, it is not our own..it is rather heavily relying on our emotions… emotions that are driven by necessity.. needs that where dependent of our environment.. I guess I was lucky in a way. My family problems caused me to think very independently, asking more questions than the average person. Struggling to come up with your own decision became a </p>","excerpt":"Forming a habit is one of the easiest thing to mess up in our lives. Our bias is part of human nature and cannot be easily scrapped out of…","fields":{"tagSlugs":["/tags/personal/"]},"frontmatter":{"title":"habits","tags":["personal"],"date":"Invalid date"}}},"pageContext":{"slug":"/Forming-Habits/"}}