{"data":{"site":{"siteMetadata":{"author":"Miguel de Guzman","homeCity":"Bulacan, Philippines"}},"markdownRemark":{"html":"<p>Let’s talk about climate change on a wide range of crazy perspective..I can’t wrap my mind around the scale of what the next 30 to 50 years would look like. The recent <a href=\"http://www.ipcc.ch/report/sr15/\">IPCC Report</a> of UN argues that we have only 2040 until we face the point of no return. </p>\n<p>BTW, for climate change deniers..<a href=\"https://www.google.com.ph/search?q=97%25+of+leading+scientists&#x26;rlz=1C1CHBF_enPH738PH738&#x26;oq=97%25+of+leading+scientists&#x26;aqs=chrome..69i57.7599j0j4&#x26;sourceid=chrome&#x26;ie=UTF-8\">97% of leading scientists</a> all over the world agree on this. A definitive emergent truth.</p>\n<p>Carbon dioxide (CO2) is simply a residual of everything we do as humans. Since most of our energy consumption is being supplied by fossil fuels, It’s hard to accept that we, ALL OF US is a part of it. Look at the graph below.</p>\n<img src=\"https://ourworldindata.org/wp-content/uploads/2017/04/Global-CO2-emissions-by-region-since-1751.png\"> \n<p>We created an economy all over the world that reliance to Carbon based fuels is inevitable and led to unnecessary accumulation of greenhouse gasses in the atmosphere. These gasses are responsible for trapping the heat of sun. </p>\n<p>Below are the problems we will be facing if we fail to act within a decade..</p>\n<ul>\n<li><b>Polar ice caps melting</b>. The earth is a wonderful ball of chemistry that At present, we have reached a 1% temperature rise from the pre-industrial era (1800s) it is well explained below in the graph. </li>\n</ul>\n<p> Sea level rise\nExtreme heatwaves\nMassive Storms </p>\n<ul>\n<li>War and famine</li>\n<li>Ocean Acidification </li>\n</ul>\n<p>all is probable unless we change our ways of living..</p>\n<p>I studied much of what’s written here in last two weeks..</p>","excerpt":"Let’s talk about climate change on a wide range of crazy perspective..I can’t wrap my mind around the scale of what the next 30 to 50 years…","fields":{"tagSlugs":["/tags/climate-change/"]},"frontmatter":{"title":"Climate Change","tags":["climate change"],"date":"November 02, 2018"}}},"pageContext":{"slug":"/Climate change and this had put my mind into perspective more than anything else/"}}